{
    "name": "Chen Richard",
    "personal background": "<Dr. Chen Richard Li received BSc in computer science and technology from Nanjing University, and MSc (Distinction) in computer science and PhD from the City University of Hong Kong. He worked as a senior research associate at the City University of Hong Kong and a postdoc research fellow at the University of Canterbury.",
    "research interest": "<Dr. Li's research interest is in collaborating with talents with various backgrounds to design new technology-assisted solutions for supporting people in their daily lives. His research outcomes related to the use of virtual reality for children with special educational needs have been adopted by mainstream and special schools in Hong Kong. Academically, his research works were published in international journals such as Computers & Education (C&E), IEEE Transactions on Visualization and Computer Graphics (TVCG), International Jounral of Human-Computer Studies (IJHCS), and IEEE Transactions on Learning Technologies (TLT), as well as conference proceedings such as the proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces (VR) and the International Symposium on Mixed and Augmented Reality (ISMAR). He currently serves as the president of , member of the governing board of the , and member of the editorial board of the .</content>",
    "publication": "Title: Dr. Li's Research Interests and Publications\nPublished Time: Not available\nConference:\n- Collaborating with talents from various backgrounds to design new technology-assisted solutions for supporting people in their daily lives.\n- Use of virtual reality for children with special educational needs.\n\nAcademic Publications:\n- Computers & Education (C&E)\n- IEEE Transactions on Visualization and Computer Graphics (TVCG)\n- International Journal of Human-Computer Studies (IJHCS)\n- IEEE Transactions on Learning Technologies (TLT)\n\nConference Proceedings:\n- Proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces (VR)\n- International Symposium on Mixed and Augmented Reality (ISMAR)",
    "recruitment": "<hr />\n<content>\n  Recruitment Information:\n  - Self-motivated MPhil/PhD students with strong academic backgrounds in computer science, creative media, communication, or psychology\n  - Interested in human-centered computing research\n\n  Salary: Not specified\n\n  Lab Condition: \n    - Department of Applied Social Sciences and the Department of Computing at The Hong Kong Polytechnic University\n</content>"
}