{
    "name": "Dr Man Ho Allen Au",
    "personal background": "<Dr. Man Ho Allen Au is a Full Professor at the Department of Computing of The Hong Kong Polytechnic University. Before that, he was an Associate Professor in the Department of Computer Science at the University of Hong Kong. Allen's research interests include Information Security, Applied Cryptography, Blockchain Technology, and their applications. He has been ranked as HKU Scholar in the Top 1% (by Clarivate Analytics in the top 1% worldwide by citations) in 2020 - 2022. He is also listed as the World's Top 2% Scientists by single-year impact and by career-long impact in the list published by Stanford University in Oct 2022. His research has generated significant social and economic impact. In the past 5 years, he as the principal investigator has attracted over HK$30M in research and high-level consultancy projects. He is currently an associate editor of IEEE Transactions on Dependable and Secure Computing, Journal of Information Security and Applications, and an editorial board member of Journal of Cryptologic Research.> <Man Ho Au is a researcher with expertise in cryptography, blockchain, and cybersecurity. He has published numerous papers in top-tier conferences and journals, including IEEE Transactions on Mobile Computing, International Journal of Information Security, and IEEE Transactions on Dependable and Secure Computing. He has also served as a member of the Professional Services Committee for the Hong Kong Blockchain Society R&D division and an expert member for ISO/IEC JTC 1/SC 27 WG 2 - Cryptography and Security Mechanisms. Additionally, he has trained training on blockchain technology for OGCIO from June 2019 to June 2020.]",
    "research interest": "Information security, Applied Cryptography, Blockchain Technology",
    "publication": "Title: Dr. Man Ho Allen Au - Researcher Profile\nPublished Time: Not specified\nConference:\n- The Hong Kong Polytechnic University (Department of Computing)\n- University of Hong Kong (Department of Computer Science)\n\nResearch Interests:\nInformation Security, Applied Cryptography, Blockchain Technology, and their applications.\n\nAwards and Recognition:\n- Ranked as HKU Scholar in the Top 1% (by Clarivate Analytics) in 2020-2022\n- Listed as the World's Top 2% Scientists by single-year impact and by career-long impact in the list published by Stanford University in Oct 2022\n\nResearch Impact:\nHis research has generated significant social and economic impact. In the past 5 years, he as the principal investigator has attracted over HK$30M in research and high-level consultancy projects.\n\nEditorial Positions:\n- Associate editor of IEEE Transactions on Dependable and Secure Computing\n- Editorial board member of Journal of Cryptologic Research <Title: Electronic Cash for Mobile Payment</Title>\n<p>IEEE Transactions on Mobile Computing (to appear) (2021)</p>\n\n<Title: Toward A Blockchain-based Framework For Challenge-based Collaborative Intrusion Detection</Title>\n<p>International Journal of Information Security 20(2): 127-139 (2021)</p>\nAuthor: Wenjuan Li, Yu Wang, Jin Li and Man Ho Au\n\n<Title: A Fog-based Collaborative Intrusion Detection Framework For Smart Grid</Title>\n<p>International Journal of Network Management 31(2) (2021)</p>\nAuthors: Yuefeng Du, Huayi Duan, Anxin Zhou, Cong Wang, Man Ho Au and Qian Wang\n\n<Title: Enabling Secure and Efficient Decentralized Storage Auditing with Blockchain</Title>\n<p>IEEE Transactions on Dependable and Secure Computing 19(5): 3038-3054 (2021)</p>\nAuthors: Qingqing Ye, Haibo Hu, Man Ho Au, Xiaofeng Meng and Xiaokui Xiao\n\n<Title: LF-GDPR: A Framework for Estimating Graph Metrics with Local Differential Privacy</Title>\n<p>IEEE Transactions on Knowledge and Data Engineering 34(10): 4905-4920 (2020)</p>\nAuthors: Weizhi Meng, Wenjuan Li, Yu Wang and Man Ho Au\n\n<Title: Detecting insider attacks in medical cyber-physical networks based on behavioral profiling</Title>\n<p>Future Generation Computer Systems 108: 1258-1266 (2020)</p>\nAuthors: Wenjuan Li, Weizhi Meng and Man Ho Au\n\n<Title: Enhancing collaborative intrusion detection via disagreement-based semi-supervised learning in IoT environments</Title>\n<p>Journal of Network and Computer Applications 161: 102631 (2020)</p>\nAuthors: Wenjuan Li, Weizhi Meng and Man Ho Au\n\n<Title: Efficient Message Authentication with Revocation Transparency Using Blockchain for Vehicular Networks</Title>\n<p>Computers & Electrical Engineering 86:106721 (2020)</p>\nAuthors: Kang Li, Wang Fat Lau, Man Ho Au, Ivan Wang-Hei Ho and Yilei Wang\n\n<Title: Geometric range search on encrypted data with Forward/Backward security</Title>\n<p>IEEE Transactions on Dependable and Secure Computing 19(1): 698-716 (2020)</p>\nAuthors: Shabnam Kasra Kermanshahi, Shifeng Sun, Joseph Liu, Ron Steinfeld, Surya Nepal, Wang Fat Lau and Man Ho Au\n\n<Title: Towards Blockchain-Based Software-Defined Networking: Security Challenges and Solutions</Title>\n<p>IEICE Transactions on Information and Systems 103-D(2):196-203 (2020)</p>\nAuthors: Wenjuan Li, Weizhi Meng, Zhiqiang Liu and Man Ho Au",
    "recruitment": "* Dr. Allen Au is a Full Professor at The Hong Kong Polytechnic University.\n* Before that, he was an Associate Professor in the Department of Computer Science at the University of Hong Kong.\n* His research interests include Information Security, Applied Cryptography, Blockchain Technology, and their applications.\n* He has been ranked as HKU Scholar in the Top 1% (by Clarivate Analytics in the top 1% worldwide by citations) in 2020 - 2022.\n* He is also listed as the World's Top 2% Scientists by single-year impact and by career-long impact in the list published by Stanford University in Oct 2022. <Recruitment Information:\n None>\n\n<Salary:\n Not specified>\n\n<Lab Conditions:\n None>"
}