{
    "name": "Jibin",
    "personal background": "<Dr. Jibin Wu is an Assistant Professor jointly appointed in the Department of Data Science and Artificial Intelligence and the Department of Computing, The Hong Kong Polytechnic University. Before joining PolyU, he was a research scientist at Sea AI Lab (SAIL) from 2021 to 2022. Dr. Wu received Bachelor and Ph.D. degrees from National University of Singapore (NUS) in 2016 and 2020, respectively.\n\nDr. Wu is currently affiliated with the MIND Lab@PolyU, which is dedicated to advancing the frontiers of nature-inspired artificial intelligence research. His research interests encompass a wide range of areas, focusing on brain-inspired artificial intelligence, neuromorphic computing, computational audition, speech processing, and machine learning.\n\nHis primary dedication lies in unraveling the computational principles and architectures of biological brains while also striving to develop cutting-edge brain-inspired cognitive machines that possess exceptional intelligence, energy efficiency, robustness, adaptability, and explainability.> <Content about researcher's background is missing, as it was not found relevant in the input text. The information seems to be categorized by research interests and does not provide explicit details about the researchers' backgrounds.>",
    "research interest": "<Dr. Wu's research interests encompass a wide range of areas, focusing on brain-inspired artificial intelligence, neuromorphic computing, computational audition, speech processing, and machine learning. His primary dedication lies in unraveling the computational principles and architectures of biological brains while also striving to develop cutting-edge brain-inspired cognitive machines that possess exceptional intelligence, energy efficiency, robustness, adaptability, and explainability.\n\nDr. Wu has actively published in prestigious conferences and journals in artificial intelligence and speech processing, including NeurIPS, AAAI, TPAMI, TNNLS, TASLP, Neurocomputing, and IEEE JSTSP. He is currently serving as the Associate Editors for IEEE Transactions on Neural Networks and Learning Systems and IEEE Transactions on Cognitive and Developmental Systems.\n\nDr. Wu's research interests include:\n\n- Computational Neuroscience\n- Learning Algorithms for Spiking Neural Networks\n- Neural Coding\n- Brain-inspired Neural Architecture Design\n\n- Computational Audition\n- Human Auditory System Modelling\n- Auditory Attention Modelling\n- Cocktail Party Problem\n\n- Speech Processing\n- Automatic Speech Recognition\n- Speech Separation\n- Speaker Extraction\n- Speaker Verification\n\n- Cognitive Robot\n- Neuromorphic Sensing\n- Human-Robot Interaction\n- Embodied AI\n- Neural Cognitive Architecture> <Learning>\n<NeuroAI>\n<AGI>\n<Deep Learning>\n\n<Multimodal Biomedical AI>\n<Causal Inference>\n<Domain Adaptation>\n\n<AUDIO/SPEECH SIGNAL PROCESSING>\n\n<Neuromorphic Computing>\n<Spiking Neural Networks>\n\n<SPIKING NEURAL NETWORK>\n<LOCAL LEARNING>\n\n<SPEECH PROCESSING>\n<SPIKING NEURAL NETWORKS>\n<NEUROMORPHIC COMPUTING>\n\n<Automatic Speech Recognition>\n\n<MACHINE LEARNING>\n<AUDIO SIGNAL PROCESSING>",
    "publication": "<Title>Dr. Jibin Wu's Research</Title>\n<Published Time>Not available</Published Time>\n<Conference>\n    NeurIPS\n    AAAI\n    TPAMI\n    TNNLS\n    TASLP\n    Neurocomputing\n    IEEE JSTSP\n</Conference>\n\n<Research Interests>\n    Spiking Neural Networks\n    Audio Signal Processing\n</Research Interests>\n\n<Publications>\n    Computational Neuroscience\n    Learning Algorithms for Spiking Neural Networks, Neural Coding, Brain-inspired Neural Architecture Design\n    Computational Audition\n    Human Auditory System Modelling, Auditory Attention Modelling, Cocktail Party Problem\n    Speech Processing\n    Automatic Speech Recognition, Speech Separation, Speaker Extraction, Speaker Verification, etc.\n    Cognitive Robot\n    Neuromorphic Sensing, Human-Robot Interaction, Embodied AI, Neural Cognitive Architecture\n</Publications>\n\n<Education>\n    Doctor of Philosophy, 2020 - National University of Singapore\n    BEng in Electrical Engineering, 2016 - National University of Singapore\n</Education>",
    "recruitment": "<Salary not mentioned, but listed under experience>\n \n<Lab condition: The researcher is affiliated with the MIND Lab@PolyU, which is dedicated to advancing the frontiers of nature-inspired artificial intelligence research.> <Content about researcher's recruitment information, salary and lab condition>\nNo relevant content found."
}