{
    "name": "Kai",
    "personal background": "<Research Background>\nI am an assistant professor at PolyU, with research interests centered around AI Security, Adversarial Machine Learning, and Data Security and Privacy. My general goal is to make intelligent systems secure, robust, privacy-aware, and trustworthy. <Yuni Lai is a Ph.D. student at STiL and joined our group as one of her collaborators.\nYuni Lai’s background includes being a Ph.D. student at Michigan State University, where she obtained her degree from 2013.8 - 2018.5.\nShe also holds a B.S. in Electrical and Computer Engineering from Shanghai Jiao Tong University, (电院), from 2009.9 - 2013.7.\nYuni Lai was a Post-doc at Vanderbilt University from 2018.5 - 2018.8, then moved to Washington University in St. Louis, from 2018.8 - 2020.4.\nCurrently, she is an Assistant Professor at The Hong Kong Polytechnic University, Department of Computing since 2020.7 - Present.",
    "research interest": "<AI Security \nwith emphasis on Adversarial Machine Learning, and Adversarial Network Analysis \nData Security and Privacy \n\nmake intelligent systems secure , robust , privacy-aware , and trustworthy </AI> * Structural attacks against graph-based anomaly detection\n* Android malware detection\n* Attacking sign prediction in signed graphs\n* Adversarial robustness of Graph-based Anomaly Detection under Structural Attacks\n* BinarizedAttack: Structural Poisoning Attacks to Graph-based Anomaly Detection\n* User profiles generation under Hierarchical-structure Policy Gradient",
    "publication": "<News • [06/2024] I am serving as the TPC Co-chairs for Communications and Information Security at ICNC'25. Please consider submitting your papers! It is in Hawaii!\n\n<News • [05/2024] Our work on certified robustness of GNNs is now accepted toICML 2024. Congratulations to Yuni Lai!\n\n<News • [03/2024] Congratulations to Longling Geng, our Alumnia and former PolyU COMP Undergraduate student, on her acceptance intoStanfordas a graduate student!\n\n<News • [03/2024] Our work on making graph learning models provably robust is now accepted toIEEE Symposium on Security and Privacy (Oakland) 2024. Congratulations to Yuni and Yulin.\n\n<News • [05/2022,Grant] We got a grant from PolyU to conduct research on cleaning graph data against attacks. Multiple RA positions are available.\n\n<News • [11/2021] Our work onstructural attacks against graph-based anomaly detectionis accepted for publication atICDE'22. Congratulations to Yulin and Yuni.\n\n<News • [11/2021] Our work onstructural attacks against graph-based anomaly detectionis accepted for publication atICDE'22. Congratulations to Yulin and Yuni.\n\n<News • [09/2021] With our collaborator Prof. Xiapu Luo, one paper onstructural attacks against Android malware detectionis accepted toCCS'21.\n\n<News • [09/2021] With our collaborator Prof. Tomasz P. Michalak, one paper onattacking sign prediction in signed graphsis accepted toICDM'21.\n\n<News • [08/2021] Yu Bu and Yuni Lai officially joined our group STiL as Ph.D. students. Welcome on board!\n\n<News • [08/2021,Grant] Our project \"Structural Attacks to Trust Analysis Systems in Signed Social Networks\" is funded by theYoung Scientist Fund,National Natural Science Foundation of China.",
    "recruitment": "*Researcher's Recruitment Information:\n    - Self-motivated Ph.D. student/Research Assistant/Post-doc to join group, including masters and undergraduate students at PolyU.\n    - Remote Research Assistant positions available for candidates from Mainland China universities.\n\n*Salary:\n    - RMB 1k - 8k per month, depending on profile.\n\n*Lab Condition: \n    - The lab is located in Hung Hom, Kowloon, Hong Kong, China. <Multiple RA positions available for research on cleaning graph data against attacks.>\n\n<Salary not mentioned in the input.>\n\n<Lab condition: The lab has been working on various projects such as structural attacks against graph-based anomaly detection and trust analysis systems in signed social networks, with funding from the National Natural Science Foundation of China and the University Grants Committee (UGC) through theEarly Career Scheme (ECS).>"
}