{
    "name": "LI Jing Amelia",
    "personal background": "<Dr. Jing Li is an Assistant Professor of the , (PolyU) since 2019. She is a member of . Before joining PolyU, she worked in the , as a senior researcher from 2017 to 2019. Jing obtained her PhD degree from the , in 2017 under supervision of . Before that, she received her B.S. degree from , in 2013.>\n\n\n\n<Jing has broad research interests on Natural Language Processing (NLP), Computational Social Science (CSS), and Machine Learning (ML). Particularly, she works on novel algorithms for language representation learning, social media language understanding, conversation and social interaction modeling, and robust NLP and multimodal applications in the noisy real-world applications.>\n• Oct 2019 - Sep 2022:Discourse Parsing for Online Conversations.\n\n• Oct 2019 - Sep 2022:Discourse Parsing for Online Conversations.\n\n• Jan 2021 - Dec 2023:Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms.\n\n• Jan 2021 - Dec 2021:Comment-Aware Weakly-Supervised Classification for Social Media Texts.\n< Jing Li>\n\n<Microblog Summarization Using Conversation Structures>\n\n• Academic Experience • Visiting PhD at Aston University, Birmingham, UK, Jan - Apr, 2016, Supervisor:Prof. Yulan He(Now with King's College London.) • Visiting PhD at Northeastern University, Boston, USA, Feb - May, 2017, Supervisor:Prof. Lu Wang(Now with University of Michigan.)",
    "research interest": "• Pre-training and Language Representation Learning \n\n• Natural Language Understanding (NLU) for Social Media Contents \n\n• Large Language Models and Embodied Agents\n\n* Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms.\n\n* Discourse Parsing for Online Conversations.\n\n* Comment-Aware Weakly-Supervised Classification for Social Media Texts.\n\n* Social-Transformers: A Deep Pre-training Framework for Social Media Language Understanding.\n\n* Pre-training Methods for Short Texts.\n\n<Research interests include pre-training methods for short texts, comment-aware weakly-supervised classification for social media texts, characterize, detect, and neutralize: context-aware computational methods for media bias on social platforms, discourse parsing for online conversations.>",
    "publication": "[NEW]Our ongoing work,AnglE, for angle-optimized text embeddings has achieved over400kdownloads on Hugging Face last month (peaked at over500k). Congrats to Xianming, and thanks to the Hugging Face team! [Manuscript] [Github] [Hugging Face].\n\n\n\n[NEW]Our ongoing work with SUSTech,LLM4Decompile, for Decompiling Binary Code with Large Language Models has achieved over2.5k stars (☆)on Github. Congrats to Hanzhuo! [Manuscript] [Github].\n\n\n\n[NEW]Our new work,HICL, a new pre-trained model for social media in context learning is accepted atTNNLSjournal. Congrats to Hanzhuo! [Paper] [Github]\n\n\n\n[NEW]One new workBeLLM, a Backward Dependency Enhanced Large Language Model for Sentence Embeddings is accepted atNAACL 2024. Congrats to Xianming! [Paper] [Github].\n\n\n\n[NEW]One our new workPopALM, popularity-aligned LLM for popular comment prediction is accepted atLREC-COLING 2024. Congrats to Erxin! [Paper] [Github].\n\n\n\nSelected Publications \n\n• Xianming Li andJing LiBeLLM: Backward Dependency Enhanced Large Language Model for Sentence EmbeddingsNAACL 2024.[Github]\n\n• Erxin Yu,Jing Li, Chunpu XuPopALM: Popularity-Aligned Language Models for Social Media Trendy Response PredictionLREC-COLING 2024.[Github]\n\n• Hanzhuo Tan, Chunpu Xu,Jing Li, Yuqun Zhang, Zeyang Fang, Zeyu Chen, Baohua LaiHICL: Hashtag-Driven In-Context Learning for Social Media Natural Language UnderstandingTNNLS 2024.[Github]\n\n• Yuji Zhang,Jing Li, Wenjie LiVIBE: Topic-Driven Temporal Adaptation for Twitter ClassificationEMNLP 2023.[Github]\n\n• Renzhi Wang,Jing Li, Piji LiInfoDiffusion: Information Entropy Aware Diffusion Process for Non-Autoregressive Text GenerationEMNLP 2023 (Findings).[Github]\n\n• Chunpu Xu,Jing Li, Piji Li, Min YangTopic-Guided Self-Introduction Generation for Social Media UsersACL 2023 (Findings).[Github]\n\n• Chunpu Xu,Jing Li, Piji Li, Min YangTopic-Guided Self-Introduction Generation for Social Media UsersACL 2023 (Findings).[Github]\n\n• Yibing Liu, Haoliang Li, Yangyang Guo, Chengqi Kong,Jing Li, Shiqi WangRethinking Attention-Model Explainability through Faithfulness Violation TestICML 2022.[Github]\n\n• Zhengran Zeng, Hanzhuo Tan, Haotian Zhang,Jing Li, Yuqun Zhang, Lingming ZhangAn Extensive Study on Pre-trained Models for Program Understanding and GenerationISSTA 2022.[Github]\n\n• Chunpu Xu andJing LiBorrowing Human Senses: Comment-Aware Self-Training for Social Media Multimodal ClassificationEMNLP 2022.[Github]\n\n• Chunpu Xu, Hanzhuo Tan,Jing Li, and Piji LiUnderstanding Social Media Cross-Modality Discourse in Linguistic SpaceEMNLP 2022 (Findings).[Github]\n\n• Kaifa Zhao, Le Yu, Shiyao Zhou,Jing Li, Xiapu Luo, Yat Fei Aemon Chiu, Yutong LiuA Fine-grained Chinese Software Privacy Policy Dataset for Sequence Labeling and Regulation Compliant IdentificationEMNLP 2022.[Github]\n\n• Xiaoxin Lu, Yubo Zhang,Jing Li, Shi ZongDoctor Recommendation in Online Health Forums via Expertise LearningACL 2022.[Github]\n\n• Lingzhi Wang,Jing Li, Xingshan Zeng\n\nHere is the extracted content:\n\n\n\n**1. Kam-Fai Wong - Successful New-entry Prediction for Multi-Party Online Conversations via Latent Topics and Discourse Modeling**\n\n• Title: Successful New-entry Prediction for Multi-Party Online Conversations via Latent Topics and Discourse Modeling\n\n• Published Time: WWW 2022\n\n• Conference: WWW 2022\n\n\n\n**2. Yuji Zhang, Yubo Zhang, Chunpu Xu, Jing Li, Ziyan Jiang, and Baolin Peng - How You Tag Tweets: Learning User Hashtagging Preferences via Personalized Topic Attention**\n\n• Title: How You Tag Tweets: Learning User Hashtagging Preferences via Personalized Topic Attention\n\n• Published Time: EMNLP 2021\n\n• Conference: EMNLP 2021\n\n\n\n**3. Xingshan Zeng, Jing Li, Lingzhi Wang, and Kam-Fai Wong - Modeling Global and Local Interactions for Online Conversation Recommendation**\n\n• Title: Modeling Global and Local Interactions for Online Conversation Recommendation\n\n• Published Time: ACM TOIS 2021\n\n• Conference: ACM TOIS 2021\n\n\n\n**4. Rong Xiang, Jing Li, Mingyu Wan, Jinghang Gu, Qin Lu, Wenjie Li, Chu-Ren Huang - Affective Awareness in Neural Sentiment Analysis**\n\n• Title: Affective Awareness in Neural Sentiment Analysis\n\n• Published Time: KBS Journal Volume 226 (2021)\n\n• Conference: KBS Journal\n\n\n\n**5. Zexin Lu, Keyang Ding, Yuji Zhang, Jing Li, Baolin Peng, and Lemao Liu - Engage the Public: Poll Question Generation for Social Media Posts**\n\n• Title: Engage the Public: Poll Question Generation for Social Media Posts\n\n• Published Time: ACL-IJCNLP 2021\n\n• Conference: ACL-IJCNLP 2021\n\n\n\n**6. Zexin Lu, Keyang Ding, Yuji Zhang, Jing Li, Baolin Peng, and Lemao Liu - Engage the Public: Poll Question Generation for Social Media Posts**\n\n• Title: Engage the Public: Poll Question Generation for Social Media Posts\n\n• Published Time: ACL-IJCNLP 2021\n\n• Conference: ACL-IJCNLP 2021\n\n\n\n**7. Lu Ji, Zhongyu Wei, Jing Li, Qi Zhang, and Xuanjing Huang - Discrete Argument Representation Learning for Interactive Argument Pair Identification**\n\n• Title: Discrete Argument Representation Learning for Interactive Argument Pair Identification\n\n• Published Time: NAACL 2021\n\n• Conference: NAACL 2021\n\n\n\n**8. Lei Chen, Zhongyu Wei, Jing Li, Baohua Zhou, Qi Zhang, and Xuanjing Huang - Modeling Evolution of Message Interaction for Rumor Resolution**\n\n• Title: Modeling Evolution of Message Interaction for Rumor Resolution\n\n• Published Time: COLING 2020\n\n• Conference: COLING\n\n\n\n**9. Keyang Ding, Jing Li, and Yuji Zhang - Hashtags, Emotions, and Comments: A Large-Scale Dataset to Understand Find-Grained Social Emotions to Online Topics**\n\n• Title: Hashtags, Emotions, and Comments: A Large-Scale Dataset to Understand Find-Grained Social Emotions to Online Topics\n\n• Published Time: EMNLP 2020 (short paper)\n\n• Conference: EMNLP 2020\n\n\n\n**10. Lingzhi Wang, Jing Li, Xingshan Zeng, Haisong Zhang, and Kam-Fai Wong - Continuity of Topic, Interaction, and Query: Learning to Quote in Online Conversations**\n\n• Title: Continuity of Topic, Interaction, and Query: Learning to Quote in Online Conversations\n\n• Published Time: EMNLP 2020\n\n• Conference: EMNLP 2020\n\n\n\n**11. Lingzhi Wang, Jing Li, Xingshan Zeng, Haisong Zhang, and Kam-Fai Wong - Continuity of Topic, Interaction, and Query: Learning to Quote in Online Conversations**\n\n• Title: Continuity of Topic, Interaction, and Query: Learning to Quote in Online Conversations\n\n• Published Time: EMNLP 2020\n\n• Conference: EMNLP 2020\n\n\n\n**12. Yue Wang, Jing Li, Michael R. Lyu, and Irwin King - Cross-Media Keyphrase Prediction: A Unified Framework with Multi-Modality Multi-Head Attention and Image Wordings**\n\n• Title: Cross-Media Keyphrase Prediction: A Unified Framework with Multi-Modality Multi-Head Attention and Image Wordings\n\n• Published Time: EMNLP 2020\n\n• Conference: EMNLP 2020\n\n\n\n**13. Xingshan Zeng, Jing Li, Lu Wang, Zhiming Mao, and Kam-Fai Wong - Dynamic Online Conversation Recommendation**\n\n• Title: Dynamic Online Conversation Recommendation\n\n• Published Time: ACL 2020\n\n• Conference: ACL\n\n\n\n**14. Jichuan Zeng, Jing Li, Yulan He, Cuiyun Gao, Michael R. Lyu, and Irwin King - What Changed Your Mind: The Roles of Dynamic Topics and Discourse in Argumentation Process**\n\n• Title: What Changed Your Mind: The Roles of Dynamic Topics and Discourse in Argumentation Process\n\n• Published Time: GitHub\n• Conference: GitHub\n\nTitle: Yue Wang, Jing Li, Irwin King, Michael R. Lyu, and Shuming Shi.Microblog Hashtag Generation via Encoding Conversation Contexts\n\nPublished Time: NAACL 2019.\n\nConference: NAACL \n\n\n\nTitle: Jichuan Zeng,Jing Li, Yulan He, Cuiyun Gao, Michael R. Lyu, and Irwin King\n\nWhat You Say and How You Say it: Joint Modeling of Topics and Discourse in Microblog Conversations\n\nPublished Time: TACL 2019 (presented in ACL 2019).\n\nConference: TACL\n\n\n\nTitle: Jing Li, Yan Song, Zhongyu Wei, and Kam-Fai Wong.\n\nA Joint Model of Conversational Discourse and Latent Topics on Microblogs\n\nPublished Time: CL 2018. (Volume 44, Issue 4)\n\nConference: CL \n\n\n\nTitle: Jing Li, Yan Song, Zhongyu Wei, and Kam-Fai Wong.\n\nA Joint Model of Conversational Discourse and Latent Topics on Microblogs\n\nPublished Time: CL 2018. (Volume 44, Issue 4)\n\nConference: CL \n\n\n\nTitle: Jichuan Zeng,Jing Li, Yan Song, Cuiyun Gao, Michael R. Lyu, and Irwin King.\n\nTopic Memory Networks for Short Text Classification\n\nPublished Time: EMNLP 2018.\n\nConference: EMNLP\n\n\n\nTitle: Dingmin Wang, Yan Song,Jing Li, Jialong Han, and Haisong Zhang\n\nA Hybrid Approach to Automatic Corpus Generation for Chinese Spelling Check\n\nPublished Time: EMNLP 2018.\n\nConference: EMNLP \n\n\n\nTitle: Xingshan Zeng,Jing Li, Lu Wang, Nicholas Beauchamp, Sarah Schugars, and Kam-Fai Wong\n\nMicroblog Conversation Recommendation via Joint Modeling of Topics and Discourse\n\nPublished Time: NAACL 2018.\n\nConference: NAACL \n\n\n\nTitle: Yingyi Zhang,Jing Li, Yan Song, and Chengzhi Zhang\n\nEncoding Conversation Context for Neural Keyphrase Extraction from Microblog Posts\n\nPublished Time: NAACL 2018.\n\nConference: NAACL \n\n\n\nTitle: Jing Li\n\nMicroblog Summarization Using Conversation Structures\n\nPublished Time: PhD thesis. \n\nConference: PhD thesis.\n\n\n\nTitle: Jing Li, Ming Liao, Wei Gao, Yulan He, and Kam-Fai Wong\n\nTopic Extraction from Microblog Posts Using Conversation Structures\n\nPublished Time: Data[Code]\n\nConference: Data \n\n\n\nTitle: Jing Li, Wei Gao, Zhongyu Wei, Baolin Peng, and Kam-Fai Wong\n\nUsing Content-level Structures for Summarizing Microblog Repost Trees\n\nPublished Time: ACL 2016.\n\nConference: ACL\nTitle: Zuchen Gao, PhD student (collaborative programme with SUSTech). Sep 2022-now. Co-supervisors:Prof. Daniel Xiapu LuoandProf. Yuqun Zhang(SUSTech).\n\nPublication: [COLING 2024]\n\n\n\nTitle: Hanzhuo Tan, PhD student (collaborative programme with SUSTech). Jan 2022-now. Co-supervisors:Chair Prof. Changwen ChenandProf. Yuqun Zhang(SUSTech).\n\nPublication: [TNNLS 2024] [EMNLP 2022 (Findings)]\n\n\n\nTitle: Chunpu Xu, PhD student. Aug 2021-now.\n\nPublication: [EMNLP 2022 (Findings)]\n\n<Title>: Researchers' Publications\n\n<published time>:\n\n- [COLING 2024]\n\n- [TNNLS 2024]\n\n- [EMNLP 2022]\n\n- [EMNLP 2022 (Findings)]\n\n- [EMNLP 2021]\n\n- [ACL-IJCNLP 2021]\n\n- [EMNLP 2020]\n\n- [ACL 2022]\n\n- [ACL 2022 (Doctor Recommendation in Online Health Forums via Expertise Learning)]\n\n- [ACL-IJCNLP 2021]\n\n- [EMNLP 2021]\n\n- [SLT 2021]\n\n- [ICML 2022]\n\n- [EMNLP 2020]\n\n- [NAACL 2018]\n\n- [JASIST 2019]\n\n- [EMNLP 2018]\n\n- [TACL 2019]\n\n- [WWW 2020]\n\n- [NAACL 2019]\n\n- [ACL 2019]\n\n- [EMNLP 2020]\n\n- [NAACL 2021]\n\n- [EMNLP 2019]\n\n- [TOIS 2021]\n\n- [EACL (Findings)]\n\n- [COLING 2020]",
    "recruitment": "<Recruitment Information>\n\nDrop me your CV if you are interested in joining our team as a PhD/Research Associate/Research Assistant/Post-doc.I may not be able to reply all emails (but I do read them)!\n\n\n\n<Salary Information>\n\nNot mentioned\n\n\n\n<Lab Conditions>\n\nNot mentioned\n\n*Researcher's Recruitment Information:* None\n\n*Salary:* Not mentioned\n\n*Lab Condition:* PolyU Internal Fund; CCF-Baidu Open Fund (matched with RGC-RMGS); CCF-Tencent Rhino-Bird Young Faculty Open Research Fund (matched with RGC-RMGS); NSFC (Young Scientists Fund); Gift Fund from Zhongjiaoyunzhi (matched with RGC-RMGS); PolyU Internal Fund under Freshman Seminar; AIDA Interactive Playground (only for internal use of PolyU students)\n\n• Oct 2019 - Sep 2022:Discourse Parsing for Online Conversations. NSFC (Young Scientists Fund).\n\n• PolyU Internal Fund.• July 2021 - June 2022:Development of a 3-hour Online Programme on Artificial Intelligence and Data Analytics.\n\n• PolyU Internal Fund under Freshman Seminar for the Online Teaching Development and Educational Research Grant as PI with Co-PIDr. Richard Lui.\n\n• Jan 2022 - Dec 2022:Pre-training Methods for Short Texts. CCF-Baidu Open Fund (matched with RGC-RMGS).\n\n• Jan 2021 - Dec 2021:Comment-Aware Weakly-Supervised Classification for Social Media Texts. CCF-Tencent Rhino-Bird Young Faculty Open Research Fund (matched with RGC-RMGS).\n\n• Jan 2021 - Dec 2023:Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms. NSFC (Young Scientists Fund).\n\n• PolyU Internal Fund.• Jan 2022 - Dec 2022:Pre-training Methods for Short Texts. CCF-Baidu Open Fund (matched with RGC-RMGS).\n\n• Jan 2021 - Dec 2023:Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms. NSFC (Young Scientists Fund).\n\nUnfortunately, there is no relevant content about researcher's recruitment information, salary, and lab condition available in the input.\n\n<Researcher's Recruitment Information:\n\n    - Yue Wang,Jing Li, Michael R. Lyu, and Irwin King are involved in various projects including Cross-Media Keyphrase Prediction, Microblog Hashtag Generation, and Topic-Aware Neural Keyphrase Generation for Social Media Language.\n\n    - Xingshan Zeng,Jing Li, Lu Wang, Zhiming Mao, and Kam-Fai Wong worked on Dynamic Online Conversation Recommendation, Joint Effects of Context and User History for Predicting Online Conversation Re-entries, and Microblog Conversation Recommendation via Joint Modeling of Topics and Discourse.\n\n    - Jichuan Zeng,Jing Li, Yulan He, Cuiyun Gao, Michael R. Lyu, and Irwin King collaborated on What Changed Your Mind: The Roles of Dynamic Topics and Discourse in Argumentation Process, Topic Memory Networks for Short Text Classification, and What You Say and How You Say it: Joint Modeling of Topics and Discourse in Microblog Conversations.\n\n    - Ming Liao,Jing Li, Haisong Zhang, Lingzhi Wang, Xixin Wu, and Kam-Fai Wong worked on Coupling Global and Local Context for Unsupervised Aspect Extraction.\n\n    - Jing Li is involved in various projects including Microblog Summarization Using Conversation Structures, A Joint Model of Conversational Discourse and Latent Topics on Microblogs (published in CL 2018), and Topic Extraction from Microblog Posts Using Conversation Structures.\n\n\n\n<Salary Information:\n\nNo explicit salary information is provided in the given input text.\n\n\n\n<Lab Condition:\n\n- Most of the research projects are published at reputable conferences such as ACL, EMNLP, NAACL, and appeared on Github or other data repositories.\n\n- The researchers' names often appear together with their collaborators to suggest a collaborative lab environment."
}