{
    "name": "ROSSI_Luca",
    "personal background": "• Currently working as a research assistant for PhD and postdoctoral opportunities at PolyU.\n• Current focus areas include applying for the Hong Kong PhD Fellowship Scheme under supervision, chairing S+SSPR 2024, working on various research projects including GraFix: A Graph Transformer with Fixed Attention based on the WL Kernel, Graph Kernel Neural Network, Graph neural networks in vision-language image understanding: a survey, GNN-LoFI: A novel graph neural network through localized feature-based histogram intersection, Can I write this is ableist AF in a peer review?: A corpus-driven analysis of Twitter engagement strategies across disciplinary groups, and others. <Researcher's Background>\nL. Rossi and A. Torsello are researchers. <The researchers involved are affiliated with various institutions including Politecnico di Milano, and include L. Cosmo, G. Minello, M. Bronstein,L. Rossiand A. Torsello, D. Foffano, Z. Zhang, Y. Jiao, E. R. Hancock, L. Cui, L. Bai, L. Rossi, Y. Wang, E. Boscaro, and A. Torsello.> <Researchers Background:\nL. Bai's research background includes best paper awards such as the Caianello Prize, and participation in various international conferences on machine learning, image analysis and processing, and pattern recognition.\n\nL. Rossi has presented numerous papers at conferences including ICPR, ICML, ICWSM, COSN, SIN, ECML/PKDD, SSSPR, and GbR. She has also collaborated with researchers such as E. R. Hancock, M. Musolesi, A. Torsello, and L. Bai.\n\nE. R. Hancock's research background is not explicitly stated in the given text.\n\nM. Chorley has presented papers on pub crawling at scale, but no information about her research background or expertise can be extracted from the provided text.\n\nM. J. Williams' research background is not mentioned in the given text.\n\nP. Ren and Z. Zhang's research backgrounds are not explicitly stated in the given text.\n\nC. Wang's research background is not mentioned in the given text.\n\nA. Lima, S. Veluru, P. Longley, M. Rajarajan, and H. Bunke's research backgrounds are not mentioned in the given text.\n\nA. Gasparetto's research background is not explicitly stated in the given text. <Researcher's Background>\n• L. Rossi, A. Torsello and E. R. Hancock,Enhancing the Quantum Jensen-Shannon Divergence Kernel through Manifold Learning, 15th International Conference on Computer Analysis of Images and Patterns (CAIP 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,Attributed Graph Similarity from the Quantum Jensen-Shannon Divergence, 2nd International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2013).\n• L. Bai, E. R. Hancock, A. Torsello andL. Rossi,A Quantum Jensen-Shannon Graph Kernel Using the Continuous-Time Quantum Walk, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,A Continuous-Time Quantum Walk Kernel for Unattributed Graphs, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,Approximate Axial Symmetries from Continuous Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012).\n• L. Han,L. Rossi, A. Torsello, E. R. Hancock and R. C. Wilson,Information Theoretic Prototype Selection for Unattributed Graphs, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012).\n• L. Rossiand A. Torsello,An Adaptive Hierarchical Approach to the Extraction of High Resolution Medial Surfaces, in Second Joint 3DIM/3DPVT Conference: 3D Imaging, Modeling, Processing, Visualization & Transmission (3DIMPVT 2012).\n• A. Albarelli, F. Bergamasco,L. Rossi, S. Vascon and A. Torsello,A Stable Graph-Based Representation for Object Recognition through High-Order Matching, in 21st International Conference on Pattern Recognition (ICPR 2012).\n• A. Torsello andL. Rossi,Supervised Learning of Graph Structure, Proc. of the 1st International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2011). <Zhang is a PhD candidate at PolyU, \nHenry Senior is a PhD candidate at QMUL,\nYantao Liu is a BSc student at QMUL/BUPT.>\n \nH1: Background\n2023-2024: Deep Learning and Foundations of AI (PolyU, BSc).\n2020-2022: Software Engineering and Advanced Network Programming (QMUL + BUPT Joint Programme, BSc).\n2020: Software Engineering and Java Programming (QMUL + BUPT Joint Programme, BSc).\n2019-2020: Deep Learning and C/C++ (SUSTech, BSc).\n2015-2018: Mathematics for Computing Professionals (Aston, BSc).\n2015-2018: Software Architecture (Aston, MSc).\n2012-2013: TA for Machine Learning and Computer Vision (Ca' Foscari, MSc).\n2011: TA for Probability (Ca' Foscari, BSc).",
    "research interest": "<Research interests not found in provided text>",
    "publication": "H1: News & Upcoming Events • I will be chairing S+SSPR 2024in Venice (Italy) on 9-10 September 2024. \n• GraFix: A Graph Transformer with Fixed Attention based on the WL Kernelhas been accepted toICPR 2024.\n• Graph Kernel Neural Networkshas been accepted for publication on the journalIEEE Transactions on Neural Networks and Learning Systems.\n• Graph neural networks in vision-language image understanding: a surveyhas been accepted for publication on the journalThe Visual Computer.\n\nH1: Journals \n• L. Cosmo, G. Minello, M. Bronstein, E. Rodolà,L. Rossiand A. Torsello,Graph Kernel Neural Networks,IEEE Transactions on Neural Networks and Learning Systems, 2024.\n• H. Senior, G. Slabaugh, S. Yuan andL. Rossi,Graph neural networks in vision-language image understanding: a survey,The Visual Computer, 2024.\n• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,GNN-LoFI: A novel graph neural network through localized feature-based histogram intersection,Pattern Recognition, 2024. *   H1: Conferences\n    •   L. Rossi, A. Torsello, and M. Musolesi, Spatio-Temporal Techniques for User Identification by means of GPS Mobility Data, EPJ Data Science, 4(1), 1-16, 2015.\n    •   L. Rossi, A. Torsello, and E. R. Hancock, Unfolding Kernel Embeddings of Graphs: Enhancing Class Separation through Manifold Learning, Pattern Recognition, 2015.\n    •   L. Rossi, A. Torsello, and E. R. Hancock, Measuring Graph Similarity through Continuous-Time Quantum Walks and the Quantum Jensen-Shannon Divergence, Physical Review E, 2015.\n    •   L. Bai, L. Rossi, E. R. Hancock, and A. Torsello, A Quantum Jensen-Shannon Graph Kernel for Unattributed Graphs, Pattern Recognition, 2014\n    •   L. Rossi and A. Torsello, Coarse-to-Fine Skeleton Extraction for High Resolution 3D Meshes, Computer Vision and Image Understanding, 118:140-152, 2014\n    •   L. Rossi, A. Torsello, E. R. Hancock, and R. C. Wilson, Characterising Graph Symmetries through Quantum-Jensen Shannon Divergence, Physical Review E, 88(3):032806, 2013.\n    •   G. Minello, L. Zhang, A. Bicciato, L. Rossi, Andrea Torsello, and Luca Cosmo, LESI-GNN: an Interpretable Graph Neural Network based on Local Structures Embedding, S+SSPR, 2024\n    •   L. Zhang, L. Cosmo, G. Minello, A. Torsello, and L. Rossi, GraFix: A Graph Transformer with Fixed Attention based on the WL Kernel, ICPR, 2024\n    •   Y. Liu, L. Rossi, and A. Torsello, A novel graph kernel based on the Wasserstein distance and spectral signatures, S+SSPR, 2022\n    •   A. Bicciato, L. Cosmo, G. Minello, L. Rossi, and A. Torsello, Classifying Me Softly: a Novel Graph Neural Network Based on Features Soft-Alignment, S+SSPR, 2022 • Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2018) \n       • Published Time: Not found, Published at: Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2018)\n\n• A Preliminary Survey of Analyzing Dynamic Time-varying Financial Networks Using Graph Kernels. L. Cui, L. Bai,L. Rossi, Z. Zhang, Y. Jiao and E. R. Hancock\n       • Published Time: Not found, Published at: Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2018)\n\n• A Deep Hybrid Graph Kernel Through Deep Learning Networks. L. Bai, L. Cui,L. Rossi, Y. Wang and E. R. Hancock\n       • Published Time: Not found, Published at: 24th International Conference on Pattern Recognition (ICPR 2018)\n\n• Venice through the Lens of Instagram: A Visual Narrative of Tourism in Venice. L. Rossi, E. Boscaro and A. Torsello\n       • Published Time: Not found, Published at: 8th International Workshop on Location and the Web (LocWeb 2018)\n       • Duplicate publication: same content\n\n• Adaptive Feature Selection based on the Most Informative Graph-based Features. L. Bai, L. Cui,L. Rossi, E. R Hancock and Y. Jiao\n       • Published Time: Not found, Published at: 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017)\n\n• Nested Alignment Graph Kernel through the Dynamic Time Warping Framework. L. Bai,L. Rossi, L. Cui and E. R Hancock\n       • Published Time: Not found, Published at: 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017)\n\n• Measuring Vertex Centrality Using the Holevo Quantity. L. Rossiand A. Torsello\n       • Published Time: Not found, Published at: 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017)\n       • Duplicate publication: same content\n\n• Edge Centrality via the Holevo Quantity, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016). J. Lockhart, G. Minello,L. Rossi, S. Severini and A. Torsello\n       • Published Time: Not found, Published at: Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016)\n\n• The Average Mixing Matrix Signature, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016). L. Rossi, S. Severini and A. Torsello\n       • Published Time: Not found, Published at: Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016)\n\n• A Novel Entropy-based Graph Signature from the Average Mixing Matrix, In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016). L. Bai,L. Rossi, L. Cui and E. R. Hancock\n       • Published Time: Not found, Published at: In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016)\n\n• A Transitive Aligned Weisfeiler-Lehman Subtree Kernel, In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016). L. Bai,L. Rossi, L. Cui and E. R. Hancock\n       • Published Time: Not found, Published at: In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016)\n\n• Pub Crawling at Scale: Tapping Untappd to Explore Social Drinking, In Proceedings of the 10th AAAI International Conference on Weblogs and Social Media (ICWSM 2016). M. Chorley,L. Rossi, G. Tyson and M. Williams\n       • Published Time: Not found, Published at: In Proceedings of the 10th AAAI International Conference on Weblogs and Social Media (ICWSM 2016)\n\n• An Edge-based Matching Kernel through Discrete-time Quantum Walks, In Proceedings of the 18th International Conference on Image Analysis and <title>Processing</title>\n<published_time>2015</p>\n\n<content>\n<Conference>ICMAP 2015</Conference>\n \nBest Paper Award (Caianello Prize)\n \n• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015).\n \n• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015).\n\n• L. Rossi, M. J. Williams, C. Stich and M. Musolesi,Privacy and the City: User Identification and Location Semantics in Location-Based Social Networks, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n \n• L. Rossi, M. Musolesi and A. TorselloOn the k-Anonymization of Time-varying and Multi-layer Social Graphs, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n\n• L. Bai,L. Rossi, P. Ren, Z. Zhang and E. R. Hancock,A Quantum Jensen-Shannon Graph Kernel using Discrete-time Quantum Walks, 10th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2015).\n \n• L. Rossioland M. Musolesi,It's the Way you Check-in: Identifying Users in Location-Based Social Networks, In Proceedings of the ACM Conference on Online Social Networks (COSN 2014).\n\n• M. Adnan, A. Lima,L. Rossi, S. Veluru, P. Longley, M. Musolesi and M. Rajarajan,Using Digital Traces for User Profiling: the Uncertainty of Identity Toolset, In Proceedings of the The 7th International Conference on Security of Information and Networks (SIN 2014).\n\nBest Human Factors and Biometrics Paper \n\n• L. Bai,L. Rossi, H. Bunke and E. R. Hancock,Attributed Graph Kernels Using the Jensen-Tsallis q-Differences, In Proceedings of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML/PKDD 2014).\n\n• L. Rossiol. Rossi, A. Torsello and E. R. Hancock,Node Centrality for Continuous-Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2014).\n \n• A. Torsello, A. Gasparetto,L. Rossiol. Rossi, L. Bai and E. R. Hancock,Transitive State Alignment for the Quantum Jensen-Shannon Kernel, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2014).\n \n• A. Lima,L. Rossiol. Musolesi,Coding Together at Scale: GitHub as a Collaborative Social Network, In Proceedings of the 8th AAAI International Conference on Weblogs and Social Media (ICWSM 2014).\n\n• L. Rossi, A. Torsello and E. R. Hancock,Enhancing the Quantum Jensen-Shannon Divergence Kernel through Manifold Learning, 15th International Conference on Computer Analysis of Images and Patterns (CAIP 2013).\n \n• L. Rossiol. Rossi, A. Torsello and E. R. Hancock,Attributed Graph Similarity from the Quantum Jensen-Shannon Divergence, 2nd International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2013).\n</content> <title>A Quantum Jensen-Shannon Graph Kernel Using the Continuous-Time Quantum Walk, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013)</title>\n<p>Published Time: 2013</p>\n< Conference>9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013)</Conference>\n\n<title>A Continuous-Time Quantum Walk Kernel for Unattributed Graphs, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013)</title>\n<p>Published Time: 2013</p>\n< Conference>9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013)</Conference>\n\n<title>Approximate Axial Symmetries from Continuous Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012)</title>\n<p>Published Time: 2012</p>\n< Conference>Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012)</Conference>\n\n<title>Information Theoretic Prototype Selection for Unattributed Graphs, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012)</title>\n<p>Published Time: 2012</p>\n< Conference>Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012)</Conference>\n\n<title>An Adaptive Hierarchical Approach to the Extraction of High Resolution Medial Surfaces, in Second Joint 3DIM/3DPVT Conference: 3D Imaging, Modeling, Processing, Visualization & Transmission (3DIMPVT 2012)</title>\n<p>Published Time: 2012</p>\n< Conference>Second Joint 3DIM/3DPVT Conference: 3D Imaging, Modeling, Processing, Visualization & Transmission (3DIMPVT 2012)</Conference>\n\n<title>A Stable Graph-Based Representation for Object Recognition through High-Order Matching, in 21st International Conference on Pattern Recognition (ICPR 2012)</title>\n<p>Published Time: 2012</p>\n< Conference>21st International Conference on Pattern Recognition (ICPR 2012)</Conference>\n\n<title>Supervised Learning of Graph Structure, Proc. of the 1st International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2011)</title>\n<p>Published Time: 2011</p>\n< Conference>Proc. of the 1st International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2011)</Conference>\n\n<title>Graph Generation via Spectral Diffusion, arXiv:2402.18974, 2024</title>\n<p>Published Time: 2024</p>\n< Conference>arXiv:2402.18974</Conference>\n\n<title>Afficient Computation of Decoherent Quantum Walks through Eigenvalue Perturbation, arXiv:1601.04691, 2016</title>\n<p>Published Time: 2016</p>\n< Conference>arXiv:1601.04691</Conference>\n\n<title>Progmosis: Evaluating Risky Individual Behavior During Epidemics Using Mobile Network Data, Submission to D4D Senegal (NetMob 2015)</title>\n<p>Published Time: 2015</p>\n< Conference>Submission to D4D Senegal (NetMob 2015)</Conference>\n\n<title>Improving Search Engines Using Machine Learning (KTP), £218,245, 2018-2020</title>\n<p>Published Time: 2018-2020</p>\n< Conference>KTP</Conference>\n\n<title>Using Data Analytics to Predict Debtor Payment Behaviours (KTP), £122,613, 2017-2019</title>\n<p>Published Time: 2017-2019</p>\n< Conference>KTP</Conference>\n\n<student>Sanzhar Abdrakhim(URIS student, PolyU)</student>\n<student>Peiming Chen(PhD candidate, PolyU)</student>\n<student>Cheyu Liu(PhD candidate, PolyU)</student>\n<student>Lingfeng Zhang(PhD candidate, PolyU)</student>\n<student>Henry Senior(PhD candidate, QMUL)</student>\n<student Yantao Liu(BSc student, QMUL/BUPT)></student> <Title: IAPRTC 2(Structural and Syntactical Pattern Recognition)</Title>\n\n<p>Published time: Not available</p>\n\n<p>Conference of researcher's publication: Not available</p>\n\n<p>Contact: luca_rossi_at_polyu_edu_hk</p>",
    "recruitment": "• Research assistant, PhD, and postdoctoral opportunities at PolyU \n• Deadline for applications is the 1st of December 2024 \n\n• I will be chairingS+SSPR 2024in Venice (Italy) on 9-10 September 2024.\n• GraFix: A Graph Transformer with Fixed Attention based on the WL Kernelhas been accepted toICPR 2024.\n• Graph Kernel Neural Networkshas been accepted for publication on the journalIEEE Transactions on Neural Networks and Learning Systems.\n• Graph neural networks in vision-language image understanding: a surveyhas been accepted for publication on the journalThe Visual Computer.\n\n• L. Cosmo, G. Minello, M. Bronstein, E. Rodolà,L. Rossiand A. Torsello,Graph Kernel Neural Networks,IEEE Transactions on Neural Networks and Learning Systems, 2024.\n• H. Senior, G. Slabaugh, S. Yuan andL. Rossi,Graph neural networks in vision-language image understanding: a survey,The Visual Computer, 2024.\n• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,GNN-LoFI: A novel graph neural network through localized feature-based histogram intersection,Pattern Recognition, 2024.\n• X. Xu, J. Gevers andL. Rossi,Can I write this is ableist AF in a peer review?: A corpus-driven analysis of Twitter engagement strategies across disciplinary groups,Ibérica, 2023.\n• L. Cosmo, G. Minello, M. Bronstein, Emanuele Rodolà,L. Rossiand A. Torsello,3D Shape Analysis through a Quantum Lens: the Average Mixing Kernel Signature,International Journal of Computer Vision, 2022.\n• L. Bai, Y. Jiao, L. Cui,L. Rossi, Y. Wang, P. S. Yu and E. R. Hancock,Learning Graph Convolutional Networks based on Quantum Vertex Information Propagation,IEEE Transactions on Knowledge and Data Engineering, 2021.\n• G. Minello,L. Rossiand A. Torsello,k-Anonymity on Graphs using the Szemerédi Regularity Lemma,IEEE Transactions on Network Science and Engineering, 2020.\n• L. Bai, L. Cui, Y. Jiao,L. Rossiand E. R. Hancock,Learning Backtrackless Aligned-Spatial Graph Convolutional Networks for Graph Classifications,IEEE Transactions on Pattern Analysis and Machine Intelligence, 2020.\n• L. Bai,L. Rossi, L. Cui, J. Cheng and E. R. Hancock,A quantum-inspired similarity measure for the analysis of complete weighted graphs,IEEE Transactions on Cybernetics, 2020.\n• G. Minello,L. Rossiand A. Torsello,Can a Quantum Walk Tell Which Is Which? A Study of Quantum Walk-Based Graph Similarity,Entropy, 2019.\n• G. Minello,L. Rossiand A. Torsello,Can a Quantum Walk Tell Which Is Which? A Study of Quantum * No relevant information about researcher's recruitment information.\n* Salary: No information found.\n* Lab condition: \n    • L. Rossi, A. Torsello, and E. R. Hancock,Unfolding Kernel Embeddings of Graphs: Enhancing Class Separation through Manifold Learning,Pattern Recognition, 2015, \"The lab conditions are not explicitly mentioned in this paper.\"\n    • L. Bai, L. Cui, L. Rossi, B. Xiao and E. R. Hancock,Local-Global Nested Graph Kernels Using Nested Complexity Traces,Pattern Recognition Letters, 2018, No information on lab condition is found.\n    • L. Bai, L. Cui, L. Rossi, Z. Zhang, P. Ren and E. R. Hancock,Quantum Kernels for Unattributed Graphs using Discrete-time Quantum Walks,Pattern Recognition Letters, 2017, \"The lab conditions are not explicitly mentioned in this paper.\"\n    • L. Rossi, J. Walker and M. Musolesi,Spatio-Temporal Techniques for User Identification by means of GPS Mobility Data,EPJ Data Science, 4(1), 1-16, 2015, No information on lab condition is found.\n    • G. Minello, L. Zhang, A. Bicciato,L. Rossi, Andrea Torsello, and Luca Cosmo,LESI-GNN: an Interpretable Graph Neural Network based on Local Structures Embedding,S+SSPR, 2024, No information on lab condition is found.\n    • L. Zhang, L. Cosmo, G. Minello, A. Torsello, andL. Rossi,GraFix: A Graph Transformer with Fixed Attention based on the WL Kernel,ICPR, 2024, No information on lab condition is found. <No relevant information found about researcher's recruitment information, salary, or lab conditions.> • L. Bai,L. Rossi, Z. Zhang,L. Cui and E. R. Hancock,A Transitive Aligned Weisfeiler-Lehman Subtree Kernel, In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Bai, P. Ren, Z. Zhang,L. Rossiand E. R. Hancock,An Edge-based Matching Kernel through Discrete-time Quantum Walks, In Proceedings of the 18th International Conference on Image Analysis and Processing (ICIAP 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Rossi, M. J. Williams, C. Stich and M. Musolesi,Privacy and the City: User Identification and Location Semantics in Location-Based Social Networks, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Rossi, M. Musolesi and A. TorselloOn the k-Anonymization of Time-varying and Multi-layer Social Graphs, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Bai,L. Rossi, P. Ren, Z. Zhang and E. R. Hancock,A Quantum Jensen-Shannon Graph Kernel using Discrete-time Quantum Walks, 10th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2015).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Rossiand M. Musolesi,It's the Way you Check-in: Identifying Users in Location-Based Social Networks, In Proceedings of the ACM Conference on Online Social Networks (COSN 2014).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• M. Adnan, A. Lima,L. Rossi, S. Veluru, P. Longley, M. Musolesi and M. Rajarajan,Using Digital Traces for User Profiling: the Uncertainty of Identity Toolset, In Proceedings of the The 7th International Conference on Security of Information and Networks (SIN 2014).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Bai,L. Rossi, H. Bunke and E. R. Hancock,Attributed Graph Kernels Using the Jensen-Tsallis q-Differences, In Proceedings of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML/PKDD 2014).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• L. Rossi, A. Torsello and E. R. Hancock,Node Centrality for Continuous-Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2014).\n No information about researcher's recruitment information, salary or lab condition found.\n\n• A. Torsello, A. Gasparetto,L. Rossi, L. Bai and E. R. Hancock,Transitive State Alignment for the Quantum Jensen-Shannon Kernel, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR\n No information about researcher's recruitment information, salary or lab condition found. • Researcher's Recruitment Information:\n  • Sanzhar Abdrakhim (URIS student)\n  • Peiming Chen (PhD candidate, PolyU)\n  • Chenyu Liu (PhD candidate, PolyU)\n\n• Salary: \n  None\n\n• Lab Condition: \n  • The content does not provide information about the lab condition. <Researcher's Recruitment Information:\n    - July 2019: Ca' Foscari University of Venice - Department of Environmental Sciences, Informatics and Statistics.\n    - June-July 2015: University College London - Department of Geography.\n    - March-September 2012: University of York- Department of Computer Science -CVPRresearch group.>\n\n<Salary Information:\n    - No information available in the input text.>\n\n<Lab Condition Information:\n    - Ca' Foscari University of Venice - Department of Environmental Sciences, Informatics and Statistics.\n    - University College London - Department of Geography.\n    - University of York- Department of Computer Science -CVPRresearch group.>"
}