{
    "name": "Wanyu",
    "personal background": "• Wanyu is an Assistant Professor in the Department of Computing at The Hong Kong Polytechnic University.\n• She received her Ph.D. degree from the Department of Electrical and Computer Engineering at the University of Toronto.\n• Her M. Phil degree was completed from the Department of Computing in Hong Kong Polytechnic University, under the supervision of Professor .\n• Wanyu obtained her B.Engr. degree from the school of Electronic Information and • Wanyu Lin has completed her first half-marathon in Standard Chartered Hong Kong Marathon, 2014, and her first full marathon in Toronto ScotialBank Marathon, 2017.",
    "research interest": "<AI for science. We focus on developing machine learning (ML) techniques (GNNs, diffusion, etc.) to accelerate scientific simulations and design (applications in materials, structure safety); Creating AI with safe and ethical objectives. Specifically, we focus on interpretability, robustness, and privacy-preservation of machine learning models, such as large language models.>",
    "publication": "<title>Publications</title>\n<p>Publishments:</p>\n \n • Zhenzhong Wang, Lulu Cao,Wanyu Lin*, Min Jiang, and Kaychen Tan.”Robust Graph Meta Learning via Manifold Calibration with Proxy Subgraphs, ”in the Proceedings of the 2023 Conference on Association for the Advancement of Artificial Intelligence (AAAI), Washington DC, USA, February 7-14, 2023.[code]\n\n• Wanyu Lin, Baochun Li, and Cong Wang.”Towards Private Learning on Decentralized Graphs with Local Differential Privacy, ”in IEEE Transactions on Information Forensics & Security (TIFS), 2022.[code]\n \n• Wanyu Lin, Hao Lan, Hao Wang, and Baochun Li.”Orphicx: A Causality-Inspired Latent Variable Model for Interpreting Graph Neural Networks, ”in the Proceedings of the 2022 IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2022), Oral Presentation, New Orleans, Louisiana, June 19-24, 2022 (Best paper finalist 33/8161=0.4%).[code]\n\n• Wanyu Lin, and Baochun Li.”Status-Aware Signed Heterogeneous Network Embedding with Graph Neural Networks, ”in IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2022;\n \n• Wanyu Lin, Hao Lan, and Baochun Li.”Generative Causal Explanations for Graph Neural Networks, ”in the Proceedings of the 38th International Conference on Machine Learning (ICML 2021), Online, July 18-24, 2021.[presentation slides][code]\n\n• Wanyu Lin, and Baochun Li.”Medley: Predicting Social Trust in Time-Varying Online Social Networks, ”in the Proceedings of IEEE INFOCOM 2021, Virtual Conference, May 10-13, 2021.[presentation slides]\n \n• Wanyu Lin, Helei Cui, Baochun Li, and Cong Wang.”Privacy-Preserving Similarity Search with Efficient Updates in Distributed Key-Value Stores, ”in IEEE Transactions on Parallel and Distributed Systems, vol. 32, no. 5, pp. 1072-1084, May 2021;\n \n• Wanyu Lin, Zhaolin Gao, and Baochun Li.”Guardian: Evaluating Trust in Online Social Networks with Graph Convolutional Networks, ”in the Proceedings of IEEE INFOCOM, Toronto, Canada, July 6-9, 2020.[presentation slides][code]\n \n• Wanyu Lin, Zhaolin Gao, and Baochun Li.”Shoestring: Graph-Based Semi-Supervised Classification with Severely Limited Labeled Data, ”in the Proceedings of the 2020 IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2020), Seattle, Washington, June 16-18, 2020.[presentation slides][code]\n \n• Wanyu Lin, Shengxiang Ji, and Baochun Li.”Adversarial Attacks on Link Prediction Algorithms Based on Graph Neural Networks, ”in the Proceedings of the 15th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2020), Taipei, Taiwan, October 5-9, 2020.",
    "recruitment": "*   Research Team:\n        • Jian Chen (Post-Doctoral Fellow, Previously Ph.D. at HUST)\n        • Zhenzhong Wang (Ph.D. Candidate, Previously Master Student at Xiamen University)\n        • Mingxuan Ouyang (Ph.D. Candidate, Previously Master Student at HK PolyU)\n        • Haowei Hua (Ph.D. Candidate, Previously Master Student at University of Electronic Science and Technology of China (UESTC))\n        • Jiangwen Dong (Ph.D. Candidate, Previously Undergraduate Student at Zhejiang University)\n        • Zhuoran Li (Ph.D. Candidate, Previously Master Student at HK PolyU and Undergraduate at University of Washington-Seattle)\n        • Zehui Lin (Research Assistant, Previously Undergraduate Student at University of Sydney)\n        • Minfeng Wu (Research Assistant, Previously Undergraduate Student at Xiamen University)\n        • Xu Sun (Research Assistant, Undergraduate Student at HK PolyU)\n*   Research Team Recruitment Information: We are looking for motivated Post-Doctoral Fellows and Ph.D. Students who are interested and experienced in AI for Science and trustworthy AI.\n*   Salary: Not specified\n*   Lab Condition: The research team focuses on developing machine learning (ML) techniques to accelerate scientific simulations and design applications in materials, structure safety. No relevant information about researcher's recruitment information, salary, or lab condition could be found."
}