{
    "name": "Wenqi",
    "personal background": "<Dr. Wenqi Fan received his Ph.D. degree in computer science from the City University of Hong Kong (2017-2020), under the supervision of . From 2018 to 2021, he was a research scholar of at Michigan State University (MSU), under the supervision of .\n\nHe is recognized as the AI 2000 Most Influential Scholar Honorable Mention ( , , ) , and one of the World’s Top 2% Scientists by Stanford University (2023, 2024).>\n\n<He has published his research in highly ranked journals and top conference proceedings [ ].></span> • Gratefully receive a grant (Intra-Faculty Interdisciplinary Project) as the PC/Co-PI to support our research.\n• Our tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” is accepted byICDM 2023. Congratulations to Jiatong, Zihuai, and Yunqing.\n• Gratefully receive a grant (RGC-GRF) as the Co-I to support our research.\n• Our workshop on “Large Language Models (LLMs) for Graph Learning” is accepted by The Web Conference 2024 (WWW 2024).\n• Our new preprint “Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models:\n        Certified Robustness for Large Language Models with Self-Denoising” is online.\n• One paper (“Revisiting Link Prediction: A data perspective”) got accepted byICLR 2024.\n• Two papers (“Linear-Time Graph Neural Networks for Scalable Recommendations” and “Fast Graph Condensation with Structure-based Neural Tangent Kernel”) got accepted byACM TheWeb Conference (WWW) 2024. <No relevant content about researcher's background could be found in the input.> - Our background is from a strong academic foundation and extensive research experience.\n \n- We have been serving as PC members for various top-tier conferences, including KDD, IJCAI, NeurIPS, WWW, ICML, ICLR, WSDM, and others.\n\n- We are actively involved in organizing tutorials at prominent conferences, such as Web Conference (WWW) and International Joint Conference on Artificial Intelligence (IJAI).\n \n- Our work has been recognized with awards, including the SDM2020Student Travel Award.\n\n- We have published papers in top-tier venues, such as NeurIPS/CIKM, KDD, WWW, IJCAI, and ICML.\n \n- We have also had our preprints accepted by other prominent conferences and journals. None <Researchers' background not found> * Wenqi Fan is a researcher.\n* He has collaborated with many other researchers on various projects.\n* Some of his notable works include \"Fairly Adaptive Negative Sampling for Recommendations\", \"Jointly Attacking Graph Neural Network and its Explanations\", and \"A Comprehensive Survey on Automated Machine Learning for Recommendations\".\n* His research interests are in the areas of recommender systems, graph neural networks, and fairness.\n* He has published papers in various conferences and journals, including IJCAI 2023, WWW 2023, ICDE 2023, NeurIPS 2022, CIKM 2022, KDD 2022, SIGIR 2022, and AAAI 2022. <Researcher Background:\nWenqi Fan is a researcher with multiple publications in various conferences and journals related to data mining, social recommendation, and graph neural networks. \nHaochen Liu is a researcher who co-authored papers with Wenqi Fan on topics like automated embedding dimensionality search, attacking black-box recommendations, and fairness in dialogue systems.\nTyler Derr is a researcher who collaborated with Wenqi Fan on projects such as epidemic graph convolutional network and deep adversarial social recommendation.\nYao Ma is a researcher who co-authored papers with Wenqi Fan on topics like automating loss function search, social collaborative filtering, and graph neural networks for social recommendation.\nJiliang Tang is a researcher and professor who has collaborated with Wenqi Fan on various projects including global-and-local aware data generation, epidemic graph convolutional network, and deep adversarial social recommendation.\nHui Liu and Zitao Liu are researchers who co-authored papers with Haochen Liu and Jiliang Tang on topics like fairness in dialogue systems and attacking black-box recommendations.>",
    "research interest": "• Recommender Systems (RecSys)andManagement Information Systems (MIS)\n• Large Language Models (LLMs)\n• Trustworthy AI: Adversarial Attacks & Robustness; Fairness; Explainability, etc.\n• Graph Machine Learning: Graph Neural Networks; Graph Foundation Models \n• AI/ML/DM + X: Business; Science • Two students received PolyU Presidential PhD Fellowship Scheme (PPPFS) to support their PhD study.\n• Our workshop on “Large Language Models (LLMs) for Graph Learning” is accepted by The Web Conference 2024 (WWW 2024).\n• Our tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” is accepted byICDM 2023.\n• Congratulations to Jiatong, Zihuai, and Yunqing.\n• Our new preprint “Certified Robustness for Large Language Models with Self-Denoising” is online.\n• Our new preprint “Exploring the Potential of Large Language Models (LLMs) in Learning on Graphs” is online.\n• Our new preprint “Recommender Systems in the Era of Large Language Models (LLMs)” is online.\n• Gratefully receive a grant (RGC-GRF) as the Co-I to support our research.\n• Our new preprint “Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models: A ChatGPT Perspective” is online.\n• Congratulations to Chengyi, Yunqing, and Jiatong for their first paper with PolyU.\n• Our paper (“Adversarial Attacks for Black-box Recommender Systems via Copying Transferable Cross-domain User Profiles”) got accepted byIEEE TKDE 2023.\n• One paper got accepted bySIGIR 2023.\n• Our new preprint “Generative Diffusion Models on Graphs: Methods and Applications” is online.\n• Our tutorial on “Trustworthy Recommender Systems: Foundations and Frontiers” is accepted byKDD 2023[Website].\n• Our tutorial on “Trustworthy Recommender Systems: Foundations and Frontiers” is accepted byIJCAI 2023[Website].\n• Our survey paper (“Generative Diffusion Models on Graphs: Methods and Applications”) got accepted byIJCAI 2023.\n• One paper (Jointly Attacking Graph Neural Network and its Explanations) got accepted byICDE’2023.\n• Our tutorial on “AutoML for Deep Recommender Systems: Fundamentals and Advances” is accepted for the WSDM Conference (WSDM’2023) [Website].\n• Our new preprint “A Comprehensive Survey on Trustworthy Recommender Systems” is online.\n• One paper (Fairness Reprogramming) got accepted byNeurIPS’2022.\n• One paper (Identifying The Kind Behind SMILES - Anatomical Therapeutic Chemical Classification using Structure-Only Representations) got accepted byBIB’2022(Impact Factor: 13.994).\n• One paper (Disentangled Contrastive Learning for Social Recommendation) got accepted byCIKM’2022.\n• Invited to serve as the (Senior) PC Member ofAAAI’2023andICLR’2023.\n• Our survey paper <Safety & Robustness, Non-discrimination & Fairness, Explainability, Privacy, Accountability & Auditability, and Environmental Well-Being>",
    "publication": "<Title>WISE Conference 2024</Title>\n<Published Time>30 July, 2024</Published Time>\n<Conference of Researcher's Publication>International Web Information Systems Engineering conference (also known as the WISE conference), 2024.</Conference of Researcher's Publication>\n\n<H2>News</H2>\n2024• 09/2024: One paper (Multi-agent Attacks for Black-box Social Recommendations) got accepted byACM TOIS 2024. Congratulations to Shijie.\n2024• 09/2024: Our new preprint “SSD4Rec: A Structured State Space Duality Model for Efficient Sequential Recommendation” is online.\n2024• 08/2024: Check out our survey onA Survey of Mamba.\n2024• 06/2024: Gratefully receive a grant (RGC-GRF) as the PI to support our research on Large Language Models and Recommender Systems. Multiple PhD/Postdoc/RA positions are available (Year-round Recruitment). [Please click here for position details.]\n2024• 06/2024: Our new preprint “TokenRec: Learning to Tokenize ID for LLM-based Generative Recommendation” is online.\n2024• 05/2024: Our survey paper&tutorial (A Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models) got accepted byKDD 2024. Congratulations to Yujuan, Liangbo and Shijie.\n2024• 05/2024: One paper got accepted byKDD 2024. Congratulations to Liangbo and Shijie.\n2024• 05/2024: Gratefully receive a grant (Intra-Faculty Interdisciplinary Project) as the PC/Co-PI to support our research.\n2024• 05/2024: Check out our survey onA Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models.\n2024• 04/2024: Check out our survey onGraph Machine Learning in the Era of Large Language Models (LLMs).\n2024• 04/2024: Our survey paper (“Recommender Systems in the Era of Large Language Models (LLMs)”) got accepted byIEEE TKDE 2024.\n2024• 04/2024: Our tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” is accepted byIJCAI 2024. Congratulations to Yujuan, Shijie, and Liangbo.\n2024• 03/2024: I was recognized as the “2024 AI 2000 Most Influential Scholar Honorable Mention” in the field of IR and Recommendation by the AMiner.\n2024• 03/2024: One demo paper (“FashionReGen: LLM-Empowered Fashion Report Generation”) and one short paper (“Interpretation-Empowered Neural Cleanse for Backdoor Attacks”) got accepted byACM TheWeb Conference (WWW) 2024. Congratulations to Yujuan and Liangbo.\n2024• 01/2024: Two papers (“Linear-Time Graph Neural Networks for Scalable Recommendations” and “Fast Graph Condensation with Structure-based Neural Tangent Kernel”) got accepted byACM TheWeb Conference (WWW) 2024. Congratulations to Jiahao ZHANG, Lin WANG, and Jiatong LI.\n2024• 01/2024: One paper (“Revisiting Link Prediction: A data perspective”) got accepted byICLR 2024.\n\n<H2>Conference Dates</H2>\nConference Dates: 2-5 December 2024. Title: \n- PPPFS to support PhD study. \n\nPublished Time:\n- 11/2023: Workshop on “Large Language Models (LLMs) for Graph Learning” accepted by The Web Conference 2024 (WWW 2024)\n- 09/2023: Tutorial on “Recommender Systems in the Era of Large Language Models (LLMs)” accepted by ICDM 2023\n- 07/2023: Three new preprints “Certified Robustness for Large Language Models with Self-Denoising”, “Exploring the Potential of Large Language Models (LLMs) in Learning on Graphs”, and “Recommender Systems in the Era of Large Language Models (LLMs)” online\n- 06/2023: Grateful for RGC-GRF grant as Co-I to support research\n- 05/2023: Tutorial on “Trustworthy Recommender Systems: Foundations and Frontiers” accepted by KDD 2023[Website]\n- 04/2023: Three new preprints “Generative Diffusion Models on Graphs: Methods and Applications”, “Adversarial Attacks for Black-box Recommender Systems via Copying Transferable Cross-domain User Profiles”, and one paper accepted by SIGIR 2023\n- 02/2023: Two new preprints “Generative Diffusion Models on Graphs: Methods and Applications” and “Fairly Adaptive Negative Sampling for Recommendations” online\n- 01/2023: Paper accepted by The Web Conference (WWW’2023)\n- 12/2022: Tutorial on “Trustworthy Recommender Systems” accepted for the Web Conference (WWW’2023) [Website]\n- 11/2022: Paper accepted by ICDM'2023\n- 09/2022: New preprint “A Comprehensive Survey on Trustworthy Recommender Systems” online\n- 08/2022: Three papers accepted Title: Recent Publications and Awards\nPublished Time:\n- CIKM’2022: Social Recommendation got accepted\n- KDD’2022: Knowledge-enhanced Black-box Attacks for Recommendations got accepted\n- ACM TIST: Trustworthy AI: A Computational Perspective (survey paper)\n- SIGIR’2022: Graph Trend Filtering Networks for Recommendation\n- AAAI’2023 and ICLR’2023: Invited as Senior PC Member\n- Web Conference (WWW’22): Tutorial on “Trustworthy AI: A Computational Perspective” and “Automated Machine Learning for Recommendations: Fundamentals and Advances”\n- AAAI’22: One paper got accepted\n- KDD’22: Invited as Senior PC Member\n- ICDM’2021: One paper got accepted\n- ICAPS 2021: Tutorial on “Trustworthy AI: A Computational Perspective” <font size=\"4\">\n\nTitle: Wenqi Fan - Publications\n\n1. SSD4Rec: A Structured State Space Duality Model for Efficient Sequential Recommendation\nAuthor: Haohao Qu, Yifeng Zhang, Liangbo Ning, Wenqi Fan, Qing Li\nPublished Time: 2024-09-11 \nConference: arXiv:2409.01192 [ArXiv]\n\n2. Joint Universal Adversarial Perturbations with Interpretations\nAuthor: Haohao Qu, Yifeng Zhang, Liangbo Ning, Wenqi Fan, Qing Li\nPublished Time: 2024-08-17 \nConference: arXiv:2408.01715 [ArXiv]\n\n3. A Survey of Mamba\nAuthor: Haohao Qu, Liangbo Ning, Rui An, Wenqi Fan, Tyler Derr, Xin Xu, Qing Li\nPublished Time: 2024-08-11 \nConference: arXiv:2408.01129 [ArXiv]\n\n4. TokenRec: Learning to Tokenize ID for LLM-based Generative Recommendation\nAuthor: Haohao Qu, Wenqi Fan, Zihuai Zhao, Qing Li\nPublished Time: 2024-06-04 \nConference: arXiv:2406.10450 [ArXiv]\n\n5. Graph Machine Learning in the Era of Large Language Models (LLMs)\nAuthor: Wenqi Fan, Shijie Wang, Jiani Huang, Zhikai Chen, Yu Song, Wenzhuo Tang, Haitao Mao, Hui Liu, Xiaorui Liu, Dawei Yin, Qing Li\nPublished Time: 2024-04-14 \nConference: arXiv:2404.14928 [ArXiv]\n\n6. Rethinking Large Language Model Architectures for Sequential Recommendations\nAuthor: Hanbing Wang, Xiaorui Liu, Wenqi Fan, Xiangyu Zhao, Venkataramana Kini, Devendra Yadav, Fei Wang, Zhen Wen, Jiliang Tang, Hui Liu\nPublished Time: 2024-02-09 \nConference: arXiv:2402.09543 [ArXiv]\n\n7. A General Single-Cell Analysis Framework via Conditional Diffusion Generative Model\nAuthor: Wenzhuo Tang, Renming Liu, Hongzhi Wen, Xinnan Dai, Jiayuan Ding, Hang Li, Wenqi Fan, Yuying Xie, Jiliang Tang\nPublished Time: 2023-01-11 \nConference: bioRxiv:20230101122B\n\n8. FT-Shield: A Watermark Against Unauthorized Fine-tuning in Text-to-Image\nAuthor: Yingqian Cui, Jie Ren, Yuping Lin, Han Xu, Pengfei He, Yue Xing, Wenqi Fan, Hui Liu, Jiliang Tang\nPublished Time: 2023-01-11 \nConference: bioRxiv:20230101122B\n\n</font> title: Leveraging Large Language Models (LLMs) to Empower Training-Free Dataset Condensation for Content-Based Recommendation\npublished time: 2023. [ArXiv] • Jiahao Wu, Qijiong Liu, Hengchang Hu,Wenqi Fan, Shengcai Liu, Qing Li, Xiao-Ming Wu, Ke Tang\n\ncontent: Leveraging Large Language Models (LLMs) to Empower Training-Free Dataset Condensation for Content-Based Recommendation\n\ntitle: A Comprehensive Survey on Trustworthy Recommender Systems\npublished time: 2022. [ArXiv] [PDF]• Yuxuan Wan, Han Xu, Xiaorui Liu, Jie Ren,Wenqi Fan, and Jiliang Tang\n\ncontent: A Comprehensive Survey on Trustworthy Recommender Systems\n\ntitle: Defense Against Gradient Leakage Attacks via Learning to Obscure Data\npublished time: 2022. [ArXiv] \n\ncontent: Defense Against Gradient Leakage Attacks via Learning to Obscure Data\n\ntitle: Multi-agent Attacks for Black-box Social Recommendations\npublished time: 2024. [ArXiv] • Shijie Wang,Wenqi Fan, Xiao-yong Wei, Xiaowei Mei, Shanru Lin, Qing Li\n\ncontent: Multi-agent Attacks for Black-box Social Recommendations\n\ntitle: A Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models\npublished time: 2024. [ArXiv] • Yujuan Ding,Wenqi Fan, Liangbo Ning, Shijie Wang, Hengyun Li, Dawei Yin, Tat-Seng Chua, and Qing Li\n\ncontent: A Survey on RAG Meets LLMs: Towards Retrieval-Augmented Large Language Models\n\ntitle: Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models: A ChatGPT Perspective\npublished time: 2024. [ArXiv] • Jiatong Li, Yunqing Liu,Wenqi Fan, Xiao-Yong Wei, Hui Liu, Jiliang Tang, and Qing Li\n\ncontent: Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models: A ChatGPT Perspective\n\ntitle: A Comprehensive Survey on Graph Reduction: Sparsification, Coarsening, and Condensation\npublished time: 2024. [ArXiv] • Mohammad Hashemi, Shengbo Gong, Juntong Ni,Wenqi Fan, B. Aditya Prakash, Wei Jin\n\ncontent: A Comprehensive Survey on Graph Reduction: Sparsification, Coarsening, and Condensation\n\ntitle: Recommender Systems in the Era of Large Language Models (LLMs)\npublished time: 2024. [ArXiv] • Zihuai Zhao,Wenqi Fan, Jiatong Li, Yunqing Liu, Xiaowei Mei, Yiqi Wang, Jiliang Tang, and Qing Li\n\ncontent: Recommender Systems in the Era of Large Language Models (LLMs)\n\ntitle: FashionReGen: LLM-Empowered Fashion Report Generation\npublished time: 2024. [ArXiv] • Yujuan Ding, Yunshan Ma,Wenqi Fan, Yige Yao, Tat-Seng Chua, Qing Li\n\ncontent: FashionReGen: LLM-Empowered Fashion Report Generation\n\ntitle: Interpretation-Empowered Neural Cleanse for Backdoor Attacks\npublished time: 2024. [ArXiv] • Liang-bo Ning, Zeyu Dai, Jingran Su, Chao Pan, Luning Wang,Wenqi Fan, Qing Li\n\ncontent: Interpretation-Empowered Neural Cleanse for Backdoor Attacks\n\ntitle: Fast Graph Condensation with Structure-based Neural Tangent Kernel\npublished time: 2024. [ArXiv] • Lin Wang,Wenqi Fan, Jiatong Li, Yao Ma, Qing Li\n\ncontent: Fast Graph Condensation with Structure-based Neural Tangent Kernel\n\ntitle: Linear-Time Graph Neural Networks for Scalable Recommendations\npublished time: 2024. [ArXiv] • Jiahao Zhang, Rui Xue,Wenqi Fan, Xin Xu, Qing Li, Jian Pei, Xiaorui Liu\n\ncontent: Linear-Time Graph Neural Networks for Scalable Recommendations • \nLiuLinear-Time Graph Neural Networks for Scalable RecommendationsIn The Web Conference (WWW 2024), 2024.\n• \nExploring the Potential of Large Language Models (LLMs) in Learning on GraphsIn ACM SIGKDD Explorations Newsletter, 2024. [ArXiv] [PDF]\n• \nRevisiting Link Prediction: A Data PerspectiveIn International Conference on Learning Representations (ICLR 2024), 2024.[ArXiv]\n• \nAdversarial Attacks for Black-box Recommender Systems via Copying Transferable Cross-domain User ProfilesIn IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE 2023), 2023.[PDF]• \nGenerative Diffusion Models on Graphs: Methods and ApplicationsIn International Joint Conference on Artificial Intelligence (IJCAI 2023). arXiv: 2302.02591, 2023.[ArXiv] [PDF] [中文Chinese] [GitHub]\n• \nFairly Adaptive Negative Sampling for RecommendationsIn The Web Conference (WWW 2023), 2023.[PDF]• \nJointly Attacking Graph Neural Network and its ExplanationsIn Proceedings of 39th IEEE International Conference on Data Engineering (ICDE 2023), 2023.[ArXiv] [Slides]\n• \nA Comprehensive Survey on Automated Machine Learning for RecommendationsIn ACM Transactions on Recommender Systems, 2023. [ArXiv] [PDF]\n• \nFairness ReprogrammingIn Thirty-sixth Conference on Neural Information Processing Systems (NeurIPS 2022), 2022.[PDF] [Code]\n• \nIdentifying The Kind Behind SMILES - Anatomical Therapeutic Chemical Classification using Structure-Only RepresentationsIn Briefings in Bioinformatics (BIB), 2022. (Impact Factor: 13.994)[PDF] [Code] \n• \nDisentangled Contrastive Learning for Social RecommendationIn ACM International on Conference on Information and Knowledge Management (CIKM 2022), 2022.[PDF]\n• \nKnowledge-enhanced Black-box Attacks for RecommendationsIn Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2022), 2022.[PDF] [Slides] Title: Trustworthy AI: A Computational Perspective\nPublished Time: 2022\nConference: ACM Transactions on Intelligent Systems and Technology (ACM TIST)\n\nGraph Trend Filtering Networks for Recommendation\nPublished Time: 2022\nConference: 45th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2022)\n\nMulti-type Urban Crime Prediction\nPublished Time: 2022\nConference: 36th AAAI Conference on Artificial Intelligence (AAAI 2022)\n\nAutoEmb: Automated Embedding Dimensionality Search in Streaming Recommendations\nPublished Time: 2021\nConference: IEEE 21st International Conference on Data Mining (ICDM 2021), best-ranked papers\n\nAutoLoss: Automated Loss Function Search in Recommendations\nPublished Time: 2021\nConference: In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2021)\n\nAttacking Black-box Recommendations via Copying Cross-domain User Profiles\nPublished Time: 2021\nConference: 37th IEEE International Conference on Data Engineering (ICDE 2021, Full paper)\n\nDoes Gender Matter? Towards Fairness in Dialogue Systems\nPublished Time: 2020\nConference: In Proceedings of the 28th International Conference on Computational Linguistics (COLING 2020)\n\nA Graph Neural Network Framework for Social Recommendations\nPublished Time: 2020\nConference: IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE 2020)\n\nDeep Adversarial Canonical Correlation Analysis\nPublished Time: 2020\nConference: In Proceedings of the 2020 SIAM International Conference on Data Mining (SDM 2020)\n\nGlobal-and-Local Aware Data Generation for the Class Imbalance Problem\nPublished Time: 2020\nConference: In Proceedings of the 2020 SIAM International Conference on Data Mining (SDM 2020)\n\nEpidemic Graph Convolutional Network\nPublished Time: 2020\nConference: In Proceedings of the 13th ACM Conference on Web Search and Data Mining (WSDM 2020)\n\nDeep Social Collaborative Filtering\nPublished Time: 2019\nConference: In Proceedings of the 13th ACM Conference on Recommender Systems (RecSys 2019) * Title: Deep Adversarial Social Recommendation\nPublished Time: In Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI 2019)\nConference: IJCAI 2019\n*Title: Graph Neural Networks for Social Recommendation\nPublished Time: In Proceedings of the 28th International Conference on World Wide Web (WWW 2019)\nAccepted in: Full, Oral\nAcceptance rate: 18%\nConference: WWW 2019\n*Title: Deep Modeling of Social Relations for Recommendation\nPublished Time: In Proceedings of the Thirty-Second AAAI Conference on Artificial Intelligence (AAAI 2018)\nConference: AAAI 2018",
    "recruitment": "<Research Interests>\n• Data Mining, Machine Learning, and Artificial Intelligence, with a particular focus on:\n    • Recommender Systems (RecSys)andManagement Information Systems (MIS)\n    • Large Language Models (LLMs)\n    • Trustworthy AI: Adversarial Attacks & Robustness; Fairness; Explainability, etc.\n    • Graph Machine Learning: Graph Neural Networks; Graph Foundation Models\n    • AI/ML/DM + X: Business; Science\n</Research Interests>\n\n<Call for Papers>\n• Call for Papers (Special Topics Track@WISE 2024):\n    • International Web Information Systems Engineering conference (also known as the WISE conference), 2024.\n        • Submission Deadline: 30 July, 2024.\n        • Location: Doha Qatar\n        • Conference Dates: 2-5 December 2024.\n</Call for Papers> • Gratefully receive a grant (Intra-Faculty Interdisciplinary Project) as the PC/Co-PI to support our research.\n• Our survey paper (“Recommender Systems in the Era of Large Language Models (LLMs)”) got accepted byIEEE TKDE 2024.\n• Salary information is not found in the input content. • Multiple PhD/Postdoc/RA positions are available (Year-round Recruitment). [Please click here for position details.]\n\n• Salary information is not explicitly mentioned.\n\n• Lab conditions are not explicitly mentioned. <Salary information not found>\n \n<Lab condition information not found> * No relevant information about researcher's recruitment information.\n* Salary is not mentioned in the text.\n* Lab condition is not explicitly mentioned, but it can be inferred that the researchers work in a lab with good equipment and resources, as they are able to conduct research in various areas related to recommendation systems and natural language processing. * Researcher's Recruitment Information:\nNo relevant information found.\n* Salary:\nNo relevant information found.\n* Lab condition:\n- Empowering Molecule Discovery for Molecule-Caption Translation with Large Language Models: A ChatGPT Perspective - No specific lab condition mentioned, but it is mentioned that this work was done in IEEE TKDE 2024, which is a journal publication.\n- Recommender Systems in the Era of Large Language Models (LLMs) - No specific lab condition mentioned, but it is mentioned that this work was done in IEEE TKDE 2024, which is a journal publication.\n- Fast Graph Condensation with Structure-based Neural Tangent Kernel - No specific lab condition mentioned.\n- Linear-Time Graph Neural Networks for Scalable Recommendations - No specific lab condition mentioned.\n* Other:\n- FashionReGen: LLM-Empowered Fashion Report Generation - No specific lab condition mentioned, but it is mentioned that this work was done in The Web Conference (WWW 2024 Demo), which is a conference publication.\n- Interpretation-Empowered Neural Cleanse for Backdoor Attacks - No specific lab condition mentioned, but it is mentioned that this work was done in The Web Conference (WWW 2024 Short Paper), which is a conference publication.\n- Adversarial Attacks for Black-box Recommender Systems via Copying Transferable Cross-domain User Profiles - No specific lab condition mentioned, but it is mentioned that this work was done in IEEE TKDE 2023, which is a journal publication. Unfortunately, I couldn't find any relevant information about researcher's recruitment information, salary, or lab conditions in the provided text. * \n  * \n   * \n    * \n     * \n      * \n       * \n        * \n         * \n          * \n           * \n            * \n             * \n              * \n               * \n                * \n                 * \n                  * \n\nNote: No relevant information about researcher's recruitment, salary and lab conditions could be found."
}