{
    "name": "XIAOBin",
    "personal background": "<Dr. Bin Xiao is a full professor in the Department of Computing, the Hong Kong Polytechnic University. He received the B.Sc and M.Sc degrees in the Electronics Engineering from Fudan University, China, and Ph.D. degree in Computer Science from University of Texas at Dallas, USA in 2003. He joined the Hong Kong Polytechnic University as an assistant professor after his Ph.D. graduation. Currently, he is the associate editor of IEEE TCC and IEEE TNSE , IEEE ComSoc distinguished lecturer , the chair of IEEE ComSoc Communications and Information Security Technical Committee ( CISTC Chair ), a Fellow of IEEE and a Fellow of AAIA . He has been the associate editor for Elsevier JPDC from 2016 to 2021 and IEEE IoTJ from 2020 to 2023. Many graduates from his group got faculty positions in the top universities in both the mainland and HK.Ph.D. Opportunity : In general, we are looking for good Ph.D. candidates all year around (fellowship HK$18,890 per month) in the areas of Data Science, focusing on security and privacy, e.g., AI security, Database security and privacy, Web3 (DID) and Blockchain Systems . Post-Doc Opportunity : We have the HK RGC, PolyU Postdoctoral Fellowship schemes (around HKD30,000/month ) to support aspiring scholars (以及同内地共同培养博士后计划，香港这边资助18个月). Research Assistant Opportunity : Research assistant positions are vailable for year-4 undergraduate students and graduate students, with salary HKD13,500 - HKD20,000/month in the areas of Data Science, e.g., AI security, Database privacy, Web3 . Recent Successful Grants as PI (to support above positions): • HK RGC GRF, \"Towards Privacy-preserving and Secure Authentication of Decentralized Identity\",HKD1.3M, 2025-2027. • NSFC/RGCjoint research scheme, \"Enhancing Digital Asset Security Based on the Blockchain Technology\",HKD1.2M, 2023-2026. • HK RGC GRF, \"Vulnerability Analysis and Robustness Improvement of 3D Point Cloud Models\",HKD1.5M, 2024-2026. • HK RGC GRF, \"Security Assessment of Decentralized Finance (DeFi) Protocols by Exploiting Trading, Liquidity and Real Market\",HKD1.1M, 2023-2025. > • Congratulations to our Ph.D. graduate, Dr. Zecheng Li, who got theResearch Assistant Professor offerfrom the HK Polytechnic Univ., Sept. 2022!\n• Congratulations to Mr. Yiquan Li(undergraduate in thePolyU URISprogramme), whose paper (second author) is accepted in IEEE/CVF CVPR 2023, Vancouver, Canada, June 2023!\n• Welcome submissions to IEEE GLOBECOM 2024 -Communication & Information Systems Security Symposium (CISS), Manuscript Submission Deadline: 1 Apr. 2024.\n• Congratulations to Dr. Shang Gaowho got theResearch Assistant Professor offerfrom the HK Polytechnic Univ., Feb. 2020!\n• Congratulations toDr. PENG Zhewho got theResearch Assistant Professor offerfrom the HK Baptist Univ., Oct. 2019!\n• Congratulations to GAO Shang's work in theMining Attacks to the Blockchain System, which is accepted in the top conferenceACM CCS 2019!\n• Ph.D. student PENG, Zhe visitedStony Brook Univ., USA, started from Sept. 2017 for 6 months.\n• Congratulations to PENG, Zhe and GAO, Shang for winning thefirst prizein the COMP Annual Research Day! May 2017.\n• Welcome submissions to theCommunication & Information Systems Security SymposiumofIEEE Globecom 2017. Submission deadline:April 1, 2017. • The Post-Doc position is filled for the MCC lab, Feb. 2014.\n• A Post-Doc position is available for the MCC lab, with the salary about HKD21,000/month. Dec. 2013.\n• The Mobile Cloud Computing (MCC) lab is set up. Dr. Xiao is the lab director. Nov. 2013.\n• A Ph.D. position now is open in the mobile cloud computing and smartphone technology areas. Send me email if you are interested in these areas. A master-degree candidate will be considered first. July 2013.\n• Congratulations to Dr. Kai Bu, who will be theassistant professorin the College of Computer Science and Technology, Zhejiang University, Hangzhou China, July 2013.\n• Congratulations to Dr. Jiaqing Luo, who was recently promoted toassociate professorin the School of Computer Science and Engineering, University of Electronic Science and Technology of China, Chengdu China, June 2013.",
    "research interest": "<Research Interests>\nWe are looking for good Ph.D. candidates all year around (fellowship HK$18,890 per month) in the areas of Data Science, focusing on security and privacy, e.g., AI security, Database security and privacy, Web3 (DID) and Blockchain Systems .\n</Research Interests> • Research interests include high performance and security in cloud computing as evident from the submission deadline for a special issue on \"High Performance and Security in Cloud Computing\".",
    "publication": "Title: Dr. Bin Xiao (肖斌) - Full Professor at Hong Kong Polytechnic University\n\nPublished Time:\n- B.Sc and M.Sc degrees in the Electronics Engineering from Fudan University, China, 2003\n- Ph.D. degree in Computer Science from University of Texas at Dallas, USA, 2003\n\nConference of Researcher's Publication:\n- IEEE GLOBECOM 2024 -Communication & Information Systems Security Symposium (CISS)\n- IEEE ICDCS 2022 -Security, Privacy, and Trust in Distributed Systems\n- IEEE TNSE special issue -Security and Privacy for AI Models and Applications (x2)\n- IEEE SECON 2018\n- IEEE ICC 2018",
    "recruitment": "<Ph.D. Opportunity: \nWe are looking for good Ph.D. candidates all year around (fellowship HK$18,890 per month) in the areas of Data Science, focusing on security and privacy, e.g., AI security, Database security and privacy, Web3 (DID) and Blockchain Systems.\n\n<Post-Doc Opportunity: \nWe have the HK RGC, PolyU Postdoctoral Fellowship schemes (around HKD30,000/month ) to support aspiring scholars. If your research area is in the field of Data Science, AI security, Database security and privacy, or Web3 , please contact me with your CV and publications.\n\n<Research Assistant Opportunity: \nResearch assistant positions are available for year-4 undergraduate students and graduate students, with salary HKD13,500 - HKD20,000/month in the areas of Data Science, e.g., AI security, Database privacy, Web3. • Welcome submissions to IEEE GLOBECOM 2024 -Communication & Information Systems Security Symposium (CISS), Manuscript Submission Deadline: 1 Apr. 2024.\n• A Ph.D. position is available for the MCC lab, with the salary\n• Congratulations to Mr. Yiquan Li(undergraduate in thePolyU URISprogramme), whose paper (second author) is accepted in IEEE/CVF CVPR 2023, Vancouver, Canada, June 2023!\n• Welcome submissions to IEEE ICDCS 2022 -Security, Privacy, and Trust in Distributed Systems, Manuscript Submission Deadline: 17 Jan. 2022.\n• Welcome submissions to IEEE TNSE special issue -Security and Privacy for AI Models and Applications, Manuscript Submission Deadline: 1 September 2020.•\n• Congratulations toDr. Shang Gaowho got theResearch Assistant Professor offerfrom the HK Polytechnic Univ., Feb. 2020! \n• A Ph.D. position is available for the MCC lab, with the salary\n• Congratulations toDr. PENG Zhewho got theResearch Assistant Professor offerfrom the HK Baptist Univ., Oct. 2019!\n• Welcome submissions toIEEE SECON 2018, 11-13 June 2018, Hong Kong. Submission deadline:Dec. 15, 2017.\n• A Ph.D. position is available for the MCC lab, with the salary\n• Ph.D. student PENG, Zhe visitedStony Brook Univ., USA, started from Sept. 2017 for 6 months. \n• A Ph.D. position is available for the MCC lab, with the salary • A Post-Doc position is available for the MCC lab, with the salary about HKD21,000/month. \n• The Post-Doc position is filled for the MCC lab, Feb. 2014.\n• The Mobile Cloud Computing (MCC) lab is set up. Dr. Xiao is the lab director."
}