[
    {
        "name": "Chen Richard",
        "meta_data": "{personal background, education background}",
        "content": "H1: Dr LI, Chen Richard\nH2: Asssitant ProfessorDepartment of Applied Social Sciences & Department of ComputingThe Hong Kong Polytechnic University\n• Home\n• Project\n• Publication\n• Teaching\n\n\n\nH1: About\nDr LI, Chen Richard is an assistant professor affiliated with the Department of Applied Social Sciences and the Department of Computing at The Hong Kong Polytechnic University. He received BSc in computer science and technology from Nanjing University, and MSc (Distinction) in computer science and PhD from the City University of Hong Kong. Before joining The Hong Kong Polytechnic University, he worked as a senior research associate at the , City University of Hong Kong and a postdoc research fellow at the , University of Canterbury."
    },
    {
        "name": "Chen Richard",
        "meta_data": "research interest, publication, personal background",
        "content": "As a human-centered computing researcher, Dr Li's research interest is in collaborating with talents with various backgrounds to design new technology-assisted solutions for supporting people in their daily lives. His research outcomes related to the use of virtual reality for children with special educational needs have been adopted by mainstream and special schools in Hong Kong. Academically, his research works were published in international journals such as Computers & Education (C&E), IEEE Transactions on Visualization and Computer Graphics (TVCG), International Jounral of Human-Computer Studies (IJHCS), and IEEE Transactions on Learning Technologies (TLT), as well as conference proceedings such as the proceedings of the IEEE Conference on Virtual Reality and 3D User Interfaces (VR) and the International Symposium on Mixed and Augmented Reality (ISMAR). He currently serves as the president of , member of the governing board of the , and member of the editorial board of the and ."
    },
    {
        "name": "Chen Richard",
        "meta_data": "research interest, recruitment, lab",
        "content": "H1: Join The Journey\nI am currently looking for self-motivated MPhil/PhD students with strong academic backgrounds in computer science, creative media, communication, or psychology, who might be interested in human-centered computing research. Feel free to if you have any enquiries.\n\n\n\nH1: Currrent Openings\nResearch Assistant/Associate (Full-time) - Social VR Application Development\nSenior Research Associate/Postdoc Research Fellow (supported by scheme) - VR/AR/HCI\n\n\n\nLast updated on 10 October 2024\n© document.write(new Date().getFullYear());"
    }
]