[
    {
        "name": "Haoyang",
        "meta_data": "personal background, education background, recruitment",
        "content": "• Haoyang Li's Homepage\n\n\n\nH3: Haoyang Li\nRAP in PolyU\n\n\n\n• Hong Kong SAR, China\n• PolyU\n• Email\n• Google Scholar\n\n\n\nH1: About Me\nI am currently an Assistant Professor (Research) at the Department of Computing at . I received my Ph.D. degree in Computer Science and Engineering from in 2023, advised by . Prior to that, I received my Bachelor’s degree in Computer Science and Technology from the ACM Honor Class at in 2018, advised by .\n\n\n\nEmail and address: haoyang-comp.li@polyu.edu.hk, PQ810 PolyU.\n\n\n\nIf you’d like to come to the office to chat with me, please send me an email or WeChat message in advance to find a mutually available time slot.\n\n\n\nPosition Opening"
    },
    {
        "name": "Haoyang",
        "meta_data": "recruitment, lab",
        "content": "If you’d like to come to the office to chat with me, please send me an email or WeChat message in advance to find a mutually available time slot.\n\n\n\nPosition Opening\n\n\n\n• Self-motivated full-time Research Assistants (RAs) with strong coding skills are seeked. Part-time RA positions are NOT available.\n• The PhD positions starting from 2025/09 or later are now open. The admitted PhD candidate will be supervised by myself and our department head Prof. Qing Li.\n• Self-motivated undergraduate and master's students with strong coding skills (from PolyU, mainland universities, etc.), who are interested in our research topics, are also welcome. These students will be given priority consideration for PhD opportunities.\n• MSc students at PolyU who seek a dissertation supervisor. Only 1-2 quotas are available now (2024/9/25)."
    },
    {
        "name": "Haoyang",
        "meta_data": "research interest",
        "content": "H2: Research Interests\n• Data Management for Machine Learning\n• Data-driven Machine Learning\n• Data and Model Security\n• Large Language Models\n• Graph Neural Networks and Knowledge Bases"
    },
    {
        "name": "Haoyang",
        "meta_data": "publication",
        "content": "H2: Publications [Full List]\n• Fight Fire with Fire: Towards Robust Graph Neural Networks on Dynamic Graphs via Actively DefenseHaoyang Li, Shimin Di, Calvin Hong Yi Li, Lei Chen, Xiaofang Zhou.The 50th International Conference on Very Large Databases (VLDB 2024)\n• E2GCL: Efficient and Expressive Contrastive Learning on Graph Neural NetworksHaoyang Li, Shimin Di, Lei Chen, Xiaofang Zhou.The 40th IEEE International Conference on Data Engineering (ICDE 2024)\n• Effective Data Selection and Replay for Unsupervised Continual LearningHanmo Liu, Shimin Di,Haoyang Li, Shuangyin Li, Lei Chen, Xiaofang Zhou.The 40th IEEE International Conference on Data Engineering (ICDE 2024)\n• EARLY: Efficient and Reliable Graph Neural Network for Dynamic GraphsHaoyang Li, Lei Chen.The 2023 International Conference on Management of Data (SIGMOD 2023)"
    },
    {
        "name": "Haoyang",
        "meta_data": "publication",
        "content": "• EARLY: Efficient and Reliable Graph Neural Network for Dynamic GraphsHaoyang Li, Lei Chen.The 2023 International Conference on Management of Data (SIGMOD 2023)\n• AIR: Adaptive Incremental Embedding Updating for Dynamic Knowledge GraphsZhifeng Jia,Haoyang Li, Lei Chen.The 28th International Conference on Database Systems for Advanced Applications (DASFAA 2023)\n• Revisiting Injective Attacks on Recommender SystemsHaoyang Li, Shimin Di, Lei Chen.The 36th Conference on Neural Information Processing Systems (NeurIPS 2022)\n• Black-box Adversarial Attack and Defense on Graph Neural NetworksHaoyang Li, Shimin Di, Zijian Li, Lei Chen, Jiannong Cao.The 38th IEEE International Conference on Data Engineering (ICDE 2022)\n• Cache-based GNN System for Dynamic GraphsHaoyang Li, Lei Chen.The 30th ACM International Conference on Information and Knowledge Management (CIKM 2021)"
    },
    {
        "name": "Haoyang",
        "meta_data": "publication, academic service",
        "content": "• Cache-based GNN System for Dynamic GraphsHaoyang Li, Lei Chen.The 30th ACM International Conference on Information and Knowledge Management (CIKM 2021)\n• Fine-Grained Entity Typing via Label Noise Reduction and Data AugmentationHaoyang Li, Xueling Lin, Lei Chen.The 26th International Conference on Database Systems for Advanced Applications (DASFAA 2021)\n• KBPearl: a Knowledge Base Population System Supported by Joint Entity and Relation LinkingXueling Lin,Haoyang Li, Hao Xin, Zijian Li, Lei Chen.The 46th International Conference on Very Large Databases (VLDB 2020)Academic Service\n• PC Member:WWW 2025, ICDE 2025, AAAI 2025, DASFAA 2024, ECAI 2024, RobustRecSys 2024,\n• Conference Reviewer:AISTATS 2025, ICLR 2025/2024/2023, NeurIPS 2024/2023, ICML 2024/2023, WWW 2021/2022, KDD 2020/2021/2022\n• Journal Reviewer:TKDE, TOIS, TBD"
    },
    {
        "name": "Haoyang",
        "meta_data": "Academic Service",
        "content": "H2: Academic Service\n• Follow:\n• Feed"
    }
]