[
    {
        "name": "li wenjie",
        "meta_data": "research interest, recruitment, lab",
        "content": "Postdoctoral Fellows and RAs Wanted: Highly motivated, energetic and enthusiastic persons are always welcome to work with us on the topics of natural language understanding and generation, machine conversation, summarization and question answering, etc.\n\n\nResearch Position Opening: I am looking for postdocs, research associates/assistants for the projects, Emotion-Driven Conversation, Goal-Driven Conversational Recommendation, Multi-Modal Conversational Question Answering, and Causality Mining and Reasoning in NLP, etc. Good project-relevant background knowledge and deep learning programming ability are expected. A strong publication record is preferred.\n\nResearch Interests and Areas of Research Activities\n\no   Machine Conversion\n\no   Text Summarization\n\no   Question Answering\n\no   Causality Mining and Reasoning in NLP\n\no   Natural Language Understanding and Generation\n\n \n\n ooks and Book Chapters\n2017"
    },
    {
        "name": "li wenjie",
        "meta_data": "research interest, publication",
        "content": "o   Machine Conversion\n\no   Text Summarization\n\no   Question Answering\n\no   Causality Mining and Reasoning in NLP\n\no   Natural Language Understanding and Generation\n\n \n\n ooks and Book Chapters\n2017\n\no   Social Media Content Analysis: Natural Language Processing and Beyond, Series on Language Processing, Pattern Recognition, and Intelligent Systems, November, 2017.\n\nJournal Publications\n2024\n\no   Dialogue Acts Enhanced Extract-Abstract Framework for Meeting Summarization, Information Processing and Management, 61(3), No. 103635, May, 2024. \n\no   Target-constrained Bidirectional Planning for Goal-driven Dialogue Generation, accepted by ACM Transactions on Information Systems (TOIS), March 7, 2024. \n\no   Alignment Efficient Image-Sentence Retrieval Considering Transferable Cross-Modal Representation Learning, Frontiers of Computer Science, 18(1), No. 181335, 2024. \n\n2023"
    },
    {
        "name": "li wenjie",
        "meta_data": "publication",
        "content": "o   Alignment Efficient Image-Sentence Retrieval Considering Transferable Cross-Modal Representation Learning, Frontiers of Computer Science, 18(1), No. 181335, 2024. \n\n2023\n\no   Contextualized Knowledge Graph Embedding for Explainable Talent Training Course Recommendation, ACM Transactions on Information Systems (TOIS), 42(2), No. 33, September, 2023.\n\no   A Target-driven Planning Approach for Goal-oriented Dialogue Systems, IEEE Transactions on Neural Networks and Learning Systems (TNNLS), January, 2023.\n\n2022\n\no   Geo-Tile2Vec: A Multi-Modal and Multi-Stage Embedding Framework for Urban Analytics, ACM Transactions on Spatial Algorithms and Systems, November 2022.\n\no   Mutually Reinforced Network Embedding: An Integrated Approach to Research Paper Recommendation, Expert Systems with Applications, 204, No. 117616, October 2022.\n\no   Social Attentive Deep Q-networks for Recommender Systems, IEEE Transactions on Knowledge and Data Engineering (TKDE), 34(5): 2443-2457, May 2022."
    },
    {
        "name": "li wenjie",
        "meta_data": "publication",
        "content": "o   Social Attentive Deep Q-networks for Recommender Systems, IEEE Transactions on Knowledge and Data Engineering (TKDE), 34(5): 2443-2457, May 2022.\n\no   Joint Learning of User Representation with Diffusion Sequence and Network Structure, IEEE Transactions on Knowledge and Data Engineering (TKDE), 34(3):1275-1287, March 2022.\n\no   Dynamic Graph Reasoning for Conversational Open-domain Question Answering, ACM Transactions on Information Systems (TOIS), 40(4), No. 821, January 2022.\n\no   Hierarchical Prediction and Adversarial Learning for Conditional Response Generation, IEEE Transactions on Knowledge and Data Engineering (TKDE), 34(1):314-327, January 2022.\n\n2021\n\no   Empathetic Response Generation through Graph-based Multi-hop Reasoning on Emotional Causality, Knowledge-based Systems (KBS), 233(5), 107547, December 2021.\n\no   Hierarchical Attention Link Prediction Neural Network, Knowledge-based Systems (KBS), 232(28), 107431, November 2021."
    },
    {
        "name": "li wenjie",
        "meta_data": "publication",
        "content": "o   Hierarchical Attention Link Prediction Neural Network, Knowledge-based Systems (KBS), 232(28), 107431, November 2021.\n\no   Neighborhood Attention Networks with Adversarial Learning for Link Prediction, Accepted by IEEE Transactions on Neural Network and Learning Systems (TNNLS), 32(8):3653-3663, August 2021.\n\no   Learning Graph Representation with Generative Adversarial Nets, IEEE Transactions on Knowledge and Data Engineering (TKDE), 33(8):3090-3103, August 2021. \n\no   Affective Awareness in Neural Sentiment Analysis, Knowledge-based Systems (KBS), 226(17), No. 107137, August 2021.\n\no   Lexical Data Augmentation for Sentiment Analysis, Journal of the Association for Information Science and Technology (JASIST), 72(11):1432-1447, June, 2021.\n\n2020\n\no   Tracking Dynamics of Opinion Behaviors with Content-based Sequential Opinion Influence Model, IEEE Transactions on Affective Computing (TAC), 11(4):627-639, October, 2020."
    },
    {
        "name": "li wenjie",
        "meta_data": "publication, lab",
        "content": "2020\n\no   Tracking Dynamics of Opinion Behaviors with Content-based Sequential Opinion Influence Model, IEEE Transactions on Affective Computing (TAC), 11(4):627-639, October, 2020.\n\no   Visual-Textual Emotion Analysis with Deep Coupled Video and Danmu Neural Networks, IEEE Transactions on Multimedia (TMM), 22(6):1634-1646, June 2020.\n\no   Joint Model of Entity Recognition and Relation Extraction with Self-attention Mechanism, ACM Transactions on Asian Language Information Processing (TALIP), 19(4), No. 59, May 2020.\n\nWelcome to the Natural Language Processing Group at The Hong Kong Polytechnic University!"
    },
    {
        "name": "li wenjie",
        "meta_data": "research interest, lab",
        "content": "Welcome to the Natural Language Processing Group at The Hong Kong Polytechnic University!\n\nOur group is composed of enthusiastic and diverse members including students, postdocs, and research assistants and supervised by Prof. LI, Wenjie Maggie. Together, we focus on developing algorithms that enable computers to process, generate, and comprehend human languages. Our research interests are wide-ranging and include topics such as Emotion-Driven Conversation, Goal-Driven Conversational Recommendation, Multi-Modal Conversational Question Answering, and Causality Mining and Reasoning in NLP, etc."
    }
]