[
    {
        "name": "RAYNAL_Michel",
        "meta_data": "personal background, publication, lab",
        "content": "• Search for:Search\n\n\n\n• Home\n• Team\n• Presentation\n• Research\n• Publications\n• We’re recruiting!\n• WOS\n• Contact\n\n\n\n• Follow us on X/Twitter!\n\n\n\nH1: Michel Raynal\nMichel Raynal is an emeritus professor at IRISA, University of Rennes, France. He is a senior member of the “Institut Universitaire de France” and a member of “Academia Europaea”.\n\n\n\nThe reader will find his full CV in the file . This document is composed of four parts:\n\n\n\n• CV, biography, and a view of my job in my scientific domain.\n• Recognition, management of scientific activities, and research grants in the recent past.\n• Past and present research activities\n• List of publications.\n\n\n\nIf you are interested, you will find (in French)\n\n\n\n• an opinion pieceI wrote on my view of my job, and\n• an interview of meby Benjamin Thierry.\n\n\n\nComments are closed.\n\n\n\nWe are using cookies to give you the best experience on our website.\n\n\n\nYou can find out more about which cookies we are using or switch them off in settings ."
    },
    {
        "name": "RAYNAL_Michel",
        "meta_data": "",
        "content": "Comments are closed.\n\n\n\nWe are using cookies to give you the best experience on our website.\n\n\n\nYou can find out more about which cookies we are using or switch them off in settings .\n\n\n\n• Privacy Overview\n• Strictly Necessary Cookies\n\n\n\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\n\n\n\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\n\n\n\nIf you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."
    }
]