[
    {
        "name": "ROSSI_Luca",
        "meta_data": "recruitment, personal background",
        "content": "• Short Bio\n• Job Opportunities\n• News & Events\n• Journals\n• Conferences\n• Grants\n• Students\n• Software\n• Teaching\n• Others\n• Contact\n\n\n\nH1: Short Bio\nH1: Research assistant, PhD, and postdoctoral opportunities at PolyU\nI'm currently looking for exceptional students interested in applying for the Hong Kong PhD Fellowship Scheme under my supervision. The deadline for applications is the 1st of December 2024, asap so that I can help you to shape a strong research proposal for your application. More info can be found at . Students interested in PolyU's , visiting researchers, and research assistant are also welcome to ."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication, research interest",
        "content": "H1: News & Upcoming Events\n• I will be chairingS+SSPR 2024in Venice (Italy) on 9-10 September 2024.\n• GraFix: A Graph Transformer with Fixed Attention based on the WL Kernelhas been accepted toICPR 2024.\n• Graph Kernel Neural Networkshas been accepted for publication on the joiurnalIEEE Transactions on Neural Networks and Learning Systems.\n• Graph neural networks in vision-language image understanding: a surveyhas been accepted for publication on the journalThe Visual Computer."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "H1: Journals\n• L. Cosmo, G. Minello, M. Bronstein, E. Rodolà,L. Rossiand A. Torsello,Graph Kernel Neural Networks,IEEE Transactions on Neural Networks and Learning Systems, 2024.\n• H. Senior, G. Slabaugh, S. Yuan andL. Rossi,Graph neural networks in vision-language image understanding: a survey,The Visual Computer, 2024.\n• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,GNN-LoFI: A novel graph neural network through localized feature-based histogram intersection,Pattern Recognition, 2024.\n• X. Xu, J. Gevers andL. Rossi,Can I write this is ableist AF in a peer review?: A corpus-driven analysis of Twitter engagement strategies across disciplinary groups,Ibérica, 2023.\n• L. Cosmo, G. Minello, M. Bronstein, Emanuele Rodolà,L. Rossiand A. Torsello,3D Shape Analysis through a Quantum Lens: the Average Mixing Kernel Signature,International Journal of Computer Vision, 2022."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Bai, Y. Jiao, L. Cui,L. Rossi, Y. Wang, P. S. Yu and E. R. Hancock,Learning Graph Convolutional Networks based on Quantum Vertex Information Propagation,IEEE Transactions on Knowledge and Data Engineering, 2021.\n• G. Minello,L. Rossiand A. Torsello,k-Anonymity on Graphs using the Szemerédi Regularity Lemma,IEEE Transactions on Network Science and Engineering, 2020.\n• L. Bai, L. Cui, Y. Jiao,L. Rossiand E. R. Hancock,Learning Backtrackless Aligned-Spatial Graph Convolutional Networks for Graph Classifications,IEEE Transactions on Pattern Analysis and Machine Intelligence, 2020.\n• L. Bai,L. Rossi, L. Cui, J. Cheng and E. R. Hancock,A quantum-inspired similarity measure for the analysis of complete weighted graphs,IEEE Transactions on Cybernetics, 2020.\n• G. Minello,L. Rossiand A. Torsello,Can a Quantum Walk Tell Which Is Which? A Study of Quantum Walk-Based Graph Similarity,Entropy, 2019."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• G. Minello,L. Rossiand A. Torsello,Can a Quantum Walk Tell Which Is Which? A Study of Quantum Walk-Based Graph Similarity,Entropy, 2019.\n• G. Minello,L. Rossiand A. Torsello,On the von Neumann entropy of graphs,Journal of Complex Networks, 2018.\n• C. Ye, R. C. Wilson,L. Rossi, A Torsello and E. R Hancock,Thermodynamic analysis of time evolving networks,Entropy, 2018.\n• L. Bai, L. Cui,L. Rossi, B. Xiao and E. R. Hancock,Local-Global Nested Graph Kernels Using Nested Complexity Traces,Pattern Recognition Letters, 2018.\n• L. Bai,L. Rossi, L. Cui, Z. Zhang, P. Ren and E. R. Hancock,Quantum Kernels for Unattributed Graphs using Discrete-time Quantum Walks,Pattern Recognition Letters, 2017.\n• L. Rossi, J. Walker and M. Musolesi,Spatio-Temporal Techniques for User Identification by means of GPS Mobility Data,EPJ Data Science, 4(1), 1-16, 2015"
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Rossi, J. Walker and M. Musolesi,Spatio-Temporal Techniques for User Identification by means of GPS Mobility Data,EPJ Data Science, 4(1), 1-16, 2015\n• L. Rossi, A. Torsello and E. R. Hancock,Unfolding Kernel Embeddings of Graphs: Enhancing Class Separation through Manifold Learning,Pattern Recognition, 2015.\n• L. Rossi, A. Torsello and E. R. Hancock,Measuring Graph Similarity through Continuous-Time Quantum Walks and the Quantum Jensen-Shannon Divergence,Physical Review E, 2015.\n• L. Bai,L. Rossi, E. R. Hancock and A. Torsello,A Quantum Jensen-Shannon Graph Kernel for Unattributed Graphs,Pattern Recognition, 2014.\n• L. Rossiand A. Torsello,Coarse-to-Fine Skeleton Extraction for High Resolution 3D Meshes,Computer Vision and Image Understanding, 118:140-152, 2014\n• L. Rossi, A. Torsello, E. R. Hancock and R. C. Wilson,Characterising Graph Symmetries through Quantum-Jensen Shannon Divergence,Physical Review E, 88(3):032806, 2013."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "H1: Conferences\n• G. Minello, L. Zhang, A. Bicciato,L. Rossi, Andrea Torsello, and Luca Cosmo,LESI-GNN: an Interpretable Graph Neural Network based on Local Structures Embedding,S+SSPR, 2024.\n• L. Zhang, L. Cosmo, G. Minello, A. Torsello, andL. Rossi,GraFix: A Graph Transformer with Fixed Attention based on the WL Kernel,ICPR, 2024.\n• A. Gallagher-Syed,L. Rossi, F. Rivellese, C. Pitzalis, M. Lewis, M. Barnes, and G. Slabaugh,Multi-Stain Self-Attention Graph Multiple Instance Learning Pipeline for Histopathology Whole Slide Images,BMVC, 2023.\n• R. Ye, L. Cui,L. Rossi, Y. Wang, Z. Xu, L. Bai and E. R. Hancock,C2N-ABDP: Cluster-to-Node Attention-based Differentiable Pooling,GbR, 2023.\n• Y. Liu,L. Rossiand A. Torsello,A novel graph kernel based on the Wasserstein distance and spectral signatures,S+SSPR, 2022.\n• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,Classifying Me Softly: a Novel Graph Neural Network Based on Features Soft-Alignment,S+SSPR, 2022."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,Classifying Me Softly: a Novel Graph Neural Network Based on Features Soft-Alignment,S+SSPR, 2022.\n• L. Rossiand A. Torsello,Estimating the Manifold Dimension of a Complex Network Using Weyl’s Law. Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2020).\n• L. Cosmo, G. Minello, M. Bronstein,L. Rossiand A. Torsello,The Average Mixing Kernel Signature. 16th European Conference On Computer Vision (ECCV 2020).\n• D. Foffano,L. Rossiand A. Torsello,You Can’t See Me: Anonymising Graphs using the Szemeredi Regularity Lemma. International workshop on Modeling and mining Social-Media-driven Complex Networks (ICWSM 2019)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Cui, L. Bai,L. Rossi, Z. Zhang, L. Xu and E. R. Hancock,A Mixed Entropy Local-Global Reproducing Kernel for Attributed Graphs. Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2018).\n• L. Cui, L. Bai,L. Rossi, Z. Zhang, Y. Jiao and E. R. Hancock,A Preliminary Survey of Analyzing Dynamic Time-varying Financial Networks Using Graph Kernels. Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (S+SSPR 2018).\n• L. Bai, L. Cui,L. Rossi, Y. Wang and E. R. Hancock,A Deep Hybrid Graph Kernel Through Deep Learning Networks. 24th International Conference on Pattern Recognition (ICPR 2018).\n• L. Rossi, E. Boscaro and A. Torsello,Venice through the Lens of Instagram: A Visual Narrative of Tourism in Venice. 8th International Workshop on Location and the Web (LocWeb 2018)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Rossi, E. Boscaro and A. Torsello,Venice through the Lens of Instagram: A Visual Narrative of Tourism in Venice. 8th International Workshop on Location and the Web (LocWeb 2018).\n• L. Bai, L. Cui,L. Rossi, E. R. Hancock and Y. Jiao,Adaptive Feature Selection based on the Most Informative Graph-based Features. 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017).\n• L. Bai,L. Rossi, L. Cui and E. R Hancock,Nested Alignment Graph Kernel through the Dynamic Time Warping Framework. 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017).\n• L. Rossiand A. Torsello,Measuring Vertex Centrality Using the Holevo Quantity. 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Rossiand A. Torsello,Measuring Vertex Centrality Using the Holevo Quantity. 11th IARP TC-15 Workshop on Graph-Based Representations in Pattern Recognition (GbR 2017).\n• J. Lockhart, G. Minello,L. Rossi, S. Severini and A. Torsello,Edge Centrality via the Holevo Quantity, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016).\n• L. Rossi, S. Severini and A. Torsello,The Average Mixing Matrix Signature, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2016).\n• L. Bai,L. Rossi, L. Cui and E. R. Hancock,A Novel Entropy-based Graph Signature from the Average Mixing Matrix, In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Bai,L. Rossi, L. Cui and E. R. Hancock,A Transitive Aligned Weisfeiler-Lehman Subtree Kernel, In Proceedings of the 23rd International Conference on Pattern Recognition (ICPR 2016).\n• M. Chorley,L. Rossi, G. Tyson and M. Williams,Pub Crawling at Scale: Tapping Untappd to Explore Social Drinking, In Proceedings of the 10th AAAI International Conference on Weblogs and Social Media (ICWSM 2016).\n• L. Bai, P. Ren, Z. Zhang,L. Rossiand E. R. Hancock,An Edge-based Matching Kernel through Discrete-time Quantum Walks, In Proceedings of the 18th International Conference on Image Analysis and Processing (ICIAP 2015).Best Paper Award (Caianello Prize).\n• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Bai,L. Rossi, C. Wang, Z. Zhang and E. R. Hancock,An Aligned Subtree Kernel for Weighted Graphs, In Proceedings of the 32nd International Conference on Machine Learning (ICML 2015).\n• L. Rossi, M. J. Williams, C. Stich and M. Musolesi,Privacy and the City: User Identification and Location Semantics in Location-Based Social Networks, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n• L. Rossi, M. Musolesi and A. TorselloOn the k-Anonymization of Time-varying and Multi-layer Social Graphs, In Proceedings of the 9th AAAI International Conference on Weblogs and Social Media (ICWSM 2015).\n• L. Bai,L. Rossi, P. Ren, Z. Zhang and E. R. Hancock,A Quantum Jensen-Shannon Graph Kernel using Discrete-time Quantum Walks, 10th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2015)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Rossiand M. Musolesi,It's the Way you Check-in: Identifying Users in Location-Based Social Networks, In Proceedings of the ACM Conference on Online Social Networks (COSN 2014).\n• M. Adnan, A. Lima,L. Rossi, S. Veluru, P. Longley, M. Musolesi and M. Rajarajan,Using Digital Traces for User Profiling: the Uncertainty of Identity Toolset, In Proceedings of the The 7th International Conference on Security of Information and Networks (SIN 2014).Best Human Factors and Biometrics Paper\n• L. Bai,L. Rossi, H. Bunke and E. R. Hancock,Attributed Graph Kernels Using the Jensen-Tsallis q-Differences, In Proceedings of the European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML/PKDD 2014).\n• L. Rossi, A. Torsello and E. R. Hancock,Node Centrality for Continuous-Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2014)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• A. Torsello, A. Gasparetto,L. Rossi, L. Bai and E. R. Hancock,Transitive State Alignment for the Quantum Jensen-Shannon Kernel, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition (SSSPR 2014).\n• A. Lima,L. Rossiand M. Musolesi,Coding Together at Scale: GitHub as a Collaborative Social Network, In Proceedings of the 8th AAAI International Conference on Weblogs and Social Media (ICWSM 2014).\n• L. Rossi, A. Torsello and E. R. Hancock,Enhancing the Quantum Jensen-Shannon Divergence Kernel through Manifold Learning, 15th International Conference on Computer Analysis of Images and Patterns (CAIP 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,Attributed Graph Similarity from the Quantum Jensen-Shannon Divergence, 2nd International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2013)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Bai, E. R. Hancock, A. Torsello andL. Rossi,A Quantum Jensen-Shannon Graph Kernel Using the Continuous-Time Quantum Walk, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,A Continuous-Time Quantum Walk Kernel for Unattributed Graphs, 9th IARP TC-15 Workshop on Graph-based Representations in Pattern Recognition (GbR 2013).\n• L. Rossi, A. Torsello and E. R. Hancock,Approximate Axial Symmetries from Continuous Time Quantum Walks, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012).\n• L. Han,L. Rossi, A. Torsello, E. R. Hancock and R. C. Wilson,Information Theoretic Prototype Selection for Unattributed Graphs, in Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2012) and Statistical Techniques in Pattern Recognition (SPR 2012)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication",
        "content": "• L. Rossiand A. Torsello,An Adaptive Hierarchical Approach to the Extraction of High Resolution Medial Surfaces, in Second Joint 3DIM/3DPVT Conference: 3D Imaging, Modeling, Processing, Visualization & Transmission (3DIMPVT 2012).\n• A. Albarelli, F. Bergamasco,L. Rossi, S. Vascon and A. Torsello,A Stable Graph-Based Representation for Object Recognition through High-Order Matching, in 21st International Conference on Pattern Recognition (ICPR 2012).\n• A. Torsello andL. Rossi,Supervised Learning of Graph Structure, Proc. of the 1st International Workshop on Similarity-Based Pattern Analysis and Recognition (SIMBAD 2011)."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "publication, research interest, recruitment",
        "content": "H1: Preprints\n• G. Minello, A. Bicciato,L. Rossi, A. Torsello and L. Cosmo,Graph Generation via Spectral Diffusion, arXiv:2402.18974, 2024.\n• A. Torsello and,Efficient Computation of Decoherent Quantum Walks through Eigenvalue Perturbation, arXiv:1601.04691, 2016.\n• A. Lima, V. Pejovic,L. Rossi, M. Musolesi and M. Gonzalez,Progmosis: Evaluating Risky Individual Behavior During Epidemics Using Mobile Network Data, Submission to D4D Senegal (NetMob 2015).\n\n\n\nH1: Grants\n• Improving Search Engines Using Machine Learning (KTP), £218,245, 2018-2020.\n• Using Data Analytics to Predict Debtor Payment Behaviours (KTP), £122,613, 2017-2019.\n\n\n\nH1: Students\n• Sanzhar Abdrakhim(URIS student, PolyU)\n• Peiming Chen(PhD candidate, PolyU).\n• Chenyu Liu(PhD candidate, PolyU).\n• Lingfeng Zhang(PhD candidate, PolyU).\n• Henry Senior(PhD candidate, QMUL).\n• Yantao Liu(BSc student, QMUL/BUPT).\n\n\n\nH1: Software\nPlease refer to my ."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "personal background, education background",
        "content": "H1: Software\nPlease refer to my .\n\n\n\nH1: Teaching\n• 2023-2024: Deep Learning and Foundations of AI (PolyU, BSc).\n• 2020-2022: Software Engineering and Advanced Network Programming (QMUL + BUPT Joint Programme, BSc).\n• 2020: Software Engineering and Java Programming (QMUL + BUPT Joint Programme, BSc).\n• 2019-2020: Deep Learning and C/C++ (SUSTech, BSc).\n• 2015-2018: Mathematics for Computing Professionals (Aston, BSc).\n• 2015-2018: Software Architecture (Aston, MSc).\n• 2012-2013: TA for Machine Learning and Computer Vision (Ca' Foscari, MSc).\n• 2011: TA for Probability (Ca' Foscari, BSc).\n\n\n\nH1: Research Visiting Positions\n• July 2019: Ca' Foscari University of Venice - Department of Environmental Sciences, Informatics and Statistics.\n• June-July 2015: University College London - Department of Geography.\n• March-September 2012: University of York- Department of Computer Science -CVPRresearch group."
    },
    {
        "name": "ROSSI_Luca",
        "meta_data": "research interest, publication",
        "content": "H1: Reviewer For\n• Pattern Recognition\n• Pattern Recognition Letters\n• IEEE Conference on Computer Vision and Pattern Recognition\n• European Conference on Computer Vision\n• Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition and Statistical Techniques in Pattern Recognition\n• International Joint Conference on Artificial Intelligence\n• Brain Informatics\n• Computer Vision and Image Understanding\n\n\n\nH1: Associate Editor For\n• Pattern Recognition\n\n\n\nH1: Vice-Chair of\n• IAPRTC 2(Structural and Syntactical Pattern Recognition)\n\n\n\nH1: Contact\n• Email:luca_rossi_at_polyu_edu_hk"
    }
]