[
    {
        "name": "yinxin cao",
        "meta_data": "research interest, publication",
        "content": "I am mainly working on algorithmic graph theory and its applications. I'm also interested in theoretical computer science in the broadest sense.\n\nalgorithmic & structural graph theory and graph classes,\nfine-grained complexity and algorithm design,\ncombinatorial optimization, and\ntheir applications in social networks and bioinformatics.\n\nBOOKS AND EDITED SPECIAL ISSUES OF JOURNALS\nProceedings of the 31st International Symposium on Algorithms and Computation (ISAAC 2020), Yixin Cao, Siu-Wing Cheng, and Minming Li, editors. Schloss Dagstuhl - Leibniz-Zentrum für Informatik vol. 181 (2020) [publisher]\nProceedings of the 15th International Symposium on Parameterized and Exact Computation (IPEC 2020), Yixin Cao and Marcin Pilipczuk, editors. Schloss Dagstuhl - Leibniz-Zentrum für Informatik vol. 180 (2020) [publisher]\nComputing and Combinatorics, Yixin Cao and Jianer Chen, editors. Lecture Notes in Computer Science vol. 10392, Springer (2017) [publisher]"
    },
    {
        "name": "yinxin cao",
        "meta_data": "publication",
        "content": "JOURNAL ARTICLES\nSelf-complementary (pseudo-)split graphs, with Haowei Chen and Shenghua Wang. Graphs and Combinatorics, in press (2024) [publisher]\nModification problems toward proper (Helly) circular-arc graphs, with Hanchun Yuan and Jianxin Wang. Information and Computation, 301:105211 (2024) [publisher]\n(Sub)linear kernels for edge modification problems toward structured graph classes, with Gabriel Bathie, Nicolas Bousquet, Yuping Ke, and Théo Pierron. Algorithmica, 84:3338–3364 (2022) [publisher]\nGraph searches and their end vertices, with Guozhen Rong, Jianxin Wang, and Zhifeng Wang. Algorithmica, 84:2642–2666 (2022) [publisher]\nA 5k-vertex kernel for P2-packing, with Wenjun Li and Junjie Ye. Theoretical Computer Science, 910:1–13 (2022) [publisher]\nA polynomial kernel for diamond-free editing, with Ashutosh Rai, R. B. Sandeep, and Junjie Ye. Algorithmica, 84:197–215 (2022) [publisher]"
    },
    {
        "name": "yinxin cao",
        "meta_data": "publication",
        "content": "A polynomial kernel for diamond-free editing, with Ashutosh Rai, R. B. Sandeep, and Junjie Ye. Algorithmica, 84:197–215 (2022) [publisher]\nEnd vertices of graph searches on bipartite graphs, with Meibiao Zou, Zhifeng Wang, and Jianxin Wang. Information Processing Letters, 173, Article 106176 (2022) [publisher]\nPolynomial kernels for paw-free edge modification problems, with Yuping Ke and Hanchun Yuan. Theoretical Computer Science, 891:1–12 (2021) [publisher]\nMinimum fill-in: Inapproximability and almost tight lower bounds, with R. B. Sandeep. Information and Computation, 271, Article 104514 (2020) [publisher]"
    },
    {
        "name": "yinxin cao",
        "meta_data": "recruitment, lab",
        "content": "Ph.D. Students and Postdocs\nApplications welcome! Please send via email your CV, research summary/statement, and a cover letter.\n\nUndergraduate Students\nEither drop by my office (Th-F afternoons), or come to my group meeting at PQ815, 9:30am Friday (no approval needed)."
    }
]