[
    {
        "name": "YuMax",
        "meta_data": "{personal background, education background, research interest}",
        "content": "• Home\n• Research\n• Teaching\n• Service\n• Misc\n\n\n\nH2: Education\n• PhD in Computer Science,Department of Computer Science,ETH Zurich, Switzerland. Supervised by Prof.Bertrand Meyer.\n• PhD in Engineering Science,Department of Computer Science and Technology,Nanjing University, China. Supervised by Prof. Guoliang Zheng and Prof.Xuandong Li.\n• Bachelor in Science,Department of Computer Science and Technology,Nanjing University, China.\n\n\n\nH2: Research Interests\n• Automated Program Repair\n• Automated Software Testing\n• Software Fault Localization\n• Mining Software Repositories\n\n--------------\n\n• Home\n• Research\n• Teaching\n• Service\n• Misc\n\n\n\nH2: Research Interests\n• Automated Program Repair\n• Automated Software Testing\n• Mining Software Repositories"
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "H2: Publications\n• Guojun Ma,Yu Pei, Liushan Chen, Chen Qing Gan, Hao Zhang, Hao Liang and Tian Zhang,Effective Unit Test Generation for Android Apps. ICSME 2024 Industry Track (CCF B), Accepted.\n• Linna Xie, Chongmin Li,Yu Pei, Tian Zhang, Minxue Pan,BRAFAR: Bidirectional Refactoring, Alignment, Fault Localization, and Repair for Programming Assignments. ISSTA 2024 (CCF A), Accepted.\n• Huaien Zhang,Yu Pei, Shuyun Liang, Zezhong Xing, Shin Hwei Tan,Characterizing and Detecting Program Representation Faults of Static Analysis Frameworks via Two-Dimensional Testing. ISSTA 2024 (CCF A), Accepted.\n• Huaien Zhang,Yu Pei, Shuyun Liang, Shin Hwei Tan,Understanding and Detecting Annotation-induced Faults of Static Analyzers. ESEC/FSE 2024 (CCF A), Proceedings of the ACM on Software Engineering, vol. 1(FSE),  art. 33, pp. 722-744, 2024."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Tingwei Zhu, Zhong Li, Minxue Pan, Chaoxuan Shi, Tian Zhang,Yu Pei, Xuandong Li,Deep is Better? An Empirical Comparison of Information Retrieval and Deep Learning Approaches to Code Summarization. ACM Transactions on Software Engineering and Methodology (TOSEM) (CCF A). Accepted.\n• Liushan Chen,Yu Pei, Mingyang Wan, Zhihui Fei, Tao Liang, Guojun Ma,Smart Issue Detection for Large-Scale Online Service Systems Using Multi-Channel Data. In Proceedings of the 27th International Conference on Fundamental Approaches to Software Engineering (FASE 2024) (CCF B), pp. 165-187, April 2024.\n• Shaoheng Cao, Minxue Pan,Yu Pei, Wenhua Yang, Tian Zhang, Linzhang Wang, Xuandong Li,Comprehensive Semantic Repair of Obsolete GUI Test Scripts for Mobile Applications. In Proceedings of the 46th International Conference on Software Engineering (ICSE '24) (CCF A), pp. 1-13, April 2024."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Zhong Li, Minxue Pan,Yu Pei, Tian Zhang, Xuandong Li,Empirically Revisiting and Enhancing Automatic Classification of Bug and Non-Bug Issues. Frontiers of Computer Science (FCS) (CCF B),  vol. 18, art. 185207, 2024.\n• Huaien Zhang,Yu Pei, Junjie Chen, Shin Hwei Tan,Statfier: Automated Testing of Static Analyzers via Semantic-preserving Program Transformations. ESEC/FSE 2023 (CCF A), pp.237-249, November 2023.\n• Huayao Wu, Senyao Yu, Xintao Niu, Changhai Nie,Yu Pei, Qiang He, Yun Yang,Enhancing Fault Injection Testing of Service Systems via Fault-tolerance Bottleneck. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 49, no. 8, pp. 4097-4114, August 2023.\n• Shiyu Zhang, Wenxia Liu, Qixin Wang, Lei Bu,Yu Pei,A Comparison of Transformer and AR-SI Oracle For Control-CPS Software Fault Localization. In Proceedings of the 29th IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA 2023), pp.95-100, August 2023."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Liushan Chen,Yu Pei, Minxue Pan, Tian Zhang, Qixin Wang, Carlo A. Furia,Program Repair with Repeated Learning. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 49, no. 2, pp. 831-848, February 2023.\n• Minxue Pan, Yifei Lu,Yu Pei, Tian Zhang, Xuandong Li,Preference-Wise Testing of Android Apps via Test Amplification. ACM Transactions on Software Engineering and Methodology (TOSEM) (CCF A), vol. 32, no. 1, pp. 1-37, February 2023.\n• Zhong Li, Minxue Pan,Yu Pei, Tian Zhang, Linzhang Wang, Xuandong Li,Robust Learning of Deep Predictive Models from Noisy and Imbalanced Software Engineering Datasets. In Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022) (CCF A), pp. 1-13, October 2022."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Yifei Lu, Minxue Pan,Yu Pei, Xuandong Li,Detecting Resource Utilization Bugs Induced by Variant Lifecycles in Android. In Proceedings of the 31th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA '22) (CCF A), pp.642-653, July 2022.\n• Minxue Pan, Tongtong Xu,Yu Pei, Zhong Li, Tian Zhang, Xuandong Li,GUI-Guided Test Script Repair for Mobile Apps. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 48, no. 3, pp. 910-929, March 2022.\n• Tongtong Xu, Liushan Chen,Yu Pei, Tian Zhang, Minxue Pan, Carlo A. Furia,RESTORE: Retrospective Fault Localization Enhancing Automated Program Repair. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 48, no. 1, pp. 309-326, January 2022.\n• Renhe Jiang, Zhenzhao Chen,Yu Pei, Minxue Pan, Tian Zhang, Xuandong Li,Documentation-Based Functional Constraint Generation for Library Methods. Software Testing, Verification and Reliability (STVR) (CCF B), vol. 31, no. 8, pp. e1785, 2021."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Tongtong Xu, Minxue Pan,Yu Pei, Guiyin Li, Xia Zeng, Tian Zhang, Yuetang Deng, Xuandong Li,GUIDER: GUI Structure and Vision Co-Guided Test Script. In Proceedings of the 30th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA '21) (CCF A), pp. 191-203, 2021.\n• Linna Xie, Lu Lu, Shunjie Ding,Yu Pei, Minxue Pan, Tian Zhang.Automatically Detecting Exception Handling Defects in Android Applications. In Proceedings of the 12th Asia-Pacific Symposium on Internetware (Internetware '20), 2021.\n• Liushan Chen,Yu Pei, Carlo A. Furia,Contract-Based Program Repair without The Contracts: An Extended Study. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 47, no. 12, pp. 2841-2857, December 2021.\n• Zhengzhao Chen, Renhe Jiang, Zejun Zhang,Yu Pei, Minxue Pan, Tian Zhang, Xuandong Li,Enhancing Example-Based Code Search with Functional Semantics. Journal of Systems and Software (JSS) (CCF B), vol. 165, 2020."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Minxue Pan, Yifei Lu,Yu Pei, Tian Zhang, Juan Zhai, Xuandong Li,Effective Testing of Android Apps Using Extended IFML Models. Journal of Systems and Software (JSS) (CCF B), vol. 159, 2020.\n• Yufei Yang, Wenbo Luo,Yu Pei, Minxue Pan, Tian Zhang,Execution Enhanced Static Detection of Android Privacy Leakage Hidden by Dynamic Class Loading. In Proceedings of the 2019 IEEE 43rd Annual Computer Software and Applications Conference (COMPSAC '19), pp. 149-158, 2019.\n• Zhijian He, Yao Chen, Enyan Huang, Qixin Wang,Yu Pei, Haidong Yuan,A System Identification based Oracle for Control-CPS Software Fault Localization. In Proceedings of the 41st International Conference on Software Engineering (ICSE '19) (CCF A), pp. 116-127, 2019.\n• Minxue Pan, Shouyu Chen,Yu Pei, Tian Zhang and Xuandong Li,Easy Modelling and Verification of Unpredictable and Preemptive Interrupt-driven Systems. In Proceedings of the 41st International Conference on Software Engineering (ICSE '19) (CCF A), pp. 212-222, 2019."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Minxue Pan, Tongtong Xu,Yu Pei, Zhong Li, Tian Zhang, Xuandong Li,GUI-guided repair of mobile test scripts. In Proceedings of the 41st International Conference on Software Engineering: Companion Proceedings, pp. 326-327, 2019.\n• Renhe Jiang, Zhengzhao Chen, Zejun Zhang,Yu Pei, Minxue Pan, Tian Zhang,Semantics-Based Code Search Using Input/Output Examples. In Proceedings of the 18th IEEE International Working Conference on Source Code Analysis and Manipulation  (SCAM '18), pp. 92-102, 2018.\n• Nana Chang, Linzhang Wang,Yu Pei, Subrota K. Mondal, Xuandong Li,Change-Based Test Script Maintenance for Android Apps. In Proceedings of the 18th IEEE International Conference on Software Quality, Reliability & Security  (QRS '18), pp. 215-225, 2018.\n• Liushan Chen,Yu Pei, Carlo A. Furia,Contract-based Program Repair without the Contracts. In Proceedings of the 32nd IEEE/ACM International Conference on Automated Software Engineering (ASE '17) (CCF A), pp. 637-647, 2017."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Xiao Li, Nana Chang, Yan Wang, Haohua Huang,Yu Pei, Linzhang Wang, Xuandong Li,ATOM: Automatic Maintenance of GUI Test Scripts for Evolving Mobile Applications. In Proceedings of the 2017 International Conference on Software Testing (ICST ’17), pp. 161-171, 2017.\n• Yu Pei, Carlo A. Furia, Martin Nordio, Bertrand Meyer,Automated Program Repair in an Integrated Development Environment. In Proceedings of the 2015 International Conference on Software Engineering (ICSE ’15) (CCF A), pp. 681-684, 2015.\n• Yu Pei, Carlo A. Furia, Martin Nordio, Yi Wei, Andreas Zeller, Bertrand Meyer,Automated Fixing of Programs with Contracts. IEEE Transactions on Software Engineering (TSE) (CCF A), vol. 40, no. 5, pp. 427–449, May 2014.\n• Yu Pei, Carlo A. Furia, Martin Nordio.Automatic Program Repair by Fixing Contracts. In Proceedings of the 17th International Conference on Fundamental Approaches to Software Engineering (FASE '14), pp. 246–260, 2014."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Nadia Polikarpova, Carlo A. Furia,Yu Pei, Yi Wei, Bertrand Meyer.What Good Are Strong Specifications?In Proceedings of the 2013 International Conference on Software Engineering (ICSE ’13) (CCF A), pp. 262–271, 2013.\n• Yu Pei, Yi Wei, Carlo A. Furia, Martin Nordio, Bertrand Meyer.Code-based Automated Program Fixing. In Proceedings of the 2011 26th IEEE/ACM International Conference on Automated Software Engineering (ASE '11) (CCF A), pp. 392–395, 2011.\n• Yi Wei, Hannes Roth, Carlo A. Furia,Yu Pei, Alexand Horton, Michael Steindorfer, Martin Nordio and Bertrand Meyer.Stateful Testing: Finding More Faults in Code and Contracts. In Proceedings of the 2011 26th IEEE/ACM International Conference on Automated Software Engineering (ASE '11) (CCF A), pp. 440–443, 2011."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Yi Wei,Yu Pei, Carlo A. Furia, Lucas S. Silva, Stefan Buchholz, Bertrand Meyer and Andreas Zeller.Automated Fixing of Programs with Contracts. In Proceedings of the 19th International Symposium on Software Testing and Analysis (ISSTA '10) (CCF A), pp. 61–72, 2010.\n• Yu Pei.Design and Implementation of a Developing Tool for SVG-based Self-adaptive Software GUI. In Computer Science (in Chinese), vol. 35(1), 2008.\n• Yu Pei, Xuandong Li, and Guoliang Zheng.LDPChecker: A Model Checking Tool for Real Time and Hybrid System. In Journal of Computer Research and Development (in Chinese), vol. 42(1), pp. 38–46, 2005.\n• Yu Pei, Qiwen Xu, Xuandong Li, and Guoliang Zheng.QRDChecker: A Model Checking Tool for QRDC. In Journal of Software (in Chinese), vol. 16(3), pp. 355–364, 2005."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Yu Pei, Qiwen Xu, Xuandong Li, and Guoliang Zheng.QRDChecker: A Model Checking Tool for QRDC. In Journal of Software (in Chinese), vol. 16(3), pp. 355–364, 2005.\n• Yu Pei, and Qiwen Xu.Checking Interval Based Properties for Reactive Systems. In Proceedings of the Fifth International Conference on Verification, Model Checking and Abstract Interpretation (VMCAI '04), pp. 122–134, 2004. 12.\n• Xuandong Li, Jianhua Zhao,Yu Pei, Yong Li, Tao Zheng, and Guoliang Zheng.Positive Loop-Closed Automata: A Decidable Class of Hybrid Systems. In Journal of Logic and Algebraic Programming, vol. 52-53(C), pp. 79–108, 2002.\n• Xuandong Li, Meng Cui,Yu Pei, Jianhua Zhao, Guoliang Zheng.Timing Analysis of UML Activity Diagrams. In UML’01 - The Unified Modeling Language, LNCS2185, pp. 62–75, 2001."
    },
    {
        "name": "YuMax",
        "meta_data": "publication",
        "content": "• Xuandong Li, Meng Cui,Yu Pei, Jianhua Zhao, Guoliang Zheng.Timing Analysis of UML Activity Diagrams. In UML’01 - The Unified Modeling Language, LNCS2185, pp. 62–75, 2001.\n• Xuandong Li,Yu Pei, Jianhua Zhao, Yong Li, Tao Zheng, Guoliang Zheng.Efficient Verification of a Class of Linear Hybrid Automata Using Linear Programming. In Correct Hardware Design and Verification Methods, LNCS2144, pp. 465–479, 2001.\n• Yu Pei, Xuandong Li, Guoliang Zheng.Model Checking for Positive Loop-Closed Hybrid Systems. In Journal of Nanjing University (in Chinese), Natural Sciences, vol. 36, pp. 299–303, 2000."
    },
    {
        "name": "YuMax",
        "meta_data": "lab, research interest",
        "content": "H2: Research Students\n• Huaien ZHANG\n• Liushan CHEN\n\n\n\n• Shunjie DING (Nanjing University) (2018.11--2019.5)\n• Wenxi WANG (2017.9--2018.8)\n• Tongtong XU (Nanjing University) (2017.8--2018.3)\n\n\n\nH2: Projects\n• Hong Kong RGC General Research Fund (GRF) PolyU 152703/16E (2017.1-2020.1).\n• The Hong Kong Polytechnic University internal fund 1-ZVJ1 (2016.6-2019.6).\n\n\n\n• AutoFix: Automated Fixing of Programs with Contracts"
    }
]