[
    {
        "name": "ZHANGChengqi",
        "meta_data": "{personal background, education background, research interest, recruitment}",
        "content": "Chengqi ZHANG\n\n\n\n(Chair Professor of AI)\n\n\n\n( 张成奇 人工智能讲座教授 ) \n\n\n\nBSc (Fudan U),\n\n\n\nMSc (Jilin U),\n\n\n\nPhD (Queensland U)\n\n\n\nDSc （ Deakin U ） \n\n\n\nResearch Areas: Distributed Artificial Intelligence and Data Mining\n\n\n\nEmployment:\n\n\n\nChengqi Zhang has joined the Department of Data\n  Science and Artificial Intelligence at The Hong Kong Polytechnic University ( PolyU ) as a Chair\n  Professor of Artificial Intelligence in September 2024."
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "personal background, education background",
        "content": "He had been appointed as a Pro Vice-Chancellor (China Enterprise) on\n  1 December 2021 till 30 November 2025 at the University of Technology Sydney\n  (UTS), a Distinguished Professor on 27 February 2017 till 2027 at UTS, an\n  Associate Vice President (Research Relationships China) from 1 December 2017\n  to 30 November 2021 at UTS, an Executive Director UTS Data Science from 3\n  January 2017 to 30 November 2017 at UTS, and a Research Professor of Information\n  Technology from 14 December 2001 at UTS.Before 2001, he was an Associate Professor from January 1999 to\n  December 2001 at Deakin University, an Associate Professor from January 1998\n  to January 1999 at the University of New England (UNE), a Senior Lecturer\n  from January 1994 to January 1998 at UNE, and a Lecturer from January 1990 to\n  January 1994 at UNE."
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "{personal background, education background}",
        "content": "In addition, he had been appointed as an Adjunct Professor from 20 March\n  2017 till 20 March 2020 at UNSW and as a Honorary\n  Professor from 1 March 2015 to 31 December 2017 at UQ. \n\n\n\nEducation:\n\n\n\nProf. Zhang obtained his Bachelor's degree from\n  Fudan University in March 1982 in Computer Science, Master's degree by\n  research from Jilin University in March 1985 in Artificial Intelligence, PhD\n  degree from The University of Queensland in October 1991 in Artificial\n  Intelligence, followed by a Doctor of Science (DSc – Higher Doctorate) from\n  Deakin University in October 2002 in Artificial Intelligence. \n\n\n\nAchievements:"
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "{personal background, research interest, publication}",
        "content": "He has achieved outstanding research results and provided excellent\n  leadership during his academic career. Hisresearch interests mainly focus on\n  Distributed Artificial Intelligence and Data Mining. A prolific contributor\n  to his field, Professor Zhang has published over 388 scholarly articles,\n  including a number of papers in first-class international journals, such as\n  Artificial Intelligence, IEEE, and ACM Transactions. As per Google Scholar,\n  his body of work has attracted more than 34,500 citations, in which the\n  citations of one paper is nearly 10,000 (9943), and an H-index of 71 (on 01/10/2024).\n  He has supervised 39 PhD students as the Principal supervisor, a notable 10\n  of whom have ascended to full professorships. He has been a sought-after\n  keynote speaker at 33 international conferences. His dedication earned him\n  the NSW Science and Engineering Award (2011) and the Vice-Chancellor's Award"
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "personal background, research interest",
        "content": "keynote speaker at 33 international conferences. His dedication earned him\n  the NSW Science and Engineering Award (2011) and the Vice-Chancellor's Award\n  for Outstanding Research in Leadership at UTS (2011). He was also awarded the\n  2021 IEEE ICDM Outstanding Service Award."
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "",
        "content": "Leaderships:"
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "personal background, lab, research interest",
        "content": "On 16 April\n  2008, he accepted a position as the founding Director of the UTS Priority\n  Research Centre for Quantum Computation & Intelligent Systems (QCIS) till\n  2 January 2017.Under his leadership,\n  the Centre has attracted research funding in excess of $16.9 million from the\n  ARC and industries, and attracted ten ARC Future Fellowships and five ARC\n  DECRAs awards.QCIS has become the\n  strongest IT research centre among Australian Universities. In consequence, QCIS\n  has helped UTS Computer Science to be ranked among the top 100 universities\n  by QS 2021, and No. 17 worldwide based on ShanghaiJiaoTongUniversity’s academic rankings in 2021. QCIS has established five joint\n  research centres with Tsinghua University, ShanghaiJiaoTongUniversity, Huazhong University of Science and Technology, Beijing Institute\n  of Technology, and the Chinese Academy of Sciences. QCIS has spin-off into\n  two new research centres in 2017 as Centre for Quantum Software and"
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "lab, research interest",
        "content": "of Technology, and the Chinese Academy of Sciences. QCIS has spin-off into\n  two new research centres in 2017 as Centre for Quantum Software and\n  Information (CQSI) and the Centre for Artificial Intelligence (CAI)."
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "personal background, publication",
        "content": "Prof. Zhang is a Fellow of the Australian Computer\n  Society (ACS) and a Senior Member of the IEEE Computer Society (IEEE).\n  Additionally, he served in the ARC College of Experts from 2012 to 2014. He\n  had been elected as the founding Chair of the Steering Committee of the\n  International Conference on Knowledge Science, Engineering, and Management\n  between 2006 and 2014. He has been serving as an Associate Editor for\n  international journals, including IEEE Transactions on Knowledge and Data\n  Engineering from 2005 to 2008; and he served as General Chair for a number of international Conferences including ICDM 2010 , KDD 2015 and\n  IJCAI-2024. He was appointed as the first IJCAI Sponsorship Officer from 2018 to 2023. In\n  addition, he has been elected as the Chairman of the Australian Computer\n  Society National Committee for Artificial Intelligence since November 2005\n  and he has been elected as the Chairman of IEEE Computer Society Technical"
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "personal background",
        "content": "Society National Committee for Artificial Intelligence since November 2005\n  and he has been elected as the Chairman of IEEE Computer Society Technical\n  Committee of Intelligent Informatics (TCII) from June 2014 to June 2018."
    },
    {
        "name": "ZHANGChengqi",
        "meta_data": "{personal background, publication, recruitment}",
        "content": "Furthermore, he\n  has been invited to be the judge of IJCAI award committee from 2021 to 2023\n  and the judge ofMIT Technology Review\n  Innovators Under 35 – TR35 from 2021 to 2024 for China and Asia-Pacific\n  regions.\n\n\n\nSelective Publications and\nCitations: \n\n\n\n• Publications from the DBLP link\n\n\n\n• Citationsfrom Google\n     Scholar\n\n\n\nPhD\nopportunities:\n\n\n\nIf you are interested in to pursuit PhD study under my\nsupervision, please feel free to send me your CV and research proposal.\n\n\n\nContact\ninformation: \n\n\n\nRoom GH805\n\n\n\nDepartment\n  of Data Science and Artificial Intelligence\n\n\n\nThe Hong\n  Kong Polytechnic University,HungHom, KowloonHong Kong, CHINA Chengqi.zhang@polyu.edu.hk"
    }
]