{
    "personal background": "***** content: *****\n\nDr. Bin Xiao is a full professor at the Hong Kong Polytechnic University, Department of Computing. He received his Ph.D. in Computer Science from the University of Texas at Dallas, USA in 2003. He is currently an associate editor of IEEE TCC and IEEE TNSE, IEEE ComSoc distinguished lecturer, and chair of IEEE ComSoc Communications and Information Security Technical Committee (CISTC Chair). He is also a Fellow of IEEE and a Fellow of AAIA.\n\nDr. Xiao's research group is looking for Ph.D. candidates in the areas of Data Science, focusing on security and privacy, and has available post-doc and research assistant positions. Recent successful grants as PI include projects on privacy-preserving and secure authentication of decentralized identity, digital asset security based on blockchain technology, vulnerability analysis and robustness improvement of 3D point cloud models, and security assessment of decentralized finance (DeFi) protocols.\n\nThe group has also achieved several notable accomplishments, including Ph.D. graduates receiving research assistant professor offers, undergraduate students publishing papers in top conferences, and winning prizes in research competitions. Dr. Xiao is also involved in organizing conferences, including IEEE GLOBECOM 2024 - Communication & Information Systems Security Symposium (CISS).\n***** content: \n\nProf. Cao Jiannong is a renowned researcher and academician with multiple roles, including:\n\n* Otto Poon Charitable Foundation Professor in Data Science and Chair Professor of Distributed and Mobile Computing at The Hong Kong Polytechnic University (PolyU)\n* Dean of Graduate School and director of Research Institute for Artificial Intelligence of Things (RIAIoT) and Internet and Mobile Computing Lab (IMCL)\n* Member of Academia Europaea, fellow of Hong Kong Academy of Engineering Science, IEEE, China Computer Federation (CCF), and ACM distinguished member\n* Holder of 16 patents\n* Active contributor to Hong Kong local professional communities, including various advisory and committee roles\n* Researcher with multiple publications in fields like computer communications, neural networks, and distributed systems, with interests in continual learning, federated learning, and network security *****\n***** content: *****\n\nName: LI Bo\n\n* Previous positions: Postdoctoral Fellow at University of Oxford and University of Texas at Austin\n* Education: PhD from Stony Brook University, B.S. and M.S. from Ocean University of China\n* Research interests: Algorithmic Game Theory and Mechanism Design, Computational Social Choice and Fair Division, Approximation and Online Algorithms\n* Academic experience: Published in conferences and journals, PC member for conferences, journal reviewer, taught courses at The Hong Kong Polytechnic University\n***** content: Yiu Man Lung Ken received Bachelor and PhD degrees from the University of Hong Kong and is currently a professor at Hong Kong Polytechnic University, researching databases, specifically query processing on spatiotemporal and multidimensional data. *****\n***** content: *****\n\nDr. Henry C. B. Chan is an associate professor in the Department of Computing at The Hong Kong Polytechnic University. He received his B.A. and M.A. degrees from the University of Cambridge and his Ph.D. degree from the University of British Columbia. His research interests include networking/communications, cloud computing, Internet technologies, and electronic commerce. He has conducted various research projects, published papers in top-tier journals, and co-authored a textbook on e-commerce. He has received several awards, including the 2015 IEEE Computer Society Computer Science and Engineering Undergraduate Teaching Award. Under his leadership, his R&D team won a silver medal in the 38th International Exhibition of Inventions of Geneva. His students have also received many awards, including the Microsoft Imagine Cup and the Hong Kong ICT Awards.\n***** content: *****\n\n**Name:** Shan Jiang (江山)\n\n**Research Interests:**\n\n* Distributed Systems and Blockchain\n* Blockchain-based Big Data Sharing\n* Blockchain as a Service\n* Edge Computing and Mobile Blockchain\n* Non-fungible Tokens, Web 3.0, and Metaverse\n\n**Education:**\n\n* Ph.D. in Computer Science, The Hong Kong Polytechnic University (2016-2021)\n* Visiting Student, Department of Computing, Imperial College London (2018-2019)\n* B.Sc. in Computer Science and Technology, Sun Yat-sen University (2011-2015)\n\n**Academic Positions:**\n\n* Research Assistant Professor, Department of Computing, The Hong Kong Polytechnic University (2021-present)\n* Member, Research Institute for Artificial Intelligence of Things, The Hong Kong Polytechnic University (2021-present)\n* Member, Research Centre for Blockchain Technology, The Hong Kong Polytechnic University (2022-present)\n\n**Patents:**\n\n* 3 patents in China, including \"数据存储方法、装置、计算机设备及可读存储介质\" and \"电子投票方法、装置和存储介质\"\n\n**Projects & Grants:**\n\n* PI, HK$250,000, \"Distributed Resource Management for Blockchain-empowered Collaborative Edge Computing\" (2021-2023)\n* Co-PI, HK$50,821,000, \"High-performance Collaborative Edge Computing Enabling Smart City Applications: Framework and Methodologies\" (2024-2028)\n* Co-PI, HK$5,000,000, \"DM-BIM: A Blockchain-based Platform for Decentralized Management of Building Information Models\" (2023-2025)\n\n**Professional Activities:**\n\n* The 21st IEEE International Conference on Ubiquitous Intelligence and Computing (UIC 2024)\n* The 30th International Conference on Parallel and Distributed Systems (ICPADS 2024)\n* The 22nd IEEE International Conference on Dependable, Autonomic and Secure Computing (DASC 2024)\n\n**Teaching & Supervision Experiences:**\n\n* Distributed Algorithms and Protocols for Blockchains (COMP5567)\n* Wireless Networking and Mobile Computing (COMP5327)\n* Service and Cloud Computing (COMP4442)\n***** content: Professor Wenjie Li is a researcher at The Hong Kong Polytechnic University with a strong research background in natural language processing, text summarization, and social media analysis. She has received several awards and honors, including the IPM Best PhD Paper 2023: Honorable Mentions, and has published papers in top conferences such as AAAI, EMNLP, and ACL. Her research experience includes projects on knowledge-grounded neural conversation machines, reinforced reading and writing for question-focused summarization, and emotion-enhanced social conversation machines. She has also participated in various research competitions and has explored topics such as language and intelligent technology, medical dialogue generation, and information credibility modeling on social media networks. *****\n***** content: Dr. Man Ho Allen Au is a Full Professor at the Department of Computing of The Hong Kong Polytechnic University, with research interests in Information Security, Applied Cryptography, Blockchain Technology, and their applications. He has been ranked as a top scholar and scientist globally, attracting over HK$30M in research and consultancy projects. He serves as an associate editor and editorial board member for several journals and has published numerous papers in top-tier conferences and journals. He has also provided training on blockchain technology and is a member of various professional committees. *****\n***** content: The researcher has a background in heuristic search, planning, and optimization, with significant contributions to understanding search techniques and combinatorial optimization problems. *****\n***** content: Bo Yang completed his D.Phil degree at Oxford, supervised by Profs. He interned at the Augumented Reality team and is currently a researcher at the Department of Computer Science, University of Oxford. *****\n***** content: Dr. Hongxia Yang, PhD from Duke University, has published over 100 papers and holds more than 50 patents. She worked at IBM, Yahoo!, Alibaba, and ByteDance, and was an adjunct professor at Zhejiang University. *****\n***** content: *****\n\nProfessor Li Qing is a renowned researcher with a strong background in computing and engineering. He is currently the Professor and Head of Department of Computing at the Hong Kong Polytechnic University. He has previously held positions as Director of Multimedia software Engineering Research Centre (MERC) at City University of Hong Kong, and has taught at various institutions including Hong Kong University of Science and Technology, Australian National University, and others.\n\nHe has served as a consultant to Microsoft Research Asia, Motorola Global Computing and Telecommunications Division, and CSIRO in Australia. He is also a Guest Professor at USTC, Wuhan University, and Zhejiang University.\n\nProfessor Li has been an active member of various professional societies, including Steering Committee member of DASFAA, ER, ICWL, UMEDIA, and WISE Society. He has also held editorial positions in various journals, including Associate Editor of IEEE Transactions on Knowledge and Data Engineering (TKDE), ACM Transactions on Internet Technology (TOIT), and World Wide Web (Springer, Germany).\n\nHe has also been involved in organizing various international conferences, including General Co-Chair for several international conferences, Area Chair for IEEE International Conference on Data Mining (ICDM), Demo Chair for 18th International Conference on Web Engineering (ICWE), and Panel Chair for FFD'17 and other conferences.\n***** content: Zecheng is a Research Assistant Professor at The Hong Kong Polytechnic University with a Ph.D. and B.Eng. degree, focusing on blockchain security, specifically smart contract security and decentralized identity. *****\n***** content: Dr. Chen Richard Li received BSc from Nanjing University, and MSc and PhD from the City University of Hong Kong. He worked as a senior research associate and a postdoc research fellow. *****\n***** content: *****\n\n Luca Rossi is a research assistant at PolyU, focusing on PhD and postdoctoral opportunities. His current projects include applying for the Hong Kong PhD Fellowship Scheme, chairing S+SSPR 2024, and working on various research projects such as GraFix, Graph Kernel Neural Network, and GNN-LoFI. He has collaborated with researchers like E. R. Hancock, M. Musolesi, A. Torsello, and L. Bai, and has presented papers at conferences including ICPR, ICML, and ECML/PKDD. His research background includes publications on quantum Jensen-Shannon divergence kernel, attributed graph similarity, and continuous-time quantum walk kernel. He has also taught courses on deep learning, software engineering, and mathematics for computing professionals.\n***** content: Wanyu is an Assistant Professor at The Hong Kong Polytechnic University, with a Ph.D. from the University of Toronto and research experience, who has also completed marathons in Hong Kong and Toronto. *****\n***** content: *****\n\n**Name:** LI Jing Amelia\n\n**Position:** Assistant Professor at PolyU (2019-present)\n\n**Research Interests:** Natural Language Processing (NLP), Computational Social Science (CSS), Machine Learning (ML)\n\n**Research Focus:** Language representation learning, social media language understanding, conversation and social interaction modeling, robust NLP and multimodal applications\n\n**Projects:**\n\n1. Discourse Parsing for Online Conversations (Oct 2019 - Sep 2022)\n2. Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms (Jan 2021 - Dec 2023)\n3. Comment-Aware Weakly-Supervised Classification for Social Media Texts (Jan 2021 - Dec 2021)\n4. Microblog Summarization Using Conversation Structures\n\n**Academic Experience:**\n\n1. Visiting PhD at Aston University, Birmingham, UK (Jan - Apr, 2016)\n2. Visiting PhD at Northeastern University, Boston, USA (Feb - May, 2017)\n\n**Education:**\n\n1. PhD degree from [University Name] (2017)\n2. B.S. degree from [University Name] (2013)\n***** content: HUANG Xiao is an assistant professor at The Hong Kong Polytechnic University, leading the DEEP Lab, with research interests in knowledge graphs, RAG, LLM evaluation, text-to-SQL, graph neural networks, and recommender systems. *****\n***** Name: ***** \nZHANG Chengqi\n\n***** Education: ***** \n- Bachelor's degree from Fudan University in Computer Science (March 1982)\n- Master's degree by research from Jilin University in Artificial Intelligence (March 1985)\n- PhD degree from The University of Queensland in Artificial Intelligence (October 1991)\n- Doctor of Science (DSc – Higher Doctorate) from Deakin University in Artificial Intelligence (October 2002)\n\n***** Employment: ***** \n- Chair Professor of Artificial Intelligence at The Hong Kong Polytechnic University (PolyU) (September 2024)\n- Pro Vice-Chancellor (China Enterprise) at the University of Technology Sydney (UTS) (December 1, 2021 - November 30, 2025)\n- Distinguished Professor at UTS (February 27, 2017 - 2027)\n- Research Professor of Information Technology at UTS (December 14, 2001)\n\n***** Research Interests: ***** \nDistributed Artificial Intelligence and Data Mining\n\n***** Achievements and Service Roles: ***** \n- Founding Director of UTS Priority Research Centre for Quantum Computation & Intelligent Systems (QCIS)\n- Attracted research funding in excess of $16.9 million from ARC and industries\n- Member of Australian Computer Society (ACS) and IEEE Computer Society (IEEE)\n- Steering Committee of the International Conference on Knowledge Science, Engineering, and Management (2006-2014)\n- General Chair for international Conferences, including ICDM 2010, KDD 2015, and IJCAI-2024\n- Chairman of Australian Computer Society National Committee for Artificial Intelligence and IEEE Computer Society Technical Society National Committee for Artificial Intelligence\n***** content: *****\n\n**Name:** YuMax\n\n**Education:**\n\n* PhD in Computer Science, ETH Zurich, Switzerland (Supervised by Prof. Bertrand Meyer)\n* PhD in Engineering Science, Nanjing University, China (Supervised by Prof. Guoliang Zheng and Prof. Xuandong Li)\n* Bachelor in Science, Nanjing University, China\n\n**Research Experience:**\n\n* Published papers:\n\t+ A Comparison of Transformer and AR-SI Oracle For Control-CPS Software Fault Localization\n\t+ Program Repair with Repeated Learning\n\t+ Semantics-Based Code Search Using Input/Output Examples\n\t+ Easy Modelling and Verification of Unpredictable and Preemptive Interrupt-driven Systems\n\t+ Execution Enhanced Static Detection of Android Privacy Leakage Hidden by Dynamic Class Loading\n\t+ Automated Program Repair in an Integrated Development Environment\n\t+ Contract-based Program Repair without the Contracts\n\n**Collaborators:**\n\n* Shiyu Zhang\n* Wenxia Liu\n* Qixin Wang\n* Lei Bu\n* Liushan Chen\n* Minxue Pan\n* Tian Zhang\n* Carlo A. Furia\n* Bertrand Meyer\n* Xuandong Li\n* Renhe Jiang\n* Zhengzhao Chen\n* Zejun Zhang\n* Yufei Yang\n* Wenbo Luo\n* Martin Nordio\n***** content: Dr. Liu Yan's background includes recruitment for postdoc researchers, PhD students, research associates, and research assistants for three projects. Research interests include Artificial Intelligence and Robotics, and Cognitive Computing Lab. Selected publications are on Artificial Intelligence in Healthcare, Music, and EEG. *****\n***** content: *****\n\nJingcai is a Research Assistant Professor at the Department of Computing, Kowloon, Hong Kong SAR. He has a strong background in Computer Science and AI/ML with experience in research and academia. He has held positions as a Postdoctoral Research Fellow at Australia and an Associate Professor at China. He has also worked in the investment banking industry.\n\nHis research focuses on Federated Learning (FL) and has presented papers at conferences such as CVPR, IJCNN, and others. He has also co-authored papers on image-based visual perception and has taught courses on internet infrastructure and protocols, data structures, and database systems.\n\nHe has served as a senior PC for AAAI2025, a session chair for IJCAI2024, and a track chair for the 100th IEEE Vehicular Technology Conference. He has also been an Area Chair for ICML2024 and ACM-MM2024, and a Session Chair for VTC2023 Fall and ICME2022.\n***** content: *****\n\nName: Li Wenjie\n\n* Research Interests: \n  + Machine Conversion\n  + Text Summarization\n  + Question Answering\n  + Causality Mining and Reasoning in NLP\n  + Natural Language Understanding and Generation\n\n* Looking for: postdocs, research associates/assistants with good project-relevant background knowledge, deep learning programming ability, and a strong publication record.\n***** content: Yancheng Yuan is an Assistant Professor at The Hong Kong Polytechnic University. He obtained his PhD in Mathematics from National University of Singapore in 2020. His research interests are in optimization, machine learning, and data science. He has published notable works such as Semismooth Newton Based Algorithm for Convex Clustering, LAMBDA, and SIOPT. *****\n***** content: Ruijian has a strong background in statistics and machine learning, with a Ph.D. in Statistics from Hong Kong University of Science and Technology and publications in top-tier journals. He has worked on various topics, including statistical inference, pairwise comparison models, probabilistic methods, and adaptive learning recommendation strategies. *****\n***** content: Jiannong, Otto Poon Charitable Foundation Professor in Data Science, Chair Professor of Distributed and Mobile Computing, Member of Academia Europaea, Fellow of Hong Kong Academy of Engineering Science, Fellow of IEEE, Fellow of CCF, Distinguished Member of ACM *****\n***** content: Lei Zhang is a Chair Professor of Computer Vision and Image Analysis at The Hong Kong Polytechnic University, with a PhD from Northwestern Polytechnical University, and has held various academic positions since 2001, including Assistant Professor, Associate Professor, Professor, and Postdoctoral Fellow at McMaster University, Canada. *****\n***** content: Yinxin Cao, Ph.D. degree *****\n***** content: Dr. Jibin Wu is an Assistant Professor at The Hong Kong Polytechnic University, with research interests in brain-inspired artificial intelligence, neuromorphic computing, computational audition, speech processing, and machine learning. He aims to develop cutting-edge brain-inspired cognitive machines that possess exceptional intelligence, energy efficiency, robustness, adaptability, and explainability. *****\n***** content: Dr. Gao is a research assistant professor at the Hong Kong Polytechnic University, with research interests in computer security and information security, specifically applied cryptography (zero-knowledge proofs). He has taught several courses and has published papers on various topics, including arbitrarily many secrets, DoS attacks, and mining attacks in the Bitcoin system. *****\n***** content: I am an assistant professor at PolyU, researching AI Security, Adversarial Machine Learning, and Data Security and Privacy to make intelligent systems secure and trustworthy. *****\n***** content: Dr. Peter Ng is a researcher and Teaching Fellow with expertise in AI, game development, and data analysis, holding a PhD from HKPU and having completed over 30 commercial projects. *****\n***** content: *****\n\n**Name:** Binyan Jiang\n\n**Current Position:** Associate Professor, Department of Data Science and AI, The Hong Kong Polytechnic University\n\n**Research Background:**\n\n* Ph.D. in Statistics and Applied Probability, National University of Singapore (2012)\n* Bachelor's degree in Statistics, University of Science and Technology of China (2007)\n* Visiting Research Scientist, Heinz College, Carnegie Mellon University\n\n**Research Interests:**\n\n* Network data analysis\n* High-dimensional data analysis\n* Statistical machine learning\n\n**Notable Publications:**\n\n* \"Statistical inference in a directed network model with covariates\" (2019)\n* \"MARS: A second-order reduction algorithm for high-dimensional sparse precision matrices estimation\" (2023)\n* \"Penalized interaction estimation for ultrahigh dimensional quadratic regression\" (2021)\n\n**Collaborations:**\n\n* C Wang: high-dimensional sparse precision matrices estimation, ultrahigh dimensional quadratic regression, and regularized linear discriminant analysis\n* C Liu: dynamic covariance matrix estimation and portfolio analysis with high-frequency data\n* J Li: nonparametric instrument model averaging, multicategory reclassification statistics, and entropy learning for dynamic treatment regimes\n* HM Ng: penalized estimation of a class of single-index varying-coefficient models for integrative genomic analysis\n* JP Fine: multicategory reclassification statistics\n* KH Lim: online experiment with authority messages on event websites\n\n**Funding:**\n\n* HKPolyU Start-up Fund (PI), 2015-2018, HK$350,000\n* RGC Early Career Scheme (PI), 2017-2019, HK$459,423\n* NSFC Young Scientist Fund (PI), 2017-2019, 240,000RMB\n* RGC General Research Fund (PI), 2023-2025, HK$661,000\n***** content: *****\n\nWang Dan is a Professor at the Department of Computing, The Hong Kong Polytechnic University. He has a background in Computer Science from Peking University (B.Sc), Case Western Reserve University (M.Sc), and Simon Fraser University (Ph.D.). His research interests include Network Architecture and QoS, Smart Building (Big Data study), and Industry 4.0. He has received several awards, including ACM Distinguished Scientist 2023, Best paper award, and Outstanding Scientific Research Awards. He has served as a TPC member, Steering committee chair, Advisor, and General co-Chair for various conferences and organizations.\n***** content: Dr. Ping Li is an expert in Vision, AI, Graphics, and Creative Media with numerous awards and honors, including National Distinguished Young Expert, China (2020), and Best Paper Award at IEEE PIC (2018). He has also held various chair and speaker positions at conferences and is a member of the AIE-AR Team that won the Highly Commended Team Award at ALT Learning Technologist of the Year Awards (2019). *****\n***** content: *****\n\nWenqi Fan is a researcher with a strong academic foundation and extensive research experience. He received his Ph.D. degree in computer science from the City University of Hong Kong and was a research scholar at Michigan State University. He has published papers in top-tier venues, including NeurIPS, KDD, WWW, IJCAI, and ICML, and has received awards such as the SDM2020 Student Travel Award. His research interests are in the areas of recommender systems, graph neural networks, and fairness. He has collaborated with many other researchers on various projects and has published papers in various conferences and journals.\n***** content: Yuanqing Zheng is an associate professor at the Hong Kong Polytechnic University. He received his Ph.D. in Computer Science from Nanyang Technological University and has research interests in Wireless Networking and Mobile Computing, Acoustic and RF Sensing, and Internet of Things (IoT). *****\n***** content: Michel Raynal is an emeritus professor at IRISA, University of Rennes, France, and a senior member of the “Institut Universitaire de France” and “Academia Europaea”. *****\n***** content: Haoyang Li is a researcher with experience in systems, specifically in graph neural networks and knowledge base population, holding roles such as Assistant Professor, PC membership, and reviewer for top-tier journals and conferences. *****\n",
    "research interest": "***** content: *****\n\n1. XIAOBin: Data Science, AI security, Database security and privacy, Web3 (DID) and Blockchain Systems.\n\n2. Cao Jiannong: Distributed systems and blockchain, wireless sensing and networking, big data and machine learning, and mobile cloud and edge computing.\n\n3. LI Bo: Algorithmic Game Theory and Mechanism Design, Computational Social Choice and Fair Division, Approximation and Online Algorithms.\n\n4. Yiu Man Lung Ken: Databases, query processing, spatiotemporal data, multidimensional data.\n\n5. ChunBunHenry: Networking/communications, cloud computing, Internet technologies, and electronic commerce.\n\n6. Shan: Distributed Systems and Blockchain, Blockchain-based Big Data Sharing, Blockchain as a Service, Edge Computing and Mobile Blockchain.\n\n7. Maggie: Machine Conversion, Text Summarization, Question Answering, Causality Mining and Reasoning in NLP, Natural Language Understanding and Generation.\n\n8. Dr Man Ho Allen Au: Information security, Applied Cryptography, Blockchain Technology.\n\n9. Zhang Weixiong: Molecular/Cellular Biology, Genetics/Genomics, Multi-omic disease study, Big data analytics and AI.\n\n10. Bo: Machine learning, Computer vision, Robotics, 3D world interaction and recognition.\n\n11. YANGHongxia: Ultra-Large Scale High-Performance Graph Neural Network Computing Platform and Its Applications, Large-Scale Graph Neural Network Edge-Cloud Collaborative Computing Platform and Application Demonstration.\n\n12. LIQing: Multi-modal data management, Data warehousing and mining, Social media and Web services, and e-Learning Technologies.\n\n13. Zecheng: Smart Contract Security, Decentralized Identity.\n\n14. Chen Richard: Technology-assisted solutions for supporting people in their daily lives.\n\n15. ROSSI_Luca: No research interests found.\n\n16. Wanyu: AI for science, machine learning techniques for accelerating scientific simulations and design.\n\n17. HUANG Xiao: Knowledge graphs, retrieval-augmented generation (RAG) for LLMs, graph RAG, LLM evaluation, text-to-SQL, graph neural networks, and recommender systems.\n\n18. ZHANGChengqi: Distributed Artificial Intelligence and Data Mining.\n\n19. YuMax: Automated Program Repair, Automated Software Testing, Software Fault Localization, Mining Software Repositories.\n\n20. YanFiona: Machine learning models, deep learning and transfer learning models, and their applications in robotics.\n\n21. Jingcai: Low-shot AI, learning/modeling with limited resources in terms of data, computing capability, and their derivative applications.\n\n22. li wenjie: Machine Conversion, Text Summarization, Question Answering, Causality Mining and Reasoning in NLP, Natural Language Understanding and Generation.\n\n23. Yancheng: No research interests found.\n\n24. Ruijian: High-dimensional statistics, statistical machine learning, online inference and reinforcement learning.\n\n25. Jiannong: No research interests found.\n\n26. LeiJohn: Visual Computing Lab, Y learning and beyond: for future visual enhancement and understanding.\n\n27. yinxin cao: Algorithms in graph theory, theoretical computer science, fine-grained complexity, algorithm design, combinatorial optimization, social networks and bioinformatics applications.\n\n28. Jibin: Brain-inspired artificial intelligence, neuromorphic computing, computational audition, speech processing, and machine learning.\n\n29. Shang: Applied cryptography (zero-knowledge proofs).\n\n30. Kai: AI Security, Adversarial Machine Learning, and Adversarial Network Analysis, Data Security and Privacy.\n\n31. Peter: Artificial intelligence and game development.\n\n32. Binyan: Network data analysis, high-dimensional data analysis, and statistical machine learning.\n\n33. WANGDan: Network Architecture and QoS, Smart Building (a Big Data study), Industry 4.0, Data-driven applications and platforms for cyber-physical energy systems.\n\n34. Ping: Vision, AI, Graphics, Creative Media.\n\n35. Wenqi: Recommender Systems (RecSys) and Management Information Systems (MIS), Large Language Models (LLMs), Trustworthy AI, Graph Machine Learning.\n\n36. Yuanqing: Wireless Networking and Mobile Computing, Acoustic and RF Sensing, Internet of Things (IoT).\n\n37. RAYNAL_Michel: No research interests found.\n\n38.Haoyang: Data Management for Machine Learning, Data-driven Machine Learning, Data and Model Security, Large Language Models, Graph Neural Networks and Knowledge Bases.\n39.LI Jing Amelia: Pre-training and Language Representation Learning, Natural Language Understanding (NLU) for Social Media Contents, Large Language Models and Embodied Agents, Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms, Discourse Parsing for Online Conversations, Comment-Aware Weakly-Supervised Classification for Social Media Texts.",
    "publication": "Here is the extracted core content:\n\n**Name:** XIAOBin\n**Title:** Dr. Bin Xiao (肖斌) - Full Professor at Hong Kong Polytechnic University\n**Published Time:** \n- B.Sc and M.Sc degrees in the Electronics Engineering from Fudan University, China, 2003\n- Ph.D. degree in Computer Science from University of Texas at Dallas, USA, 2003\n**Conference of Researcher's Publications:** \n- IEEE GLOBECOM 2024 -Communication & Information Systems Security Symposium (CISS)\n- IEEE ICDCS 2022 -Security, Privacy, and Trust in Distributed Systems\n- IEEE TNSE special issue -Security and Privacy for AI Models and Applications (x2)\n- IEEE SECON 2018\n- IEEE ICC 2018 ***** Researcher's Name: ***** \nCao Jiannong\n\n***** Publication 1: *****\nTitle: Distributed Semi-Supervised Learning with Consensus Consistency on Edge Devices\nPublished Time: December 2023\nConference: IEEE Transactions on Parallel and Distributed Systems (Early Access)\n\n***** Publication 2: *****\nTitle: SHARON: Secure and Efficient Cross-shard Transaction Processing via Shard Rotation\nPublished Time: 20-23 May 2024\nConference: IEEE International Conference on Computer Communications (INFOCOM 2024)\n\n***** Publication 3: *****\nTitle: AdaptCL: Adaptive Continual Learning for Tackling Heterogeneity in Sequential Datasets\nPublished Time: December 2023\nConference: IEEE Transactions on Neural Network and Learning Systems (Early Access)\n\n***** Publication 4: *****\nTitle: Building a Lightweight Trusted Execution Environment for Arm GPUs\nPublished Time: November 2023\nConference: IEEE Transactions on Dependable and Secure Computing (Early Access)\n\n***** Publication 5: *****\nTitle: Bayes-enhanced Multi-view Attention Networks for Robust POI Recommendation\nPublished Time: October 2023\nConference: IEEE Transactions on Knowledge and Data Engineering (Early Access)\n\n***** Publication 6: *****\nTitle: Neural Abstractive Summarization for Long Text and Multiple Tables\nPublished Time: September 2023\nConference: IEEE Transactions on Knowledge and Data Engineering (Early Access)\n\n***** Publication 7: *****\nTitle: CAGE: Complementing Arm CCA with GPU Extensions\nPublished Time: 26 Feb - 1 Mar 2024\nConference: The Network and Distributed System Security Symposium (NDSS)\n\n***** Publication 8: *****\nTitle: Heterogeneity-aware Cross-school Electives Recommendation: a Hybrid Federated Approach\nPublished Time: 1-4 December 2023\nConference: The 2023 IEEE International Conference on Data Mining GML4Rec workshop\n\n***** Publication 9: *****\nTitle: Privacy-preserving and Efficient Data Sharing for Blockchain-based Intelligent Transportation Systems\nPublished Time: No Published Time\nConference: Information Sciences, Volume 635, Pages 72-85\n\n***** Publication 10: *****\nTitle: Personalized Federated Learning on Non-IID Data via Group-Based Meta-Learning\nPublished Time: No Published Time\nConference: ACM Transactions on Knowledge Discovery from Data (TKDD), 17(4), 1-20 2023\n\n***** ***** content: *****\n\n**Name:** LI Bo\n\n**Recent Publications:**\n\n1. **Title:** Fair Division of Indivisible Goods: Recent Progress and Open Questions\n**Published Time:** 2023\n**Conference:** Artificial Intelligence\n\n2. **Title:** Your College Dorm and Dormmates: Fair Resource Sharing with Externailties\n**Published Time:** 2023\n**Conference:** Journal of Artificial Intelligence Research\n\n3. **Title:** Maximal Information Propagation via Lotteries\n**Published Time:** 2023\n**Conference:** Blockchain\n\n4. **Title:** Well-behaved Online Load Balancing Against Strategic Jobs\n**Published Time:** 2022\n**Conference:** Journal of Scheduling\n\n5. **Title:** Approximate and Strategyproof Maximin Share Allocation of Chores with Ordinal Preferences\n**Published Time:** 2022\n**Conference:** Mathematical Programming\n\n6. **Title:** Bayesian Auctions with Efficient Queries\n**Published Time:** 2022\n**Conference:** Artificial Intelligence\n\n7. **Title:** Fair Allocation of Combinatorial Tasks: Beyond Additive Costs\n**Published Time:** 2023\n**Conference:** NeurIPS\n\n8. **Title:** On Hill’s Worst-Case Guarantee for Indivisible Bads\n**Published Time:** 2023\n**Conference:** WINE\n\n9. **Title:** Prophet Inequality on I.I.D. Distributions: Beating 1-1/e with a Single Query\n**Published Time:** 2023\n**Conference:** WINE\n\n10. **Title:** On the Price of Fairness in Discrete Cake Cutting Problems\n**Published Time:** 2023\n**Conference:** ECAI\n\n11. **Title:** Eliciting Information with Partial Signals in Repeated Games\n**Published Time:** 2023\n**Conference:** IJTCS\n\n12. **Title:** Possible Fairness for Allocating Indivisible Resource\n**Published Time:** 2023\n**Conference:** IJTCS\n\n13. **Title:** Possible Fairness for Allocating Indivisible Resource\n**Published Time:** 2023\n**Conference:** AAMAS\n\n14. **Title:** Approximation Algorithm for Computing Budget-Feasible EF1 Allocations\n**Published Time:** 2023\n**Conference:** AAMAS\n\n15. **Title:** Proportional Fairness in Obnoxious Facility Location (Extended Abstract)\n** ***** Researcher's Name: ***** Yiu Man Lung Ken\n\n***** Publications: *****\n\n1. ***** Title: ***** Fast Error-Bounded Distance Distribution Computation\n***** Published Time: ***** November 2022\n***** Conference: ***** IEEE Transactions on Knowledge and Data Engineering (TKDE)\n\n2. ***** Title: ***** Efficient Algorithms for Kernel Aggregation Queries\n***** Published Time: ***** June 2022\n***** Conference: ***** IEEE Transactions on Knowledge and Data Engineering (TKDE)\n\n3. ***** Title: ***** On Discovering Motifs and Frequent Patterns in Spatial Trajectories with Discrete Frechet Distance\n***** Published Time: ***** January 2022\n***** Conference: ***** GeoInformatica\n\n4. ***** Title: ***** Client-side Service for Recommending Rewarding Routes to Mobile Crowdsourcing Workers\n***** Published Time: ***** November/December 2021\n***** Conference: ***** IEEE Transactions on Services Computing (TSC)\n\n5. ***** Title: ***** The Power of Bounds: Answering Approximate Earth Mover's Distance with Parametric Bounds\n***** Published Time: ***** February 2021\n***** Conference: ***** IEEE Transactions on Knowledge and Data Engineering (TKDE) ***** Researcher's Name: ***** \nH.C.B. Chan \n\n***** Title: ***** \nH.C.B. Chan's Selected Publications \n\n***** Published Time: ***** \n• Aug. 2013\n• Nov. 2013\n• Jun. 2013\n• Feb. 2010\n• Feb. 2010\n• Nov. 2007\n• Apr. 2007\n• Sept. 2004\n• Apr. 2004\n• Feb. 2001\n• Jun. 1999\n\n***** Conference of Researcher's Publications: ***** \n• IEEE Journal on Selected Areas in Communications\n• IEEE Transactions on Communications\n• IEEE Transactions on Emerging Topics in Computing\n• Expert Systems with Applications\n• IEEE Transactions on Mobile Computing\n• IEEE Transactions on Vehicular Technology\n• IEEE Transactions on Systems, Man, and Cybernetics\n• IEEE Transactions on Wireless Communications\n• IEEE Computer\n• IEEE Transactions on Parallel and Distributed Systems\n• The Computer Journal\n• Journal of Systems and Software\n• Computer Communications\n• IEEE Transactions on Circuits and Systems for Video Technology ***** Researcher's Name: ***** Shan\n\n***** Publications: *****\n\n***** Title: ***** 数据存储方法、装置、计算机设备及可读存储介质\n***** Published Time: ***** 2020年6月公布（已授权）\n***** Published by: ***** 华为技术有限公司\n***** Patent Number: ***** CN111224793A\n\n***** Title: ***** 电子投票方法、装置和存储介质\n***** Published Time: ***** 2020年6月公布（已授权）\n***** Published by: ***** 华为技术有限公司\n***** Patent Number: ***** CN111292461A\n\n***** Title: ***** 跨链交易方法、装置、多区块链系统及计算设备\n***** Published Time: ***** 2021年2月公布\n***** Published by: ***** 阿里巴巴集团控股有限公司\n***** Patent Number: ***** CN112348672A\n\n***** Presentations: *****\n\n***** Title: ***** Peer to Peer Networking & High-performance Blockchain Consensus\n***** Published Time: ***** Jan 2024\n***** Conference: ***** Polkadot Blockchain Academy (Hong Kong, China)\n\n***** Title: ***** 数据要素流通技术：平台、进展与未来展望\n***** Published Time: ***** Nov 2023\n***** Conference: ***** CCF YOCSEF技术论坛——数据要素市场化配置，路在何方 (Harbin, China)\n\n***** Title: ***** Decentralized Data Infrastructure for Web3: Current Progress and Future Directions\n***** Published Time: ***** Aug 2023\n***** Conference: ***** Guilin University of Electronic Technology (Guilin, China)\n\n***** Title: ***** Blockchain-based Big Data Sharing and Trading\n***** Published Time: ***** Jun 2023\n***** Conference: ***** 区块链推动龙江数字经济发展高级研修班 (Harbin, China)\n\n***** Title: ***** Web3论剑：区块链的学术成果研讨\n***** Published Time: ***** May 2023\n***** Conference: ***** Hong Kong Web3 Festival 2023 (Hong Kong, China)\n\n***** Title: ***** Artificial Intelligence of Things for Large Aircrafts\n***** Published Time: ***** Mar 2023\n***** Conference: ***** COMAC 6th International Innovation Week (Jiaxing, China)\n\n***** Title: ***** Blockchain-empowered Big Data Sharing: Challenges and Opportunities\n***** Published Time: ***** ***** content: *****\n\nMaggie \n\nResearch Position Opening\nOctober 26, 2024\nNot specified\n\n Publication Awards\nSeptember 20, 2024\nEMNLP2024\n\n Publication Awards\nJuly 20, 2024\nMM2024\n\n Publication Awards\nMay 16, 2024\nACL2024\n\n Publication Awards\nOctober 7, 2023\nAAAI2024\n\n Publication Awards\nOctober 7, 2023\nEMNLP2023\n\n Publication Awards\nSeptember 22, 2023\nNeurIPS2023\n\n Publication Awards\nMay 2, 2023\nACL2023 ***** Researcher's Name: ***** Dr. Man Ho Allen Au\n\n***** Title: ***** Dr. Man Ho Allen Au - Researcher Profile\n\n***** Published Time: ***** Not specified\n\n***** Conference: ***** \n- The Hong Kong Polytechnic University (Department of Computing)\n- University of Hong Kong (Department of Computer Science)\n\n***** Research Publications: ***** \n\n1. ***** Title: ***** Electronic Cash for Mobile Payment\n***** Published Time: ***** 2021\n***** Conference: ***** IEEE Transactions on Mobile Computing\n\n2. ***** Title: ***** Toward A Blockchain-based Framework For Challenge-based Collaborative Intrusion Detection\n***** Published Time: ***** 2021\n***** Conference: ***** International Journal of Information Security\n\n3. ***** Title: ***** A Fog-based Collaborative Intrusion Detection Framework For Smart Grid\n***** Published Time: ***** 2021\n***** Conference: ***** International Journal of Network Management\n\n4. ***** Title: ***** Enabling Secure and Efficient Decentralized Storage Auditing with Blockchain\n***** Published Time: ***** 2021\n***** Conference: ***** IEEE Transactions on Dependable and Secure Computing\n\n5. ***** Title: ***** LF-GDPR: A Framework for Estimating Graph Metrics with Local Differential Privacy\n***** Published Time: ***** 2020\n***** Conference: ***** IEEE Transactions on Knowledge and Data Engineering\n\n6. ***** Title: ***** Detecting insider attacks in medical cyber-physical networks based on behavioral profiling\n***** Published Time: ***** 2020\n***** Conference: ***** Future Generation Computer Systems\n\n7. ***** Title: ***** Enhancing collaborative intrusion detection via disagreement-based semi-supervised learning in IoT environments\n***** Published Time: ***** 2020\n***** Conference: ***** Journal of Network and Computer Applications\n\n8. ***** Title: ***** Efficient Message Authentication with Revocation Transparency Using Blockchain for Vehicular Networks\n***** Published Time: ***** 2020\n***** Conference: ***** Computers & Electrical Engineering\n\n9. ***** Title: ***** Geometric range search on encrypted data with Forward/Backward security\n***** Published Time: ***** 2020\n***** Conference: ***** IEEE Transactions on Dependable and Secure Computing\n\n10. ***** Title: ***** Towards Blockchain-Based Software-Defined Networking: Security Challenges and Solutions\n***** Published Time: ***** 2020\n***** Conference: ***** IEICE Transactions on Information and Systems Since there is no text provided other than the name \"Zhang Weixiong\", I will output the name as per the instruction.\n\n***** Name: ***** Zhang Weixiong\n\nThere is no title, published time, or conference information to extract. If you provide the text, I'll be happy to help! ***** Researcher's Name: ***** Bo \n\n***** Accepted Publications: *****\n\n***** Title: ***** Advances in Neural Information Processing Systems (NeurIPS) \n***** Published Time: ***** 2023 \n***** Conference: ***** NeurIPS 2023, TPAMI 2024, ICML 2024, CVPR 2023, ECCV 2022, ICCV 2021 \n\n***** Title: ***** Unsupervised 3D Object Segmentation Method on Point Clouds\n***** Published Time: ***** 2022 \n***** Conference: ***** ECCV 2022 \n\n***** Title: ***** Unsupervised 3D Semantic Segmentation Method\n***** Published Time: ***** 2023 \n***** Conference: ***** CVPR 2023 \n\n***** Title: ***** Novel Ray-Based 3D Shape Representation\n***** Published Time: ***** 2023 \n***** Conference: ***** NeurIPS 2023 \n\n***** Title: ***** Novel Framework to Simultaneously Learn Geometry, Appearance, and Physical Velocity of 3D Scenes\n***** Published Time: ***** 2023 \n***** Conference: ***** NeurIPS 2023 \n\n***** Title: ***** First Framework to Represent Dynamic 3D Scenes in Infinitely Many Ways from a Monocular RGB Video\n***** Published Time: ***** 2024 \n***** Conference: ***** TPAMI 2024 \n\n***** Title: ***** Accepted by ICCV 2021\n***** Published Time: ***** 2021 \n***** Conference: ***** ICCV 2021 \n\n***** Title: ***** Accepted by IJCV\n***** Published Time: ***** Not specified \n***** Conference: ***** IJCV \n\n***** Title: ***** Accepted by TPAMI\n***** Published Time: ***** Not specified \n***** Conference: ***** TPAMI \n\n***** Title: ***** Accepted by NeurIPS 2022\n***** Published Time: ***** 2022 \n***** Conference: ***** NeurIPS 2022 \n\n***** Title: ***** Accepted by ECCV 2022\n***** Published Time: ***** 2022 \n***** Conference: ***** ECCV 2022 ***** Researcher's Name: ***** YANG Hongxia\n\n***** Title: ***** Dr. Hongxia Yang - Researcher\n\n***** Published Papers: *****\n1. ***** Title: ***** InfiBench: Evaluating the Question-Answering Capabilities of Code Large Language Models\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS\n\n2. ***** Title: ***** DreamClear: High-Capacity Real-World Image Restoration with Privacy-Safe Dataset Curation\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS\n\n3. ***** Title: ***** Visual Anchors Are Strong Information Aggregators For Multimodal Large Language Model\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS\n\n4. ***** Title: ***** Empowering Large Language Model Agents through Action Learning\n***** Published Time: ***** 2024\n***** Conference: ***** COLM\n\n5. ***** Title: ***** An Expert is Worth One Token: Synergizing Multiple Expert LLMs as Generalist via Expert Token Routing\n***** Published Time: ***** 2024\n***** Conference: ***** ACL\n\n6. ***** Title: ***** DeVAn: Dense Video Annotation for Video-Language Models\n***** Published Time: ***** 2024\n***** Conference: ***** ACL\n\n7. ***** Title: ***** Expedited Training of Visual Conditioned Language Generation via Redundancy Reduction\n***** Published Time: ***** 2024\n***** Conference: ***** ACL\n\n8. ***** Title: ***** InfiMM: Advancing Multimodal Understanding with an Open-Sourced Visual Language Model\n***** Published Time: ***** 2024\n***** Conference: ***** ACL\n\n9. ***** Title: ***** LoraRetriever: Input-Aware LoRA Retrieval and Composition for Mixed Tasks in the Wild\n***** Published Time: ***** 2024\n***** Conference: ***** ACL\n\n10. ***** Title: ***** Two Stones Hit One Bird: Bilevel Positional Encoding for Better Length Extrapolation\n***** Published Time: ***** 2024\n***** Conference: ***** ICML\n\n11. ***** Title: ***** Self-Infilling Code Generation\n***** Published Time: ***** 2024\n***** Conference: ***** ICML\n\n12. ***** Title: ***** InfiAgent-DABench: Evaluating Agents on Data Analysis Tasks\n***** Published Time: ***** 2024\n***** Conference: ***** ICML\n\n13. ***** Title: ***** $\\mathcal ***** Researcher's Name: ***** LI Qing\n\n***** Title: ***** Prof. Qing Li's Publications and Editorial Services\n\n***** Published Time: ***** 2024-03-09\n\n***** Conference of Researcher's Publication: *****\nIEEE Transactions on Artificial Intelligence (TAI)\nIEEE Transactions on Cognitive and Developmental Systems (TCDS)\nIEEE Transactions on Knowledge and Data Engineering (TKDE)\nACM Transactions on Internet Technology (TOIT)\nWorld Wide Web (Springer, Germany)\nData Science & Engineering (Springer)\nInternational Journal of Distance Education Technology (Idea Group Pub., USA)\nJournal of Web Engineering (Rinton Press, Princeton, USA)\nJournal of Applied Science and Engineering (Tamkang University Press, Taiwan)\nWISE Book Series: Web Information\n... (other publications)\n\n***** Conference Services: *****\nConference General Co-Chair, the 5th IEEE International Conference on Data Science in Cyberspace (IEEE DSC'20)\nConference General Co-Chair, The 20th International Conference of Web Information Systems Engineering (WISE'19)\nConference General Co-Chair, The 2nd Joint International Conference of APWeb-WAIM (APWeb-WAIM'18)\nArea Chair of 18th IEEE International Conference on Data Mining (ICDM 2018)\nDemo Chair of 18th International Conference on Web Engineering (ICWE 2018)\n... (other conference services) ***** content: *****\n\nZecheng Li\n\n1. **Enabling Privacy-Preserving and Efficient Authenticated Graph Queries on Blockchain-Assisted Clouds**\n   - Published Time: 2023\n   - Conference: IEEE Transactions on Knowledge and Data Engineering (TKDE)\n\n2. **Securing Deployed Smart Contracts and DeFi with Distributed TEE Cluster**\n   - Published Time: 2023\n   - Conference: IEEE Transactions on Parallel and Distributed Systems (TPDS)\n\n3. **Abnormal Traffic Detection: Traffic Feature Extraction and DAE-GAN With Efficient Data Augmentation**\n   - Published Time: 2022\n   - Conference: IEEE Transactions on Reliability (TR)\n\n4. **SolSaviour: A Defending Framework for Deployed Defective Smart Contracts**\n   - Published Time: 2021\n   - Conference: Proceedings of the 37th Annual Computer Security Applications Conference (ACSAC)\n\n5. **Pistis: Issuing Trusted and Authorized Certificates With Distributed Ledger and TEE**\n   - Published Time: 2021\n   - Conference: IEEE Transactions on Parallel and Distributed Systems (TPDS) Here is the extracted core content:\n\n**Researcher's Name:** Chen Richard is not the researcher's name, the text actually does not mention the researcher's name as Chen Richard, but rather mentions \"Dr. Li\" as the researcher. Therefore, \n Researcher's Name: Dr. Li\n\n**Title:** content: Dr. Li's Research Interests and Publications\n\n**Published Time:** content: Not available\n\n**Conference:** content: Collaborating with talents from various backgrounds to design new technology-assisted solutions for supporting people in their daily lives, Use of virtual reality for children with special educational needs. ***** Researcher's Name: ***** \nROSSI_Luca\n\n***** News & Upcoming Events: ***** \n• I will be chairing S+SSPR 2024in Venice (Italy) on 9-10 September 2024.\n• GraFix: A Graph Transformer with Fixed Attention based on the WL Kernelhas been accepted toICPR 2024.\n• Graph Kernel Neural Networkshas been accepted for publication on the journalIEEE Transactions on Neural Networks and Learning Systems.\n• Graph neural networks in vision-language image understanding: a surveyhas been accepted for publication on the journalThe Visual Computer.\n\n***** Journals: ***** \n• L. Cosmo, G. Minello, M. Bronstein, E. Rodolà,L. Rossiand A. Torsello,Graph Kernel Neural Networks,IEEE Transactions on Neural Networks and Learning Systems, 2024.\n• H. Senior, G. Slabaugh, S. Yuan andL. Rossi,Graph neural networks in vision-language image understanding: a survey,The Visual Computer, 2024.\n• A. Bicciato, L. Cosmo, G. Minello,L. Rossiand A. Torsello,GNN-LoFI: A novel graph neural network through localized feature-based histogram intersection,Pattern Recognition, 2024.\n\n***** Conferences: ***** \n• L. Rossi, A. Torsello, and M. Musolesi, Spatio-Temporal Techniques for User Identification by means of GPS Mobility Data, EPJ Data Science, 4(1), 1-16, 2015.\n• L. Rossi, A. Torsello, and E. R. Hancock, Unfolding Kernel Embeddings of Graphs: Enhancing Class Separation through Manifold Learning, Pattern Recognition, 2015.\n• L. Rossi, A. Torsello, and E. R. Hancock, Measuring Graph Similarity through Continuous-Time Quantum Walks and the Quantum Jensen-Shannon Divergence, Physical Review E, 2015.\n• L. Bai, L. Rossi, E. R. Hancock, and A. Torsello, A Quantum Jensen-Shannon Graph Kernel for Unattributed Graphs, Pattern Recognition, 2014\n• L. Rossi and A. Torsello, Coarse-to-Fine Skeleton Extraction for High Resolution 3D Meshes, Computer Vision and Image Understanding, 118:140- ***** Researcher's Name: ***** Wanyu Lin\n\n***** Publications: *****\n\n1. ***** Title: ***** Robust Graph Meta Learning via Manifold Calibration with Proxy Subgraphs\n***** Published Time: ***** 2023\n***** Conference: ***** Proceedings of the 2023 Conference on Association for the Advancement of Artificial Intelligence (AAAI)\n\n2. ***** Title: ***** Towards Private Learning on Decentralized Graphs with Local Differential Privacy\n***** Published Time: ***** 2022\n***** Conference: ***** IEEE Transactions on Information Forensics & Security (TIFS)\n\n3. ***** Title: ***** Orphicx: A Causality-Inspired Latent Variable Model for Interpreting Graph Neural Networks\n***** Published Time: ***** 2022\n***** Conference: ***** Proceedings of the 2022 IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2022)\n\n4. ***** Title: ***** Status-Aware Signed Heterogeneous Network Embedding with Graph Neural Networks\n***** Published Time: ***** 2022\n***** Conference: ***** IEEE Transactions on Neural Networks and Learning Systems (TNNLS)\n\n5. ***** Title: ***** Generative Causal Explanations for Graph Neural Networks\n***** Published Time: ***** 2021\n***** Conference: ***** Proceedings of the 38th International Conference on Machine Learning (ICML 2021)\n\n6. ***** Title: ***** Medley: Predicting Social Trust in Time-Varying Online Social Networks\n***** Published Time: ***** 2021\n***** Conference: ***** Proceedings of IEEE INFOCOM 2021\n\n7. ***** Title: ***** Privacy-Preserving Similarity Search with Efficient Updates in Distributed Key-Value Stores\n***** Published Time: ***** 2021\n***** Conference: ***** IEEE Transactions on Parallel and Distributed Systems\n\n8. ***** Title: ***** Guardian: Evaluating Trust in Online Social Networks with Graph Convolutional Networks\n***** Published Time: ***** 2020\n***** Conference: ***** Proceedings of IEEE INFOCOM\n\n9. ***** Title: ***** Shoestring: Graph-Based Semi-Supervised Classification with Severely Limited Labeled Data\n***** Published Time: ***** 2020\n***** Conference: ***** Proceedings of the 2020 IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2020)\n\n10. ***** Title: ***** Adversarial Attacks on Link Prediction Algorithms Based on Graph Neural Networks\n***** Published Time: ***** 2020\n***** Conference: ***** Proceedings of the  ***** LI Jing Amelia's Publications: *****\n\n1. **BeLLM: Backward Dependency Enhanced Large Language Model for Sentence Embeddings**\n   Published Time: NAACL 2024\n   Conference: NAACL 2024\n\n2. **PopALM: Popularity-Aligned Language Models for Social Media Trendy Response Prediction**\n   Published Time: LREC-COLING 2024\n   Conference: LREC-COLING 2024\n\n3. **HICL: Hashtag-Driven In-Context Learning for Social Media Natural Language Understanding**\n   Published Time: TNNLS 2024\n   Conference: TNNLS 2024\n\n4. **VIBE: Topic-Driven Temporal Adaptation for Twitter Classification**\n   Published Time: EMNLP 2023\n   Conference: EMNLP 2023\n\n5. **InfoDiffusion: Information Entropy Aware Diffusion Process for Non-Autoregressive Text Generation**\n   Published Time: EMNLP 2023 (Findings)\n   Conference: EMNLP 2023\n\n6. **Topic-Guided Self-Introduction Generation for Social Media Users**\n   Published Time: ACL 2023 (Findings)\n   Conference: ACL 2023\n\n7. **Rethinking Attention-Model Explainability through Faithfulness Violation Test**\n   Published Time: ICML 2022\n   Conference: ICML 2022\n\n8. **An Extensive Study on Pre-trained Models for Program Understanding and Generation**\n   Published Time: ISSTA 2022\n   Conference: ISSTA 2022\n\n9. **Borrowing Human Senses: Comment-Aware Self-Training for Social Media Multimodal Classification**\n   Published Time: EMNLP 2022\n   Conference: EMNLP 2022\n\n10. **Understanding Social Media Cross-Modality Discourse in Linguistic Space**\n    Published Time: EMNLP 2022 (Findings)\n    Conference: EMNLP 2022\n\n11. **A Fine-grained Chinese Software Privacy Policy Dataset for Sequence Labeling and Regulation Compliant Identification**\n    Published Time: EMNLP 2022\n    Conference: EMNLP 2022\n\n12. **Doctor Recommendation in Online Health Forums via Expertise Learning**\n    Published Time: ACL 2022\n    Conference: ACL 2022\n\n13. **Successful New-entry Prediction for Multi- ***** Researcher's Name: ***** HUANG Xiao\n\n***** Publications: *****\n\n1. ***** Title: ***** KnowGPT: Knowledge Graph based PrompTing for Large Language Models\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS 2024\n\n2. ***** Title: ***** CLR-Bench: Evaluating Large Language Models in College-level Reasoning\n***** Published Time: ***** 2024\n***** Conference: ***** arXiv preprint arXiv:2410.17558\n\n3. ***** Title: ***** Cost-efficient Knowledge-based Question Answering with Large Language Models\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS 2024\n\n4. ***** Title: ***** Entity Alignment with Noisy Annotations from Large Language Models\n***** Published Time: ***** 2024\n***** Conference: ***** NeurIPS 2024\n\n5. ***** Title: ***** Modality-Aware Integration with Large Language Models for Knowledge-based Visual Question Answering\n***** Published Time: ***** 2024\n***** Conference: ***** ACL 2024\n\n6. ***** Title: ***** Enhancing Explainable Rating Prediction through Annotated Macro Concept\n***** Published Time: ***** 2024\n***** Conference: ***** ACL 2024\n\n7. ***** Title: ***** Knowledge-to-SQL: Enhancing SQL Generation with Data Expert LLM\n***** Published Time: ***** 2024\n***** Conference: ***** ACL (Findings) 2024\n\n8. ***** Title: ***** QUEST: Efficient Extreme Multi-Label Text Classification with Large Language Models on Commodity Hardware\n***** Published Time: ***** 2024\n***** Conference: ***** EMNLP (Findings) 2024\n\n9. ***** Title: ***** Next-Generation Database Interfaces: A Survey of LLM-based Text-to-SQL\n***** Published Time: ***** 2024\n***** Conference: ***** arXiv preprint arXiv.2406.08426\n\n10. ***** Title: ***** Structure Guided Large Language Model for SQL Generation\n***** Published Time: ***** 2024\n***** Conference: ***** arXiv preprint arXiv:2402.13284\n\n11. ***** Title: ***** In-Context Exploiter for Extensive-Form Games\n***** Published Time: ***** 2024\n***** Conference: ***** arXiv preprint arXiv:2408.05575\n\n12. ***** Title: ***** Different Here is the extracted core content:\n\n***** Researcher's Name: ***** ZHANG Chengqi\n\n***** Title: ***** Professor Zhang's Biography\n\n***** Published Time: ***** 01/10/2024\n\n***** Conference of Researcher's Publication: *****\n- NSW Science and Engineering Award (2011)\n- Vice-Chancellor's Award\n- Australian Computer Society Fellowship\n- IEEE Computer Society Senior Membership\n- ARC College of Experts (2012-2014)\n- International Conference on Knowledge Science, Engineering, and Management Steering Committee Chair (2006-2014)\n- IEEE Transactions on Knowledge and Data Engineering Associate Editor (2005-2008)\n- ICDM 2010 General Chair\n- KDD 2015 General Chair\n- IJCAI-2024 General Chair\n- IJCAI Sponsorship Officer (2018-2023) ***** Researcher's Name: ***** \nYu Pei \n\n***** Publication 1: ***** \nTitle: Effective Unit Test Generation for Android Apps\nPublished Time: 2024\nConference: ICSME 2024 Industry Track (CCF B)\n\n***** Publication 2: ***** \nTitle: BRAFAR: Bidirectional Refactoring, Alignment, Fault Localization, and Repair for Programming Assignments\nPublished Time: 2024\nConference: ISSTA 2024 (CCF A)\n\n***** Publication 3: ***** \nTitle: Characterizing and Detecting Program Representation Faults of Static Analysis Frameworks via Two-Dimensional Testing\nPublished Time: 2024\nConference: ISSTA 2024 (CCF A)\n\n***** Publication 4: ***** \nTitle: Understanding and Detecting Annotation-induced Faults of Static Analyzers\nPublished Time: 2024\nConference: ESEC/FSE 2024 (CCF A)\n\n***** Publication 5: ***** \nTitle: Deep is Better? An Empirical Comparison of Information Retrieval and Deep Learning Approaches to Code Summarization\nPublished Time: 2024\nConference: ACM Transactions on Software Engineering and Methodology (TOSEM) (CCF A)\n\n***** Publication 6: ***** \nTitle: Smart Issue Detection for Large-Scale Online Service Systems Using Multi-Channel Data\nPublished Time: 2024\nConference: 27th International Conference on Fundamental Approaches to Software Engineering (FASE 2024) (CCF B)\n\n***** Publication 7: ***** \nTitle: Comprehensive Semantic Repair of Obsolete GUI Test Scripts for Mobile Applications\nPublished Time: 2024\nConference: 46th International Conference on Software Engineering (ICSE '24) (CCF A)\n\n***** Publication 8: ***** \nTitle: Empirically Revisiting and Enhancing Automatic Classification of Bug and Non-Bug Issues\nPublished Time: 2024\nConference: Frontiers of Computer Science (FCS) (CCF B)\n\n***** Publication 9: ***** \nTitle: Statfier: Automated Testing of Static Analyzers via Semantic-preserving Program Transformations\nPublished Time: 2023\nConference: ESEC/FSE 2023 (CCF A)\n\n***** Publication 10: ***** \nTitle: Enhancing Fault Injection Testing of Service Systems via Fault-tolerance Bottleneck\nPublished Time: 2023\nConference: IEEE Transactions on Software Engineering (TSE) (CC Since there is no text provided, I will output the name as instructed:\n\n***** Name: ***** YanFiona\n\nHowever, I couldn't find any text to extract the core content, title, published time, and conference of researcher's publications. If you provide the text, I'll be happy to assist you further. ***** content: *****\nName: Jingcai\n\n1. Title: Personalized Federated Domain-Incremental Learning Based on Adaptive Knowledge Matching\nPublished Time: In press\nConference: IEEE Transactions on Mobile Computing (TMC)\n\n2. Title: Multi-modal Dual-embedding Networks for Malware Open-set Recognition\nPublished Time: DOI:10.1109/TNNLS.2024.3373809\nConference: IEEE Transactions on Neural Networks and Learning Systems (TNNLS)\n\n3. Title: Semantic Reasoning with Compound Domains for Single-Domain Generalized Object Detection\nPublished Time: Accept\nConference: IEEE Transactions on Neural Networks and Learning Systems (TNNLS)\n\n4. Title: Data Quality-aware Mixed-precision Quantization via Hybrid Reinforcement Learning\nPublished Time: DOI:10.1109/TNNLS.2024.3409692\nConference: IEEE Transactions on Neural Networks and Learning Systems (TNNLS)\n\n5. Title: Unveiling User Interests: A Deep User Interest Exploration Network for Sequential Location Recommendation\nPublished Time: DOI:10.1016/J.INS.2024.121416\nConference: Information Sciences (INS)\n\n6. Title: On the Robustness of Neural-enhanced Video Streaming Against Adversarial Attacks\nPublished Time: DOI:10.1109/AAAI.2024.3350380\nConference: AAAI Conference on Artificial Intelligence\n\n7. Title: Progressive Cross-primitive Compatibility for Open-World Compositional Zero-Shot Learning\nPublished Time: DOI:10.1109/AAAIAAAI.2024.3409692\nConference: AAAI Conference on Artificial Intelligence\n\n8. Title: Non-Exemplar Online Class-incremental Continual Learning via Dual-prototype Self-augment and Refinement\nPublished Time: DOI:10.1109/AAAIAAAI.2024.3350380\nConference: AAAI Conference on Artificial Intelligence\n\n9. Title: Patch Automatic Skip Scheme for Efficient On-device Video Perception\nPublished Time: DOI:10.1109/TPAMI.2024.3350380\nConference: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)\n\n10. Title: Learning Personalized Causally Invariant Representations for Heterogeneous Federated Clients\nPublished Time: ICLR 2024\nConference: International Conference on Learning Representations\n\n11. Title: Disentangled Prompt Tuning ***** Researcher's Name: ***** Li Wenjie\n\n***** Publication 1: *****\nTitle: Social Media Content Analysis: Natural Language Processing and Beyond\nPublished Time: November 2017\nConference: Series on Language Processing, Pattern Recognition, and Intelligent Systems\n\n***** Publication 2: *****\nTitle: Dialogue Acts Enhanced Extract-Abstract Framework for Meeting Summarization\nPublished Time: May 2024\nJournal Title: Information Processing and Management\nJournal Volume Number: 61\nJournal Issue Number: 3\n\n***** Publication 3: *****\nTitle: Target-constrained Bidirectional Planning for Goal-driven Dialogue Generation\nPublished Time: September 2023\nJournal Title: ACM Transactions on Information Systems (TOIS)\nJournal Volume Number: 42\nJournal Issue Number: 2\n\n***** Publication 4: *****\nTitle: Alignment Efficient Image-Sentence Retrieval Considering Transferable Cross-Modal Representation Learning\nPublished Time: 2024\nJournal Title: Frontiers of Computer Science\nJournal Volume Number: 18\nJournal Issue Number: 1\n\n***** Publication 5: *****\nTitle: Alignment Efficient Image-Sentence Retrieval Considering Transferable Cross-Modal Representation Learning\nPublished Time: 2023\nJournal Title: Frontiers of Computer Science\nJournal Volume Number: 18\nJournal Issue Number: 1\n\n***** Publication 6: *****\nTitle: Contextualized Knowledge Graph Embedding for Explainable Talent Training Course Recommendation\nPublished Time: September 2023\nJournal Title: ACM Transactions on Information Systems (TOIS)\nJournal Volume Number: 42\nJournal Issue Number: 2\n\n***** Publication 7: *****\nTitle: A Target-driven Planning Approach for Goal-oriented Dialogue Systems\nPublished Time: January 2023\nJournal Title: IEEE Transactions on Neural Networks and Learning Systems (TNNLS)\nJournal Volume Number: 1\nJournal Issue Number: 2\n\n***** Publication 8: *****\nTitle: Geo-Tile2Vec: A Multi-Modal and Multi-Stage Embedding Framework for Urban Analytics\nPublished Time: November 2022\nJournal Title: ACM Transactions on Spatial Algorithms and Systems\nJournal Volume Number: 1\nJournal Issue Number: 11\n\n***** Publication 9: *****\nTitle: Mutually Reinforced Network Embedding: An Integrated Approach to Research Paper Recommendation\nPublished Time: October 2022\nJournal Title: Expert Systems with Applications\nJournal Volume Number: 204\nJournal Issue Number ***** Researcher's Name: ***** Yancheng Yuan\n\n***** Publication 1: *****\nTitle: SIOPT An Efficient Sieving based Secant Method for Sparse Optimization Problems with Least-squares Constraints\nPublished Time: 2024\nConference: SIAM Journal on Optimization\n\n***** Publication 2: *****\nTitle: Collective Certified Robustness against Graph Injection Attacks\nPublished Time: 2024\nConference: Proceedings of the 41th International Conference on Machine Learning\n\n***** Publication 3: *****\nTitle: LaRA: Large Language-Recommendation Assistant\nPublished Time: 2024\nConference: The 47th International ACM SIGIR Conference on Research and Development in Information Retrieval\n\n***** Publication 4: *****\nTitle: Generate What You Prefer: Reshaping Sequential Recommendation via Guided Diffusion\nPublished Time: 2023\nConference: The 37th Conference on Neural Information Processing Systems\n\n***** Publication 5: *****\nTitle: A Dimension Reduction Technique for Large-Scale Structured Sparse Optimization Problems with Application to Convex Clustering\nPublished Time: 2022\nConference: SIAM Journal on Optimization\n\n***** Publication 6: *****\nTitle: An Efficient HPR Algorithm for the Wasserstein Barycenter Problem with O(Dim(P)/ε) Computational Complexity\nPublished Time: 2022\nConference: arXiv:2211.14881\n\n***** Publication 7: *****\nTitle: Convex Clustering: Model, Theoretical Guarantee and Efficient Algorithm\nPublished Time: 2021\nConference: Journal of Machine Learning Research\n\n***** Publication 8: *****\nTitle: An Efficient Semismooth Newton Based Algorithm for Convex Clustering\nPublished Time: 2018\nConference: Proceedings of the 35th International Conference on Machine Learning\n\n***** Publication 9: *****\nTitle: Revisiting Demonstration Selection Strategies in In-Context Learning\nPublished Time: 2024\nConference: The 62nd Annual Meeting of the Association for Computational Linguistics\n\n***** Publication 10: *****\nTitle: Invariant Collaborative Filtering to Popularity Distribution Shift\nPublished Time: 2023\nConference: Proceedings of the ACM Web Conference\n\n***** Publication 11: *****\nTitle: A Highly Efficient Algorithm for Solving Exclusive Lasso Problems\nPublished Time: 2023\nConference: Optimization Methods and Software\n\n***** Publication 12: *****\nTitle: Adaptive sieving: A dimension reduction technique ***** Researcher's Name: ***** \nRuijian\n\n***** Publications: ***** \n\n1. ***** Title: ***** An approximate control variates approach to multifidelity distribution estimation\n***** Published Time: ***** 2024\n***** Conference: ***** SIAM/ASA Journal on Uncertainty Quantification\n\n2. ***** Title: ***** Online Inference with Debiased Stochastic Gradient Descent\n***** Published Time: ***** 2024\n***** Conference: ***** Biometrika\n\n3. ***** Title: ***** Online Inference in High-Dimensional Generalized Linear Models with Streaming Data\n***** Published Time: ***** 2023\n***** Conference: ***** Electron. J. Stat.\n\n4. ***** Title: ***** A General Pairwise Comparison Model for Extremely Sparse Networks\n***** Published Time: ***** 2022\n***** Conference: ***** J. Amer. Statist. Assoc.\n\n5. ***** Title: ***** Probabilistic Methods for Approximate Archetypal Analysis\n***** Published Time: ***** 2022\n***** Conference: ***** Inf. Inference\n\n6. ***** Title: ***** Post-selection Inference of High-dimensional Logistic Regression under Case-control Design\n***** Published Time: ***** 2022\n***** Conference: ***** J. Bus. Econ. Stat.\n\n7. ***** Title: ***** Asymptotic Theory of Sparse Bradley-Terry Model\n***** Published Time: ***** 2020\n***** Conference: ***** Ann. Appl. Probab.\n\n8. ***** Title: ***** Curiosity-Driven Recommendation Strategy for Adaptive Learning via Deep Reinforcement Learning\n***** Published Time: ***** 2020\n***** Conference: ***** Br. J. Math. Stat. Psychol.\n\n9. ***** Title: ***** Bivariate Gamma Model\n***** Published Time: ***** 2020\n***** Conference: ***** J. Multivar. Anal.\n\n10. ***** Title: ***** Adaptive Learning Recommendation Strategy Based on Deep Q-learning\n***** Published Time: ***** 2020\n***** Conference: ***** Appl. Psychol. Meas. Since there is no text provided, I will output the researcher's name as per the instruction:\n\n\n***** content: Jiannong ***** ***** Researcher's Name: ***** LeiJohn\n\n***** Title: ***** Newly accepted NeurIPS 2024\n\n***** Published Time: ***** Not available\n\n***** Conference: ***** NeurIPS 2024\n\n***** Newly Accepted Papers: *****\n1. Voxel Mamba: Group-Free State Space Models for Point Cloud based 3D Object Detection in NeurIPS2024 (spotlight)\n2. AdaNeg: Adaptive Negative Proxy Guided OOD Detection with Vision-Language Models in NeurIPS2024\n3. SSL: A Self-similarity Loss for Improving Generative Image Super-resolution in ACM MM 2024\n\n***** Preprints: *****\n1. Spatial-Mamba: Effective Visual State Space Models via Structure-Aware State Fusion \n2. FreCaS: Efficient Higher-Resolution Image Generation via Frequency-aware Cascaded Sampling \n3. Toward Generalizing Visual Brain Decoding to Unseen Subjects \n4. Visual-O1: Understanding Ambiguous Instructions via Multi-modal Multi-turn Chain-of-thoughts Reasoning \n5. TokenPacker: Efficient Visual Projector for Multimodal LLM \n6. SyncNoise: Geometrically Consistent Noise Prediction for Text-based 3D Scene Editing \n7. Improving the Stability of Diffusion Models for Content Consistent Super-Resolution \n8. Towards Effective Multiple-in-One Image Restoration: A Sequential and Prompt Learning Strategy ***** Researcher's Name: ***** Yinxin Cao\n\n***** Publications: *****\n\n1. ***** Title: ***** Self-complementary (pseudo-)split graphs\n***** Published Time: ***** 2024\n***** Conference/Journal: ***** Graphs and Combinatorics\n\n2. ***** Title: ***** Modification problems toward proper (Helly) circular-arc graphs\n***** Published Time: ***** 2024\n***** Conference/Journal: ***** Information and Computation\n\n3. ***** Title: ***** (Sub)Linear kernels for edge modification problems toward structured graph classes\n***** Published Time: ***** 2022\n***** Conference/Journal: ***** Algorithmica\n\n4. ***** Title: ***** Graph searches and their end vertices\n***** Published Time: ***** 2022\n***** Conference/Journal: ***** Algorithmica\n\n5. ***** Title: ***** A 5k-vertex kernel for P2-packing\n***** Published Time: ***** 2022\n***** Conference/Journal: ***** Theoretical Computer Science\n\n6. ***** Title: ***** A polynomial kernel for diamond-free editing\n***** Published Time: ***** 2022\n***** Conference/Journal: ***** Algorithmica\n\n7. ***** Title: ***** End vertices of graph searches on bipartite graphs\n***** Published Time: ***** 2022\n***** Conference/Journal: ***** Information Processing Letters\n\n8. ***** Title: ***** Polynomial kernels for paw-free edge modification problems\n***** Published Time: ***** 2021\n***** Conference/Journal: ***** Theoretical Computer Science\n\n9. ***** Title: ***** Minimum fill-in: Inapproximability and almost tight lower bounds\n***** Published Time: ***** 2020\n***** Conference/Journal: ***** Information and Computation\n\n***** Conferences: *****\n1. ISAAC 2020\n2. IPEC 2020\n3. Computing and Combinatorics, 2017 Here is the extracted core content:\n\n***** Researcher's Name: ***** Jibin Wu\n\n***** Title: ***** Dr. Jibin Wu's Research\n\n***** Published Time: ***** Not available\n\n***** Conference: ***** NeurIPS, AAAI, TPAMI, TNNLS, TASLP, Neurocomputing, IEEE JSTSP Since there is no text provided, I will output the name as instructed:\n\n***** Name: ***** Shang \n\nHowever, I couldn't find any text to extract the core content from. Please provide the text, and I will be happy to assist you further. ***** Researcher: ***** \nKai\n\n***** Publications: ***** \n1. Certified Robustness of GNNs\n   Published Time: 05/2024\n   Conference: ICML 2024\n\n2. Making Graph Learning Models Provably Robust\n   Published Time: 03/2024\n   Conference: IEEE Symposium on Security and Privacy (Oakland) 2024\n\n3. Structural Attacks against Graph-based Anomaly Detection\n   Published Time: 11/2021\n   Conference: ICDE'22\n\n4. Structural Attacks against Android Malware Detection\n   Published Time: 09/2021\n   Conference: CCS'21\n\n5. Attacking Sign Prediction in Signed Graphs\n   Published Time: 09/2021\n   Conference: ICDM'21 Here is the extracted core content:\n\n**Name:** Peter\n**Title:** Dr. Peter Ng is a young and innovative researcher in artificial intelligence and game development.\n**Published Time:** \n- Received his BS, MSc and PhD at the Hong Kong Polytechnic University in 2004, 2007 and 2013 respectively.\n- Best student paper in the conference of Japan and Korea in 2011\n- Futuristic Award in Global Game Jam 2015\n**Conference:** \n- Conference of Japan and Korea (2011) ***** Name: ***** Binyan\n\n***** Title: ***** Selected Publications\n\n***** Published Time and Conference: *****\n- 2023: Journal of Machine Learning Research, 24, 1-69.\n- 2022: Journal of Machine Learning Research, 292, 1-38.\n- 2019: Journal of the American Statistical Association, 114, 857-868.\n- 2023: Journal of Machine Learning Research, 24 (134), 1-44.\n- 2021: Statistica Sinica, 31, 1549-1570.\n- 2020: Bernoulli, 26, 1234-1268.\n- 2020: Computational Statistics & Data Analysis, 142, 106812.\n- 2019: Journal of Machine Learning Research, 19 (31).\n- 2018: Electronic Journal of Statistics, 12, 2709-2742.\n- 2015: Annals of the Institute of Statistical Mathematics, 67, 211-227.\n- 2013: Statistics & Probability Letters, 83, 2492-2498.\n- 2012: Biometrika, 99, 915-928.\n\n***** High Frequency Data Analysis: *****\n- 2023: Journal of Financial Econometrics.\n- 2023: Journal of Nonparametric Statistics, 1-22.\n- 2023: Biometrical Journal, 65, 2100139.\n- 2019: Statistica Sinica, 29, 1633-1710.\n- 2013: Biostatistics, 14, 382-394.\n\n***** Conference Proceedings: *****\n- 2014: Proceedings of the 23rd International Conference on World Wide Web, 1247-1252.\n\n***** Collaborative Work: *****\n- 2020: PeerJ8, e10018.\n- 2015: Child Development, 86 (1), 294-302.\n\n***** R Packages: *****\n- PIE: Penalized Interaction Estimation(PIE) for ultrahigh dimensional quadratic regression.\n- EQUAL: Efficient admm algorithm via the QUAdratic Loss (EQUAL) for precision matrix estimation.\n- Mars: A second-order reduction algorithm for high-dimensional sparse precision matrices estimation. Here is the extracted core content:\n\n**Name:** WANG Dan\n\n**Title:** Platforms for Cyber-Physical Energy Systems\n\n**Published Time:** 2021-2022\n\n**Publications:**\n\n* **ACM e-Energy 2021:** Federated Analytics Energon: A Data Acquisition System for Portable Building Analytics\n* **ACM e-Energy 2020:** (TPC co-Chair)\n* **IEEE/ACM IWQoS 2020:** (TPC co-Chair)\n* **ACM Buildsys 2018:** (Best paper award) - A generative model\n* **ACM e-Energy 2018:** (Best paper award) - Our MPTCP measurement on high speed train\n* **ACM SIGCOMM 2018:** Our MPTCP measurement on high speed train\n* **IEEE INFOCOM 2018:** An IoT Communication Sharing Model for industry 4.0\n* **ACM Buildsys 2017:** System-in ACM Buildsys 2017 of our platform SPET\n* **Cambridge Press, 2016:** Book publication\n* **ACM SIGMETRICS 2015:** Sponsor Data Plan\n* **IEEE INFOCOM 2014:** Using Pricing Solutions for Better Matching of Internet Resource Supply and Demand\n\nNote: I did not include the researcher's current projects, awards, or non-publication related information in the output. Let me know if you would like me to extract any further information! Here is the extracted core content:\n\n***** Name: ***** Ping Li\n\n***** Award 1: ***** \nTitle: Highly Commended Team Award\nPublished Time: 2019\nConference: ALT Learning Technologist of the Year Awards\n\n***** Award 2: ***** \nTitle: Excellent work highlighted\nPublished Time: 2019\nConference: IEEE MMTC Communications - Review\n\n***** Publication 1: ***** \nTitle: Best Paper Award\nPublished Time: 2018\nConference: IEEE PIC \n\nNote: I assumed \"Ping\" and \"Ping Li\" are the same person, as the text seems to refer to the same individual. Let me know if this is incorrect! Here is the extracted core content of the text:\n\n**Wenqi Fan**\n\n1. **SSD4Rec: A Structured State Space Duality Model for Efficient Sequential Recommendation**\nPublished Time: 2024-09-11\nConference: arXiv:2409.01192 [ArXiv]\n\n2. **Joint Universal Adversarial Perturbations with Interpretations**\nPublished Time: 2024-08-17\nConference: arXiv:2408.01715 [ArXiv]\n\n3. **A Survey of Mamba**\nPublished Time: 2024-08-11\nConference: arXiv:2408.01129 [ArXiv]\n\n4. **TokenRec: Learning to Tokenize ID for LLM-based Generative Recommendation**\nPublished Time: 2024-06-04\nConference: arXiv:2406.10450 [ArXiv]\n\n5. **Graph Machine Learning in the Era of Large Language Models (LLMs)**\nPublished Time: 2024-04-14\nConference: arXiv:2404.14928 [ArXiv]\n\n6. **Rethinking Large Language Model Architectures for Sequential Recommendations**\nPublished Time: 2024-02-09\nConference: arXiv:2402.09543 [ArXiv]\n\n7. **A General Single-Cell Analysis Framework via Conditional Diffusion Generative Model**\nPublished Time: 2023-01-11\nConference: bioRxiv:20230101122B\n\n8. **FT-Shield: A Watermark Against Unauthorized Fine-tuning in Text-to-Image**\nPublished Time: 2023-01-11\nConference: bioRxiv:20230101122B\n\n9. **Leveraging Large Language Models (LLMs) to Empower Training-Free Dataset Condensation for Content-Based Recommendation**\nPublished Time: 2023\nConference: [ArXiv]\n\n10. **A Comprehensive Survey on Trustworthy Recommender Systems**\nPublished Time: 2022\nConference: [ArXiv] [PDF]\n\n11. **Defense Against Gradient Leakage Attacks via Learning to Obscure Data**\nPublished Time: 2022\nConference: [ArXiv]\n\n12. **Multi-agent Attacks for Black-box Social Recommendations**\nPublished Time: 2024\nConference: [ArXiv]\n\n13. **A Survey on RAG Meets LLMs: ***** Researcher's Name: ***** \nYuanqing Zheng\n\n***** Publications: ***** \n\n1. ***** Title: ***** \nFedConv: A Learning-on-Model Paradigm for Heterogeneous Federated Clients\n***** Published Time: ***** \nIn ACM MobiSys, 2024\n***** Conference: ***** \nMOBISYS'24\n\n2. ***** Title: ***** \nNeural Enhanced Underwater SOS Detection\n***** Published Time: ***** \nIn IEEE INFOCOM, 2024\n***** Conference: ***** \nINFOCOM'24\n\n3. ***** Title: ***** \nTalk2Radar: Talking to mmWave Radars via Smartphone Speaker\n***** Published Time: ***** \nIn IEEE INFOCOM, 2024\n***** Conference: ***** \nINFOCOM'24\n\n4. ***** Title: ***** \nAquaHelper: Underwater SOS Transmission and Detection in Swimming Pools\n***** Published Time: ***** \nIn ACM SenSys, 2023\n***** Conference: ***** \nSENSYS'23\n\n5. ***** Title: ***** \nConstruct 3D Hand Skeleton with Commercial WiFi\n***** Published Time: ***** \nIn ACM SenSys, 2023\n***** Conference: ***** \nSENSYS'23\n\n6. ***** Title: ***** \nConstruct 3D Hand Skeleton with Commercial WiFi\n***** Published Time: ***** \nIn ACM SenSys, 2023\n***** Conference: ***** \nIPSN'23\n\n7. ***** Title: ***** \nmmRipple: Communicating with mmWave Radars through Smartphone Vibration\n***** Published Time: ***** \nIn ACM IPSN, 2023\n***** Conference: ***** \nINFOCOM'23\n\n8. ***** Title: ***** \nVoShield: Voice Liveness Detection with Sound Field Dynamics\n***** Published Time: ***** \nIn IEEE INFOCOM, 2023\n***** Conference: ***** \nINFOCOM'23\n\n9. ***** Title: ***** \nMask Does Not Matter: Anti-Spoofing Face Authentication using mmWave without On-site Registration\n***** Published Time: ***** \nIn ACM MobiCom, 2022\n***** Conference: ***** \nMOBICOM'22\n\n10. ***** Title: ***** \nDeepEar: Sound Localization with Binaural Microphones\n***** Published Time: ***** \nIn IEEE INFOCOM, 2022\n***** Conference: ***** \nINFOCOM'22 & UBICOMP'21 & IMWUT\n\n11. ***** Title: ***** \nModel-based Head ***** Researcher's Name: ***** RAYNAL_Michel \n\n***** Title: ***** Michel Raynal\n\n***** Published Time: ***** Not Found\n\n***** Conference: ***** IRISA, University of Rennes, France ***** content: *****\n\nHaoyang\n\n1. **Fight Fire with Fire: Towards Robust Graph Neural Networks on Dynamic Graphs via Actively Defense**\n   - Published Time: 2024\n   - Conference: The 50th International Conference on Very Large Databases (VLDB 2024)\n\n2. **E2GCL: Efficient and Expressive Contrastive Learning on Graph Neural Networks**\n   - Published Time: 2024\n   - Conference: The 40th IEEE International Conference on Data Engineering (ICDE 2024)\n\n3. **Effective Data Selection and Replay for Unsupervised Continual Learning**\n   - Published Time: 2024\n   - Conference: The 40th IEEE International Conference on Data Engineering (ICDE 2024)\n\n4. **EARLY: Efficient and Reliable Graph Neural Network for Dynamic Graphs**\n   - Published Time: 2023\n   - Conference: The 2023 International Conference on Management of Data (SIGMOD 2023)\n\n5. **AIR: Adaptive Incremental Embedding Updating for Dynamic Knowledge Graphs**\n   - Published Time: 2023\n   - Conference: The 28th International Conference on Database Systems for Advanced Applications (DASFAA 2023)\n\n6. **Revisiting Injective Attacks on Recommender Systems**\n   - Published Time: 2022\n   - Conference: The 36th Conference on Neural Information Processing Systems (NeurIPS 2022)\n\n7. **Black-box Adversarial Attack and Defense on Graph Neural Networks**\n   - Published Time: 2022\n   - Conference: The 38th IEEE International Conference on Data Engineering (ICDE 2022)\n\n8. **Cache-based GNN System for Dynamic Graphs**\n   - Published Time: 2021\n   - Conference: The 30th ACM International Conference on Information and Knowledge Management (CIKM 2021)\n\n9. **Fine-Grained Entity Typing via Label Noise Reduction and Data Augmentation**\n   - Published Time: 2021\n   - Conference: The 26th International Conference on Database Systems for Advanced Applications (DASFAA 2021)\n\n10. **KBPearl: a Knowledge Base Population System Supported by Joint Entity and Relation Linking**\n    - Published Time: 2020\n    - Conference: The 46th International Conference on Very Large Databases (VLDB 2020)",
    "recruitment": "***** Name: XIAOBin *****\n\n***** Content: *****\n\n* Ph.D. Opportunity: Fellowship HK$18,890/month in Data Science, focusing on security and privacy.\n* Post-Doc Opportunity: HK RGC, PolyU Postdoctoral Fellowship schemes (around HKD30,000/month) in Data Science, AI security, Database security and privacy, or Web3.\n* Research Assistant Opportunity: Salary HKD13,500 - HKD20,000/month in Data Science, e.g., AI security, Database privacy, Web3.\n* Call for submissions to various conferences and special issues (IEEE GLOBECOM 2024, IEEE ICDCS 2022, IEEE TNSE special issue, etc.)\n* Congratulations to students and colleagues on their achievements (paper acceptance, job offers, etc.) ***** Name: Cao Jiannong *****\n\n***** Content: *****\n\nResearcher Cao Jiannong has published several papers in 2023 and 2024 on topics such as edge computing, big data, machine learning, distributed systems, and blockchain. Some of the papers include:\n\n* \"AdaptCL: Adaptive Continual Learning for Tackling Heterogeneity in Sequential Datasets\"\n* \"Building a Lightweight Trusted Execution Environment for Arm GPUs\"\n* \"Bayes-enhanced Multi-view Attention Networks for Robust POI Recommendation\"\n* \"Neural Abstractive Summarization for Long Text and Multiple Tables\"\n* \"CAGE: Complementing Arm CCA with GPU Extensions\"\n\nCao Jiannong is also recruiting strongly motivated PhD students for research in edge computing, big data, and machine learning, as well as research assistant and postdoctoral fellow positions. The requirements include eligibility for the Hong Kong PhD Fellowship Scheme for PhD students. Salary is not specified. ***** Name: LI Bo *****\n\n***** Research Interests: *****\nAlgorithmic Game Theory and Mechanism Design\nComputational Social Choice and Fair Division\nApproximation and Online Algorithms\n\n***** Lab Members: *****\nAnkang Sun (Postdoc)\nShiji Xing (PhD)\nFangxiao Wang (PhD)\nCheng Chen (PhD)\nJunzhe Jiang (PhD)\nMingqi Yuan (PhD)\nHabib Sifat (PhD)\nYu Zhou (PhD)\nKe Ding (RA)\nZekai Wu (RA)\n\n***** Alumni: *****\nYutong Wu (Research Scientist at Amazon)\nZhijing Hu (Master at Columbia)\nChenhao Wang (Assistant Professor at UIC and BNU Zhuhai)\nNi Yang (PhD at CityU)\nYicheng Wang (PhD at TAMU)\nTianze Wei (PhD at CityU)\nAlexander Lam (Exchange PhD from UNSW)\n\n***** Research Publications: *****\n1. Fair Division of Indivisible Goods: Recent Progress and Open Questions\n2. Your College Dorm and Dormmates: Fair Resource Sharing with Externailties\n3. Maximal Information Propagation via Lotteries\n4. Well-behaved Online Load Balancing Against Strategic Jobs\n5. Approximate and Strategyproof Maximin Share Allocation of Chores with Ordinal Preferences\n6. Bayesian Auctions with Efficient Queries\n7. Fair Allocation of Combinatorial Tasks: Beyond Additive Costs\n8. On Hill’s Worst-Case Guarantee for Indivisible Bads\n9. Prophet Inequality on I.I.D. Distributions: Beating 1-1/e with a Single Query\n10. Possible Fairness for Allocating Indivisible Resource\n11. Approximation Algorithm for Computing Budget-Feasible EF1 Allocations\n12. Multiagent MST Cover: Pleasing All Optimally via A Simple Voting Rule\n13. Automatic Intrinsic Reward Shaping for Exploration in Deep Reinforcement Learning\n14. Maximin-aware Allocations of Indivisible Chores with Symmetric and Asymmetric Agents ***** Name: Yiu Man Lung Ken *****\n\n***** Content: No information available on researcher's recruitment, salary, and lab conditions. ***** ***** Name: ChunBunHenry *****\n\n***** Content: No relevant information was found about the researcher's recruitment information, salary, and lab condition. The text mentions H.C.B. Chan's association with various research institutions and a research topic \"Reservation arbitrated access for statistical multiplexing voice traffic over dual-bus metropolitan area networks\", but does not provide any relevant information about the researcher's recruitment information, salary, and lab condition. ***** ***** Name: Shan *****\n\n***** Content: *****\n\nResearch Assistant Professor at The Hong Kong Polytechnic University (Oct 2021 - present)\n\n**Editorial Experience:**\n\n* Lead guest editor, \"Artificial Intelligence of Things for Future Communication Networks\", Computer Communications\n* Guest editor, \"Metaverse for Healthcare: Trends, Challenges, and Solutions\", IEEE Journal of Biomedical and Health Informatics\n\n**Talks and Presentations:**\n\n* Jan 2024, \"Peer to Peer Networking\" & \"High-performance Blockchain Consensus\", Polkadot Blockchain Academy\n* Nov 2023, \"数据要素流通技术：平台、进展与未来展望\", CCF YOCSEF技术论坛\n* Aug 2023, \"Decentralized Data Infrastructure for Web3: Current Progress and Future Directions\", Guilin University of Electronic Technology\n* Jun 2023, \"Blockchain-based Big Data Sharing and Trading\", 区块链推动龙江数字经济发展高级研修班\n* May 2023, Web3论剑：区块链的学术成果研讨, Hong Kong Web3 Festival 2023\n* Mar 2023, \"Artificial Intelligence of Things for Large Aircrafts\", COMAC 6th International Innovation Week\n* Sep 2022, \"Blockchain-empowered Big Data Sharing: Challenges and Opportunities\", Zhejiang Lab\n* Mar 2022, \"High Performance Packing and Searching for Blockchain-based Big Data Sharing\", Jinan University\n\n**Teaching Experience:**\n\n* Fall 2023 & Fall 2022, Distributed Algorithms and Protocols for Blockchains (COMP5567), The Hong Kong Polytechnic University\n* Spring 2022, Wireless Networking and Mobile Computing (COMP5327), The Hong Kong Polytechnic University\n* Spring 2020, Service and Cloud Computing (COMP4442), The Hong Kong Polytechnic University ***** Name: Maggie *****\n\n***** Content: We are recruiting postdoctoral fellows and RAs to work on natural language understanding and generation, machine conversation, summarization, and question answering. The lab is located at The Hong Kong Polytechnic University, Hung Hom, Kowloon, Hong Kong. ***** ***** Name: Dr. Man Ho Allen Au *****\n\n***** Content: Dr. Allen Au is a Full Professor at The Hong Kong Polytechnic University, with research interests in Information Security, Applied Cryptography, Blockchain Technology, and their applications. He has been ranked as a top scholar by Clarivate Analytics and listed as one of the World's Top 2% Scientists by Stanford University. ***** ***** Name: Zhang Weixiong *****\n\n***** Content: Actively recruiting researchers in noncoding transcript biogenesis and function. ***** ***** Name: Bo *****\n***** Content: All emails/CVs will be carefully read and evaluated. Only matched candidates will be responded. ***** ***** Name: YANG Hongxia *****\n\n***** Content: *****\n\nYANG Hongxia is currently recruiting fully funded Ph.D. students and postdocs specializing in Generative AI and decentralized computing. Self-funded visiting students and scholars are also welcome to apply. Recent publications include:\n\n* LoraRetriever: Input-Aware LoRA Retrieval and Composition for Mixed Tasks in the Wild (ACL, 2024)\n* Self-Infilling Code Generation (ICML, 2024)\n* LEMON: Lossless model expansion (ICLR, 2024)\n* Learning Stackable and Skippable LEGO Bricks for Efficient, Reconfigurable, and Variable-Resolution Diffusion Modeling (ICLR, 2024)\n\nPosition: Nanyang Institute of Technology\n\nNote: No information is available on salary and lab conditions. ***** Name: LIQing *****\n\n***** Content: *****\n\nConference Co-Chair:\nER2013\nACM RecSys 2013\nWAIM2010\nAPWeb-WAIM'09\nWISE'07\nINFOSCALE'07\nPCM'07\nNDBC'06\nHSI'2005\nHSI'2003\nAINA'2004\nRIDE'2004\nRIDE'2003\nODBASE'2003\nVLDB'2002\n\nProgram Committee Co-Chair:\nDASFAA2010\nER2008\nWAIM'2006\nAPWeb-WAIM'09\nACM RecSys 2013\nWAIM2010\nAPWeb-WAIM'09\nWISE'06\nPCM'07\nNDBC'06\nHSI'2004\n\nPanel Co-Chair:\nDASFAA'07\nWAIM'2004\n\nTreasurer:\nAPWEB'2006\nAPWEB'2005\n\nPractitioner Chair:\nACM ICMR 2012\n\nConference General Co-Chair:\nWISE'07\nINFOSCALE'07\nICWL'09\nICWL'08\nICWL'2007\nICWL'2006\nICWL'2005\nICWL'2004 Zecheng \n\ncontent: Two positions are available: PhD Position with a monthly salary of ~$18,890 and Research Assistant Position with a monthly salary of ~$13,500. The lab, led by Prof. Bin Xiao, focuses on smart contract security, decentralized identity, and related fields, and applicants should have a background in Computer Science, Information Technology, or a related field. ***** Chen Richard *****\n***** content: Recruitment of self-motivated MPhil/PhD students with strong academic backgrounds in computer science, creative media, communication, or psychology for human-centered computing research at The Hong Kong Polytechnic University ***** ***** Name: ROSSI_Luca *****\n\n***** Content: *****\n\nResearch assistant, PhD, and postdoctoral opportunities at PolyU with a deadline of December 1, 2024.\n\nRecent publications and acceptances:\n\n* GraFix: A Graph Transformer with Fixed Attention based on the WL Kernel (ICPR 2024)\n* Graph Kernel Neural Networks (IEEE Transactions on Neural Networks and Learning Systems)\n* Graph neural networks in vision-language image understanding: a survey (The Visual Computer)\n\nRecent research activities:\n\n* Chairing S+SSPR 2024 in Venice, Italy\n* Research collaborations with various institutions, including PolyU, University College London, and University of York\n\nResearch interests:\n\n* Graph neural networks\n* Quantum walk-based graph similarity\n* Graph kernel methods\n* Computer vision and pattern recognition\n\nResearcher's Recruitment Information:\n\n* Sanzhar Abdrakhim (URIS student)\n* Peiming Chen (PhD candidate, PolyU)\n* Chenyu Liu (PhD candidate, PolyU)\n\nNo information available on salary or lab conditions. ***** Wanyu *****\n***** content: Research Team Members and Recruitment Information *****\n\n* Research Team:\n\t+ 8 Ph.D. candidates and research assistants with diverse backgrounds\n* Research Team Recruitment Information:\n\t+ Looking for Post-Doctoral Fellows and Ph.D. Students interested in AI for Science and trustworthy AI\n* Research Focus:\n\t+ Developing machine learning techniques to accelerate scientific simulations and design applications in materials, structure safety ***** LI Jing Amelia *****\n\ncontent: \n\nLI Jing Amelia is a researcher who is recruiting PhD/Research Associate/Research Assistant/Post-doc for her team. She has worked on various projects, including Discourse Parsing for Online Conversations, Development of a 3-hour Online Programme on Artificial Intelligence and Data Analytics, Pre-training Methods for Short Texts, and Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms. Her research has been funded by various organizations, including NSFC (Young Scientists Fund), CCF-Baidu Open Fund, and PolyU Internal Fund. She has collaborated with other researchers on projects such as Cross-Media Keyphrase Prediction, Microblog Hashtag Generation, and Topic-Aware Neural Keyphrase Generation for Social Media Language. *****HUANG Xiao*****\n\n*****content: Actively recruiting Ph.D. students and postdocs (fully funded) at The Hong Kong Polytechnic University.***** ***** Name: ZHANG Chengqi *****\n\n***** Content: Under his leadership, the Centre has attracted research funding in excess of $16.9 million from the ARC and industries, and attracted ten ARC Future Fellowships and five ARC DECRAs awards. ***** ***** YuMax *****\n\n***** content: *****\n\nResearcher's Recruitment Information:\n\n* CHEN Shunjie DING (Nanjing University) - 2018.11--2019.5\n* Wenxi WANG - 2017.9--2018.8\n* Tongtong XU (Nanjing University) - 2017.8--2018.3\n\nPublished Research Papers:\n\n* Semantics-Based Code Search Using Input/Output Examples (2018)\n* Contract-based Program Repair without the Contracts (2017)\n* GUI-guided repair of mobile test scripts (2019)\n* Easy Modelling and Verification of Unpredictable and Preemptive Interrupt-driven Systems (2019)\n\nNote: No information available on salary and lab condition. ***** Name: YanFiona *****\n\n***** content: There is no core content to extract as the provided text does not mention any relevant information about salaries or lab conditions. ***** ***** Name: Jingcai *****\n\n***** Content: *****\n\nJingcai is a Research Assistant Professor at the Hong Kong Polytechnic University (PolyU). He is eligible to hire and supervise PhD students, postdoctoral researchers, and research assistants. His research interests include graph neural networks, zero-shot learning, and federated learning.\n\nHe has published several papers in top-tier conferences and journals, including AAAI, CVPR, IEEE Transactions on Computers, and Neural Networks.\n\nSome of his notable works include:\n\n* Graph Knows Unknowns: Reformulate Zero-Shot Learning as Sample-Level Graph Recognition\n* Decomposed Soft Prompt Guided Fusion Enhancing for Compositional Zero-Shot Learning\n* Towards Data-Independent Knowledge Transfer in Model-Heterogeneous Federated Learning\n* UTDNet: A Unified Triplet Decoder Network for Multimodal Salient Object Detection\n\nHe is also interested in recruiting PhD students, postdoctoral researchers, and research assistants to join his lab. Interested candidates can contact him via email with their complete CV. Candidates with strong programming and mathematics backgrounds are preferred. ***** Name: Li Wenjie *****\n\n***** Content: *****\n\nResearch Position Opening: Postdocs, research associates/assistants for projects in Emotion-Driven Conversation, Goal-Driven Conversational Recommendation, Multi-Modal Conversational Question Answering, and Causality Mining and Reasoning in NLP.\n\nResearch Interests: Machine Conversion, Text Summarization, Question Answering, Causality Mining and Reasoning in NLP, Natural Language Understanding and Generation.\n\nRecent Journal Publications (2022-2024):\n\n* Dialogue Acts Enhanced Extract-Abstract Framework for Meeting Summarization\n* Target-constrained Bidirectional Planning for Goal-driven Dialogue Generation\n* Alignment Efficient Image-Sentence Retrieval Considering Transferable Cross-Modal Representation Learning\n* Contextualized Knowledge Graph Embedding for Explainable Talent Training Course Recommendation\n* A Target-driven Planning Approach for Goal-oriented Dialogue Systems\n* Geo-Tile2Vec: A Multi-Modal and Multi-Stage Embedding Framework for Urban Analytics\n* Mutually Reinforced Network Embedding: An Integrated Approach to Research Paper Recommendation\n* Social Attentive Deep Q-networks for Recommender Systems\n* Joint Learning of User Representation with Diffusion Sequence and Network Structure ***** Name: Yancheng *****\n***** Content: I am looking for postdoctoral fellows with foundation models/model compression/scientific computing backgrounds to join our research group at The Hong Kong Polytechnic University. ***** ***** Name: Ruijian *****\n\n***** Content: No relevant information is available for this researcher's recruitment, salary, and lab condition. ***** Jiannong \n content: No relevant content about researcher's recruitment information, salary and lab condition was found. ***** LeiJohn *****\n\n***** content: *****\n\nResearcher's Recruitment Information:\n\n* Postdoctoral Fellow or Research Associate positions on Video Generation and Vision-Language Models are available.\n* PhD Student positions jointly trained with OPPO Research Institute are available.\n* Research Interns on Image Enhancement, Diffusion Models, Vision-Language Models, etc., are available at OPPO Research Institute.\n\nLab Condition:\n\n* The Visual Computing Lab's mission is \"Y learning and beyond: for future visual enhancement and understanding.\"\n* Research projects:\n\t+ Spatial-Mamba: Effective Visual State Space Models via Structure-Aware State Fusion\n\t+ FreCaS: Efficient Higher-Resolution Image Generation via Frequency-aware Cascaded Sampling\n\t+ Toward Generalizing Visual Brain Decoding to Unseen Subjects\n\t+ Visual-O1: Understanding Ambiguous Instructions via Multi-modal Multi-turn Chain-of-thoughts Reasoning\n\t+ TokenPacker: Efficient Visual Projector for Multimodal LLM\n\t+ SyncNoise: Geometrically Consistent Noise Prediction for Text-based 3D Scene Editing\n\t+ Improving the Stability of Diffusion Models for Content Consistent Super-Resolution\n\t+ Towards Effective Multiple-in-One Image Restoration: A Sequential and Prompt Learning Strategy ***** Yinxin Cao *****\n***** content: Ph.D. Students and Postdocs applications welcome, send CV, research summary/statement, and cover letter via email. Undergraduate students can drop by office or attend group meeting at PQ815, 9:30am Friday. ***** ***** content: ***** \nJibin \nThe researcher is affiliated with the MIND Lab@PolyU, which is dedicated to advancing the frontiers of nature-inspired artificial intelligence research. ***** Name: Shang *****\n\n***** Content: No information found regarding researcher's recruitment, salary, and lab conditions. ***** ***** Name: Kai *****\n\n***** Content: *****\n\n* Researcher's Recruitment Information: Self-motivated Ph.D. student/Research Assistant/Post-doc to join group, including masters and undergraduate students at PolyU. Remote Research Assistant positions available for candidates from Mainland China universities.\n* Salary: RMB 1k - 8k per month, depending on profile.\n* Lab Condition: The lab is located in Hung Hom, Kowloon, Hong Kong, China, working on projects such as structural attacks against graph-based anomaly detection and trust analysis systems in signed social networks, with funding from the National Natural Science Foundation of China and the University Grants Committee (UGC) through the Early Career Scheme (ECS). ***** Name: Peter *****\n\n***** Content: Dr. Peter Ng is a young and innovative researcher in artificial intelligence and game development. ***** ***** Name: Binyan *****\n\n***** Content: *****\n\nResearcher Binyan is looking for PhD students, RA, and Postdoc. Contact information: by.jiang(at)polyu.edu.hk. Research areas include:\n\n* Dynamic covariance matrix estimation and portfolio analysis with high-frequency data\n* Penalized estimation of a class of single‐index varying‐coefficient models for integrative genomic analysis\n* Entropy learning for dynamic treatment regimes\n* Dynamic linear discriminant analysis in high dimensional space\n\nLocation: The Hong Kong Polytechnic University, Department of Data Science and AI. No salary information is available. ***** Name: WANG Dan *****\n\n***** Content: Recruiting funded Ph.D. slots available. Interested students can send their CV and have a chat with Professor Wang. His research focuses on smart building, including building energy efficiency, thermal comfort, and structural health monitoring. ***** ***** Name: Ping *****\n***** Content: Research Areas: Vision, AI, Graphics, and Creative Media ***** ***** \nName: Wenqi \n\nContent: \nResearch Interests: \n- Data Mining, Machine Learning, and Artificial Intelligence\n- Recommender Systems (RecSys) and Management Information Systems (MIS)\n- Large Language Models (LLMs)\n- Trustworthy AI: Adversarial Attacks & Robustness; Fairness; Explainability\n- Graph Machine Learning: Graph Neural Networks; Graph Foundation Models\n- AI/ML/DM + X: Business; Science\n\nCall for Papers: \n- Special Topics Track@WISE 2024\n- International Web Information Systems Engineering conference (WISE 2024)\n- Submission Deadline: 30 July 2024\n- Location: Doha Qatar\n- Conference Dates: 2-5 December 2024\n\nRecent Achievements: \n- Received a grant (Intra-Faculty Interdisciplinary Project) as PC/Co-PI\n- Survey paper accepted by IEEE TKDE 2024: \"Recommender Systems in the Era of Large Language Models (LLMs)\"\n- Multiple PhD/Postdoc/RA positions available (Year-round Recruitment) ***** ***** Name: Yuanqing *****\n\n***** Content: We are looking for PolyU Ug/Pg student helpers, PhD students, research staffs in all levels to work on exciting research projects related to Internet of Things, embedded systems, wireless sensing, security and privacy, robotics, and artificial intelligence. ***** RAYNAL_Michel \n***** content: No relevant information was found about the researcher's recruitment, salary, and lab condition. ***** ***** Name: Haoyang *****\n\n***** Content: *****\n\nHaoyang is seeking:\n\n* Full-time Research Assistants with strong coding skills\n* PhD candidates (starting from 2025/09 or later) to be supervised by Haoyang and Prof. Qing Li\n* Undergraduate and master's students with strong coding skills for research opportunities and potential PhD consideration\n* MSc students at PolyU for dissertation supervision (limited quotas available)\n\nResearch interests:\n\n* Data Management for Machine Learning\n* Data-driven Machine Learning\n* Data and Model Security\n* Large Language Models\n* Graph Neural Networks and Knowledge Bases"
}